Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: set servo _ to _ degrees (-90 to 90)
ca: posa el servo _ a _ graus (-90 a 90)
cs: nastav servo _ na úhel _ (-90 až 90)
de: setze Servo _ auf _ Grad (-90 bis 90)
el: ορίσε servo από _ έως _ μοίρες (-90 έως 90)
es: pon el servo _ a _ grados (-90 a 90)
ja: サーボ設定 _ を _ 度 (-90 - 90)
pt_br: fixe o servo _ a _ graus (-90 a 90)
ru: установить серво _ на _ градусов (от -90 до 90)
tr: _ servosunu _ dereceye ayarla (-90 to 90)
uz: servo -ni _ darajasiga o'rnatish (-90 dan 90 gacha)

source: set tempo to _ bpm at _ / _ signature
ca: fixa tempo a _ bpm i compàs a _ / _
cs: nastav tempo na _ bpm pro _ / _ tónt
de: setze Tempo auf _ bpm bei _ / _ Signatur
es: fija tempo a _ bpm y compás a _ / _

source: move motor _ _ steps _
ca: mou motor _ _ passos _
cs: otoč motor __ o _ krok(ů)
de: bewege Motor _ _ Schritte _
el: μοτερ _ _ βήματα _
es: mueve motor _ _ pasos _
ja: モーターを動かす _ _ ステップ _
pt_br: mova motor _ _ passos _
ru: двигать двигатель _ _ шаги _
tr: _ motorunu _ adım yürüt _
uz: harakatlanuvchi motor _ _ qadamlar _

source: yellow
ca: groc
de: gelb
es: amarillo

source: wifi last number
ca: wifi últim número
cs: poslední číslo WiFi
de: wifi letzte Zahl
es: último número recibido por wifi

source: Backward
ca: Enrere
cs: Vzad
de: Rückwärts
el: Πίσω
es: Atrás
ja: 後退
pt_br: Atrás
ru: Назад
tr: Geri

source: fabulous
ca: genial
cs: úžasný
de: fabelhaft
es: genial

source: motion
ca: moviment
cs: pohyb
de: Bewegung
el: κίνηση
es: movimiento
ja: モーション
pt_br: movimento
ru: движение
tr: hareket
uz: harakat

source: organ
ca: orgue
es: órgano

source: next _ bytes of file _
ca: següents _ bytes de l'arxiu _
cs: dalších _ bajtů ze souboru _
de: nächste _ Bytes der Datei _
el: επόμενα _ bytes του αρχείου _
es: siguientes _ bytes del archivo _
ja: 次のバイト列 _ ファイル _
pt_br: próximos _ bytes do arquivo _
ru: следующие _ байты файла _
tr: sonraki _ baytlar _ dosyasının
uz: keyingi _ bayt fayl _

source: set step threshold _ (0-50)
ca: fixa el llindar de les passes a _ (0-50)
cs: nastav práh kroku _ (0-50)
de: setze Schritt-Schwellenwert _ (0-50)
el: όρισε κατώφλι βημάτων _ (0-50)
es: fija el umbral del paso en _ (0-50)
ja: ステップ閾値を設定 _ (0-50)
pt_br: fixe o limite de passos em _ (0-50)
ru: установить пороговое значение шага _ (0-50)
tr: adım eşiğini _ (0-50) yap
uz: qadam chegarasini belgilash _ (0-50)

source: reverse _
ca: inverteix _
cs: obrať _
de: kehre _ um
es: invierte _

source: pluck note _ octave _ for _ ms
ca: punteja la nota _ a l'octava _ durant _ ms
cs: zadrnkej notu _ oktáva _ po _ ms
es: tañe la nota _ en la octava _ durante _ ms

source: plotter stop
ca: atura el plotter
es: detén plotter

source: display BMP file _ at x _ y _
ca: mostra imatge BMP _ a x _ y _
cs: zobraz BMP soubor _ na x _ y _
de: zeige BMP-Datei _ bei x _ y _
es: muestra archivo BMP _ en x _ y _
ru: отобразить BMP-файл _ на x _ y _

source: kbd;Logo / ⌘
ca: Logo / ⌘
cs: Logo / ⌘
de: Logo
es: Logo / ⌘

source: mouse;middle
ca: mig
cs: middle
de: Mitte
es: medio

source: clear step count
ca: esborra el recompte de passes
cs: vynuluj počet kroků
de: lösche Schrittzahl
el: Μηδένισε των μετρητή βημάτων
es: borra recuento de pasos
ja: ステップカウントをクリア
pt_br: apague contagem de passos
ru: очистить счетчик шагов
tr: adım sayısını sil
uz: qadamlar sonini o'chirish

source: nt;d#
cs: d#
es: re#

source: large (100%)
ca: gran (100%)
cs: velké (100%)
de: groß (100%)
es: grande (100%)

source: IR transmit device _ command _
ca: envia al dispositiu IR _ la comanda _
cs: IR odešli zařízení _ povel _
de: IR übertrage an Gerät _ Befehl _
es: envía al dispositivo IR _ el comando _

source: set video _
ca: configura el vídeo a _
cs: OLED nastav video _
es: configura vídeo a _
ru: установить режим отображения _

source: bmx280 altitude (feet)
ca: bmx280 altitud (peus)
cs: bmx280 nadmořská výška (stopy)
de: BMX280 Höhe (Fuß)
es: bmx280 altitud (pies)

source: scroll number _
ca: anima el nombre _
cs: zobraz číslo _
de: scrolle Zahl _
el: κύλιση αριθμού _
es: anima el número _
gl: animar o número _
ja: スクロール数字 _
pt_br: anime o número _
ru: прокрутка чисел _
tr: _ sayısını kaydır
uz: _ raqamni aylantirish

source: Hello World!
ca: Hola, món!
cs: Ahoj světe !
de: Hello Welt!
es: ¡Hola, Mundo!

source: Hummingbird Battery (mV)
ca: Hummingbird Bateria (mV)
de: Hummingbird Batterie (mV)
el: Hummingbird μπαταρία (mV)
es: Hummingbird Bateria (mV)
gl: Hummingbird Batería (mV)
ja: Hummingbird 電池容量 (mV)
pt_br: Hummingbird Bateria (mV)
ru: Батарея Hummingbird (мВ)
tr: Hummingbird Pil (mV)
uz: Hummingbird batareyasi (mV)

source: vibrato rate
ca: freqüència del vibrato
es: frecuencia del vibrato

source: BLE Keyboard
ca: Teclat BLE
cs: BLE klávesnice
de: BLE-Tastatur
es: Teclado BLE

source: instrument _ number _
ca: instrument _ número _
es: instrumento _ número _

source: initialize i2c _ address(hex) _ reset pin# _ flip _
ca: inicialitzar i2c _ adreça(hex) _ reset pin# _ girar _
cs: aktivuj OLED I2C _ adresa (hex) _ reset pin# _ otoč _
es: inicializar i2c _ dirección(hex) _ reset pin# _ girar _
ru: инициализировать i2c _ адрес(hex) _ контакт сброса# _ перевернуть _

source: Low Floor Tom
ca: Goliat greu
es: Goliat grave

source: NeoPanel set x _ y _ color _
ca: pinta píxel x _ y _ de color _ al NeoPanell
cs: NeoPanel nastav x _ y _ barva
de: NeoPanel setze x _ y _ Farbe _
es: pinta píxel x _ y _ de color _ en el NeoPanel

source: humm;Dial
ca: Rodeta
cs: vytoč
de: Drehknopf
es: Dial
gl: Dial
ja: 目盛り
pt_br: Dial
ru: Набор
tr: Kadran
uz: Nomer termoq

source: kbd;ESC
ca: ESC
cs: ESC
de: ESC
es: ESC

source: Finch Tail _ Red _ Green _ Blue _
ca: encén la cua de color R _ % G _ % B _ %
de: Finch Schwanz _ Rot _ Grün _ Blau _
el: Finch Ουρά Κόκκινο _ Πράσινο _ Μπλέ _
es: enciende la cola de color R _ % V _ % A _ %
ja: Finch しっぽ 赤 _ 緑 _ 青 _
pt_br: cor da cauda do Finch R _ % G _ % B _ %
ru: Хвост Finch _ Красный _ Зеленый _ Синий _
tr: Finch Kuyruk Kırmızı _ Yeşil _ Mavi _

source: turn _ degrees
ca: gira _ graus
cs: otoč o _ stupnů
de: drehe _ Grad
el: στρίψε _ μοίρες
es: gira _ grados
ja: 回る _ 度
pt_br: gire _ graus
ru: поворот _ градусов
tr: _ derece dön
uz: _ darajaga burish

source: Microphone
ca: Micròfon
cs: Mikrofon
de: Mikrofon
es: Micrófono
ru: Микрофон

source: bmx280 altitude (cm)
ca: bmx280 altitud (cm)
cs: bmx280 nadmořská výška (cm)
de: BMX280 Höhe (cm)
es: bmx280 altitud (cm)

source: humm;Sound
ca: So
cs: Zvuk
de: Klang
el: Ήχος
es: Sonido
gl: Son
ja: 音量
pt_br: Som
ru: Звук
tr: Ses
uz: Ovoz

source: sb set all LEDs to _
es: sb fija todos los LEDs a _

source: meh
ca: apàtic
de: egal
es: apático

source: set MIDI signal to pin _
ca: configura MIDI al pin _
es: configura MIDI al pin _

source: sb;servomotors
ca: servomotors
es: servomotores

source: list _ contains _
ca: la llista _ conté _
cs: seznam _ obsahuje _
de: Liste _ enthält _
es: la lista _ contiene _

source: effect 1
ca: efecte 1
es: efecto 1

source: aFunction
ca: unaFunció
cs: Funkce
de: eineFunktion
es: unaFunción

source: bank select 2
ca: selecció de banc 2
es: selección de banco 2

source: humidity DHT22 pin _
ca: humitat del DHT22 al pin _
cs: vlhkost DHT22 Pin _
de: Luftfeuchtigkeit DHT22 Pin _
el: υγρασία DHT22 ακροδέκτης _
es: humedad del DHT22 en pin _
ja: 湿度 DHT22 ピン _
pt_br: umidade do DHT22 no pino _
ru: влажность DHT22 pin _
tr: nem DHT22 pin _
uz: namlik DHT22 pin _

source: unique _
ca: elimina duplicats de _
cs: jedinečný _
de: mache _ eindeutig
es: elimina duplicados de _

source: _ is a digit
ca: _ és un dígit
cs: _ je číslice
de: _ ist eine Zahl
es: _ es un dígito
ru: _ является цифрой

source: kbd;tab
ca: tabulador
cs: tab
de: Tab
es: tabulador

source: Finch _ Line
ca: línia _
de: Finch _ Linie
el: Finch _ Απόσταση
es: línea _
ja: Finch _ 線
pt_br: linha _ do Finch
ru: Строка _ Finch
tr: Finch _ Çizgi

source: display _
ar: شاشة _
ca: pantalla _
cs: zobraz _
de: zeige _
el: οθόνη _
es: pantalla _
gl: pantalla _
ja: 表示 _
ru: экран _
tr: LED ekran _
uz: namoyish qilish (displey) _

source: fix
es: fijo
ru: фикс

source: NeoPanel draw BMP file _ at x _ y _
ca: mostra imagen BMP _ x _ y _ al NeoPanell
cs: NeoPanel zobraz BMP soubor na x _ y _
de: NeoPanel zeichne BMP-Datei _ auf x _ y _
es: muestra imagen BMP _ x _ y _ en el NeoPanel

source: UDP remote IP address
ca: adreça IP remota UDP
cs: vzdálená IP adresa UDP
de: UDP Sender-IP-Adresse
es: dirección IP remota de UDP

source: aString
ca: unText
cs: řetězec
de: Zeichenfolge
es: unaCadenaDeTexto

source: pan
ca: panning
es: panning

source: MAC address
ca: adreça MAC
cs: MAC adresa
de: MAC-Adresse
es: dirección MAC

source: get PN532 firmware version
ca: versió del firmware del PN532
cs: PN532 verze firmware
de: PN532 firmware version
el: διάβασε PN532 έκδοση firmware
es: versión del firmware del PN532
ja: PN532 ファームウェアバージョン取得
pt_br: versão de firmware do PN532
ru: получить версию прошивки PN532
tr: PN532 bellenim sürümü
uz: PN532 mikrodastur versiyasini olish

source: kbd;ScrollLock
ca: Bloqueig de desplaçament
cs: ScrollLock
de: ScrollLock
es: BloqDespl

source: move motor 1 _ and motor 2 _ _ steps
ar: تحرك المحرك 1 _ والمحرك 2 _ _ الخطوات
ca: mou motor 1 en _ i motor 2 en _ _ passos
cs: otoč motor 1 _ a motor 2 _ o _ krok(ů)
de: bewege Motor 1 _ und Motor 2 _ _ Schritte
el: μοτερ 1 κινήθου _ και μοτερ 2 κινήθου _ _ βήματα
es: mueve motor 1 en _ y motor 2 en _ _ pasos
gl: mover o motor 1 en _ e o motor 2 en _ _ pasos
ja: モーター1を動かす _ ステップ,モーター2 _ _ ステップ
pt_br: mova motor 1 _ e motor 2 _ _ passos
ru: двигать мотор 1 _ и мотор 2 на _ _ шагов
tr: motor 1 _ ve motor 2 _ _ adım yürüt
uz: motor 1 _ va motor 2 _ _ qadamlarini harakatlantiring

source: pseudorandom _ to _ with seed _
ca: nombre pseudo-aleatori entre _ i _ amb llavor _
cs: pseudonáhodné číslo od _ do _ s klíčem
es: número pseudoaleatorio entre _ y _ con semilla _

source: test IR
ar: اختبار الأشعة تحت الحمراء
ca: prova IR
de: teste IR
el: δοκιμή IR
es: prueba IR
gl: probar IR
ja: IR テスト
pt_br: teste IR
ru: проверка ИК
tr: IR testi
uz: IR ni sinash

source: release key _
ca: deixa anar la tecla _
cs: uvolni klávesu _
de: lasse Taste _ los
es: suelta la tecla _

source: client ID for WebSocket event _
ca: ID del client de l'esdeveniment de WebSocket _
cs: ID klienta pro WebSocket událost _
de: Client-ID für das WebSocket-Ereignis _
es: ID de cliente del evento de WebSocket _

source: happy
ca: feliç
cs: šťastný
de: glücklich
es: feliz

source: Pedal Hi-Hat
ca: Xarles (pedal)
es: Charles (pedal)

source: Home humidity
ca: Home humitat
es: Home humedad

source: _ is lowercase
ca: _ és en minúscules
cs: _ je malé písmeno
de: _ ist in Kleinbuchstaben
es: _ está en minúscula
ru: _ в нижнем регистре

source: join string list _ separator _
ca: uneix llista de texts _ amb separador _
cs: spoj seznam řetězců _ oddělovač
de: Listenelemente von _ mit Seperator _
es: une la lista de textos _ con separador _
ru: соединить массив строк _ разделителем _

source: Imagina temperature (°C)
ca: Imagina temperatura (°C)
es: Imagina temperatura (°C)

source: Beak Down
ca: Bec cap avall
de: Schnabel unten
el: Ράμφος Κάτω
es: Pico hacia abajo
ja: くちばしを下げる
pt_br: Bico para baixo
ru: Клюв вниз
tr: Gaga Aşağı

source: draw line on TFT from x _ y _ to x _ y _ color _
ca: dibuixa línia de x _ y _ a x _ y _ color _
cs: nakresli na TFT přímku z x _ y _ do x _ y _ barva _
de: zeichne Linie auf TFT von x _ y _ nach x _ y _ Farbe _
el: σχεδιάσε γραμμή στο TFT από x _ y _ στο x _ y _ χρώμα _
es: dibuja línea de x _ y _ a x _ y _ color _
gl: debuxar liña de x _ y _ a x _ y _ cor _
ja: TFT上に線を描く 位置 x _ y _ から x _ y _ まで 色 _
pt_br: desenhe linha de x _ y _ a x _ y _ com cor _
ru: нарисовать линию на TFT от x _ y _ до x _ y _ color _
tr: TFT çizgi başla x _ y _ son x _ y _ renk _
uz: TFT ga x _ y _ dan x _ y _ color _gacha chiziq chizish

source: turn fantàstic _ degrees
ca: gira el fantàstic _ graus
de: drehe fantàstic _ Grad
es: gira el fantàstic en _ grados

source: sort _
ca: ordena _
cs: setřiď _
de: sortiere _
es: ordena _

source: Network_Name
ca: Nom_De_Xarxa
cs: Jméno sítě
de: Netzwerkname
es: Nombre_de_red

source: wifi message received?
ca: wifi missatge rebut?
cs: přijata WiFi zpráva ?
de: wifi Nachricht empfangen?
es: ¿mensaje wifi recibido?

source: humm;Distance (cm)
ca: Distància (cm)
cs: Vzdálenost (cm)
de: Entfernung (cm)
el: Απόσταση (εκ)
es: Distancia (cm)
gl: Distancia (cm)
ja: 距離 (cm)
pt_br: Distância (cm)
ru: Дистанция (cm)
tr: Mesafe (cm)
uz: Masofa (sm)

source: kbd;return
ca: retorn
cs: return
de: Return
es: retorno

source: quarter note
ca: nota
cs: čtvrťová nota
de: Viertelnote
es: nota

source: kbd;NumLock
ca: Bloqueig numèric
cs: NumLock
de: NumLock
es: BloqNum

source: kbd;insert
ca: inserir
cs: insert
de: Einfügen
es: insertar

source: steps _
ca: i _ graus
es: y _ grados

source: bmx280 set base altitude _ meters
ca: bmx280 estableix l'altitud de referència en _ metres
cs: bmx280 nastav nadmořskou výšku
de: bmx280 setze Grundhöhe _ Meter
es: bmx280 establecer altitud de referencia _ metros

source: _flip display top _
ca: _girar la part superior de la pantalla _
cs: _ překlop OLED displej nahoře _
es: _girar la parte superior de la pantalla _
ru: _перевернуть экран _

source: button _ double pressed
ca: doble toc al botó _
cs: dvakrát stisknuto tlačítko _
de: Knopf _ doppelt gedrückt
el: κουμπί _ διπλό πάτημα
es: doble pulsación en botón _
ja: ボタン _ 2回押す
pt_br: duplo clique no botão _
ru: кнопка _ дважды нажата
tr: buton _ çift basıldı
uz: _ tugmasi ikki marta bosildi

source: asleep
ca: adormit
cs: ospalý
de: schlafend
es: dormido

source: aeolian
ca: eòlica
es: eólica

source: fract _ + _
ca: frac _ + _
cs: zlomek _ + _
de: Bruch _ + _
es: frac _ + _
ru: дробь _ + _

source: turn on microphone
ca: activa el micròfon
cs: zapni mikrofon
de: schalte Mikrofon ein
es: activa micrófono
ru: включить микрофон

source: connect
ca: connecta
cs: připojit
de: verbinden
es: conecta

source: Octopus LED pin _ toggle to _
ca: Octopus pin LED _ canviar a _
es: cambia pin LED _ a _

source: Octopus value of water level (0~40mm) at pin _
ca: Octopus nivell d'aigua (0~40mm) al pin _
es: nivel de agua (0~40mm) en el pin _

source: Select board type:
ca: Selecciona la teva placa:
cs: Výběr mikropočítače:
de: Board-Typ auswählen:
el: Επιλογή τύπου κάρτας:
es: Selecciona tu placa:
ja: ボードタイプを選択:
pt_br: Seleciona o tipo de placa:
ru: Выберите тип платы:
tr: Kart tipini seç:
uz: Plata turini tanlang:

source: Repeat the enclosed blocks the given number of times.
ca: Repeteix l'execució dels blocs que conté, el nombre de vegades especificat.
cs: Opakování vnořených bloků tolikrát kolikrát je uvedeno.
de: Wiederholt die umschlossenen Blöcke so oft wie angegeben.
es: Repite la ejecución de los bloques que contiene, el número de vece especificado.
tr: İçerilen blokları verilen sayıda tekrarlayın.

source: copy these blocks to the clipboard as a URL
ca: copia aquests blocs al porta-retalls com a URL
cs: kopírovat vybrané bloky do schránky jako URL
de: kopiere diese Blöcke als URL in die Zwischenablage
es: copia estos bloques al portapapeles como URL
tr: bu blokları panoya URL biçiminde kopyala

source: duplicate this block
ca: duplica aquest bloc
cs: duplikovat tento blok
de: Diesen Block duplizieren
el: αντίγραψε αυτό το μπλοκ
es: duplica este bloc
gl: duplicar este bloque
ja: このブロックを複製
pt_br: duplica este bloco
ru: дублировать данный блок
tr: bu bloğu çoğalt
uz: ushbu blokni nusxalash

source: Serial port:
ar: منفذ تسلسلي:
ca: Port sèrie:
cs: Seriový port:
de: Serieller Anschluss:
el: Σειριακή θύρα:
es: Puerto serie:
gl: Porto serie:
ja: シリアルポート:
pt_br: Porta serial:
ru: Серийный порт:
tr: Seri port:
uz: Ketma-ket port:

source: The board is not responding.
ar: اللوحة لا تستجيب.
ca: La placa no respon.
cs: Mikropočítačová deska neodpovídá.
de: Das Board reagiert nicht.
el: Η κάρτα δεν ανταποκρίνεται.
es: La placa no responde.
gl: A placa non responde.
ja: ボードが応答していません.
pt_br: A placa não responde.
ru: Плата не отвечает.
tr: Kart cevap vermiyor.
uz: Plata javob bermayapti.

source: duplicate selection
ca: duplica selecció
cs: duplikovat vybrané
de: dupliziere Auswahl
es: duplica selección

source: firmware version
ca: versió del firmware
cs: verze firmware
de: zeige Firmware-Version
el: έκδοση firmware
es: versión del firmware
gl: versión do firmware
ja: ファームウェアバージョン
pt_br: versão de firmware
ru: версия прошивки
tr: yerleşik bellenim sürümü
uz: mikrodastur versiyasi

source: export functions as library
ar: تصدير دوال كمكتبة
ca: exporta funcions com a llibreria
cs: exportovat funkce jako knihovnu
de: exportiere Funktionen als Modul
el: εξαγωγή λειτουργιών σαν βιβλιοθήκη
es: exporta funciones como librería
gl: exportar as funcións como unha biblioteca
ja: 関数をライブラリとして出力
pt_br: exporta funções como biblioteca
ru: экспортировать функцию как библиотеку
tr: fonksiyonları kütüphane olarak dışarı aktar
uz: funktsiyalarni kutubxona sifatida eksport qilish

source: Wukong set motor _ to _ (-100 to 100)
ca: Posa el motor _ a _ (-100 a 100)
es: pon el motor _ a _ (-100 a 100)

source: Octopus LED pin _ brightness _ %
ca: Octopus pin LED _ brillantor al _ %
es: fija brillo de pin LED _ al _ %

source: Octopus OLED clear
ca: Octopus esborra pantalla OLED
es: limpia pantalla OLED

source: Done!
ca: Fet!
cs: Hotovo!
de: Fertig!
el: Έγινε!
es: ¡Hecho!
ja: 完成!
pt_br: Feito!
ru: Готово!
tr: Bitti!
uz: Bajarildi!

source: Data Graph
ar: الرسم البياني
ca: Gràfica de dades
cs: Graf dat
de: Daten-Graph
el: Γραφική Παράσταση
es: Gráfico de datos
gl: Gráfico de datos
ja: データグラフ
pt_br: Gráfico de dados
ru: График данных
tr: Veri Grafiği
uz: Ma'lumotlar grafigi

source: Octo receive beam
ca: rep de telèfons via Octo
es: recibe de teléfonos vía Octo

source: Do you want me to update the one in the project?
ca: Vols actualitzar el projecte amb aquesta nova versió?
cs: Chcete toto aktualizovat v projektu?
de: Möchtest du sie im Projekt updaten?
el: Επιθυμείς να ανανεώσω αυτό του έργου;
es: ¿Quieres actualizar a esta nueva versión en el proyecto?
pt_br: Você quer que eu atualize no projeto?
ru: Вы хотите, чтобы я обновил что в проекте?
tr: Dosyadakinin güncellenmesini istermisiniz?

source: hide all block definitions
ca: amaga les definicions de tots els blocs
cs: skryj všechny definice bloků
de: verstecke alle Blockdefinitionen
es: oculta las definiciones de todos los bloques
tr: bütün blok tanımlamalarını gizle

source: Octopus motor fan pin _ speed to _ %
ca: Octopus motor del ventilador al pin _ velocitat al _ %
es: Octopus motor del ventilador en pin _ velocidad al _ %

source: NeZha stop all motors
ca: atura tots els motors
es: detén todos los motores

source: cutebotwheel;both
ca: ambdós
es: ambas

source: libdata;by
ar: من قبل
ca: per
cs: od
de: von
el: από
es: por
gl: por
ja: まで
pt_br: por
ru: по
tr: tarafından
uz: tomonidan

source: update firmware on board
ca: actualitza firmware a la placa
cs: aktualizace firmware v mikropočítači
de: aktualisiere Board-Firmware
el: επικαιροποίησε το firmware στην κάρτα
es: actualiza firmware de la placa
gl: actualizar o firmware da placa
ja: ボード上のファームウェアを更新
pt_br: atualiza o firmware da placa
ru: обновить прошивку платы
tr: yerleşik bellenimi güncelle
uz: plata mikrodastur yangilash

source: library information
ca: informació de la llibreria
cs: informace o knihovně
de: zeige Modulinformation
el: πληροφορία για την βιβλιοθήκη
es: información de la librería
ja: ライブラリの情報
pt_br: detalhes da biblioteca
ru: информация о библиотеке
tr: kütüphane bilgileri
uz: kutubxona haqida ma'lumot

source: make blocks bigger or smaller
ca: augmenta o redueix la mida dels blocs
cs: zvětšit / zmenšit bloky
de: stellt Blöcke größer oder kleiner dar
es: aumentar o reducir el tamaño de los bloques

source: arrange scripts
ar: ترتيب البرامج النصية
ca: organitza programes
cs: urovnat skripty
de: Skripte in einer Reihe anordnen
el: Συγήρισε τα κείμενα
es: organiza programas
gl: organizar programas
ja: スクリプトを編集する
pt_br: organiza programas
ru: расположить скрипты
tr: betikleri düzenle
uz: skriptlarni tashkil qilish

source: about...
ar: حول...
ca: sobre...
cs: o...
de: über...
el: σχετικά…
es: sobre...
gl: sobre...
ja: ...について
pt_br: sobre...
ru: о...
tr: hakkında...
uz: haqida...

source: folder;System
ca: Sistema
cs: Systém
es: Sistema

source: NeZha stop motor _
ca: atura el motor _
es: detén el motor _

source: string or number
ca: text o nombre
cs: řetězec nebo číslo
de: Zeichenfolge oder Zahl
el: συμβολοσειρά ή αριθμός
es: texto o número
gl: texto ou número
ja: 文字列または数字
pt_br: texto ou número
ru: строка или число
tr: dizgi veya sayı
uz: satr yoki raqam

source: paste all scripts
ar: لصق جميع البرامج النصية
ca: enganxa tots els programes
cs: načíst všechny skripty ze schránky
de: füge alle Skripte ein
el: Επικόλησε όλα τα κείμενα
es: pega tocos los programas
gl: pegar todos os programas
ja: すべてのスクリプトを貼り付ける
pt_br: cola todos os programas
ru: вставить все скрипты
tr: tüm betikleri yapıştır
uz: barcha skriptlarni joylashtirish

source: Start
ar: بداية
ca: Inicia
el: Ξεκίνα
es: Inicia
gl: Iniciar
ja: 開始
pt_br: Inicia
ru: Старт
tr: Başla
uz: Boshlang

source: editable number or string
ca: nombre o text editable
cs: editovatelné číslo/řetězec
de: editierbare Zahl oder Zeichenfolge
el: επεξεργάσιμος αριθμός ή συμβολοσειρά
es: número o texto editable
gl: número ou texto editábel
ja: 編集可能な数字または文字列
pt_br: número ou texto editável
ru: редактируемый номер или строка
tr: düzenlenebilir sayı veya dizgi
uz: tahrirlanadigan raqam yoki satr

source: Script is too large to send to board.
ar: البرنامج النصي كبير جدًا بحيث لا يمكن إرساله إلى اللوحة
ca: El programa és massa gran per enviar-se a la placa.
cs: Skript je příliš velký aby mohl být odeslán do mikropočítače.
de: Skript ist zu groß, um an das Board gesendet zu werden.
el: Το κείμενο είναι πολύ μεγάλο για να σταλεί στην κάρτα
es: El programa es demasiado grande para mandarlo a la placa.
gl: O programa é grande de máis para envialo á placa..
ja: ボードに送信するにはスクリプトが大き過ぎます.
pt_br: O programa é muito grande para enviar para a placa.
ru: Скрипт слишком большой для отправки на плату.
tr: Betik karta yüklemek için çok büyük.
uz: Skript buyurtma berish uchun juda katta.

source: show the definition of this block
ca: mostra la definició d'aquest bloc
cs: zobraz definici aktuálního bloku
de: Blockdefinition für diesen Block anzeigen
el: δείξε τον ορισμό αυτού του μπλοκ
es: muestra la definición de este bloque
gl: amosa a definición deste bloque
ja: このブロックの定義を表示
pt_br: mostra a definição deste bloco
ru: показать определение данного блока
tr: bu bloğun tanımını göster
uz: ushbu blokning ta'rifini ko'rsating

source: Are you sure you want to remove this block definition?
ar: هل أنت متأكد من أنك تريد إزالة تعريف الكتلة؟
ca: Segur que vols esborrar la definició d'aquest bloc?
cs: Jsi si jistý že chceš odstranit definici tohoto bloku?
de: Bist du sicher, dass du diese Blockdefinition löschen möchtest?
el: Είσαι σίγουρος ότι επιθυμείς να αφαιρέσεις τον ορισμό του μπλοκ;
es: ¿Seguro que quieres borrar la definición de este bloque?
gl: Confirma que quere retirar a definición deste bloque?
ja: このブロック定義を削除してもいいですか?
pt_br: Tem certeza que quer remover a definição deste bloco?
ru: Вы уверены, что хотите удалить это определение блока?
tr: Bu bloğun tanımını sileceğinden emin misin?
uz: Ushbu blok ta'rifini olib tashlashga ishonchingiz komilmi?

source: Send a byte array via SPI, replacing its contents with the bytes received.
ca: Envia una llista de bytes per SPI, substituint els seus continguts pels bytes rebuts.
cs: Odeslání pole bajtů do SPI a nahrazení jejich obsahu přijatými bajty.
de: Sendet ein Byte-Array über SPI und ersetzt den Inhalt mit den empfangenen Bytes.
es: Envía una lista de bytes por SPI, sustituyendo sus contenidos por los bytes recibidos.
tr: İçeriğini alınan baytlarla değiştirerek SPI aracılığıyla bir bayt dizisi gönderin.
