Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: set pluck pin _
ca: fixa el pin de puntejat a _
cs: nastav pin pro drknání
es: fija el pin de cuerda tañida a _

source: ionian
ca: jònica
es: jónica

source: ms plot x _ y _ with _
ca: ms encén x _ y _ amb _
es: ms enciende x _ y _ con _

source: Farm electric consumption _
ca: Farm consum elèctric _
es: Farm consumo eléctrico _

source: Cutebot set headlight _ to _
ca: Posa el far _ a _
es: pon el faro _ a _

source: set MIDI note _ to _ on channel _ volume _
ca: posa la nota MIDI _ a _ al canal _ volum _
de: setze MIDI-Note _ auf _ auf Kanal _ Lautstärke _
es: pon la nota MIDI _ a _ en el canal _ volumen _

source: Files
ca: Arxius
cs: Soubory
de: Dateien
el: Αρχεία
es: Archivos
ja: ファイル
pt_br: Arquivos
ru: Файлы
tr: Dosyalar
uz: Fayllar

source: angry
ca: enfadat
cs: rozzlobený
de: wütend
es: enfadado

source: Crash Cymbal 2
ca: Plat d'accents (crash) 2
es: Plato de acentos (crash) 2

source: cutoff
ca: filtre de freqüència
es: filtro de frecuencia

source: right sensor
ca: sensor dret
cs: pravý senzor
de: rechter Sensor
es: sensor derecho

source: spi setup speed _
ca: fixa la velocitat SPI a _
cs: SPI nastav rychlost _
de: spi setze Geschwindigkeit _
es: velocidad de spi _
ru: установить скорость spi _
tr: spi hızı _

source: turn left
ca: gira a l'esquerra
cs: zatoč vlevo
de: drehe nach links
es: gira a la izquierda

source: Maj7
es: May7

source: Level
ca: Pla
de: Eben
el: Ίσιωσε
es: Plano
ja: レベル
pt_br: Plano
ru: Уровень
tr: Düz

source: kbd;Alt / ⌥
ca: Alt / ⌥
cs: Alt / ⌥
de: Alt
es: Alt / ⌥

source: pitch bend MIDI channel _ to _ %
ca: modula canal MIDI _ en un _ %
es: modula canal MIDI _ en un _ %

source: turns
ca: voltes
es: vueltas

source: hold _ mouse button
ca: manté premut el botó _ del ratolí
cs: podrž _ tlačítko myši
de: Halte _ Mausknopf
es: mantén pulsado el botón _ del ratón

source: Low Tom
ca: Tom-tom greu
es: Tom-tom grave

source: Farm steam level
ca: Farm nivell de vapor
es: Farm nivel de vapor

source: stop tone
ca: atura el so
cs: zastav tón
de: stoppe Ton
es: detén el sonido
ru: остановить звук

source: strings
ca: secció de cordes
es: sección de cuerdas

source: bmx280 pressure
ca: pressió del bmx280
cs: bmx280 tlak
de: BMX280 Luftdruck
el: bmx280 πίεση
es: presión del bmx280
ja: bmx280 気圧
pt_br: pressão do bmx280
ru: давление BMX 280
tr: bmx280 basınç
uz: bmx280 bosimi

source: soft
ca: suau
es: suave

source: Side Stick
ca: Vora de caixa
es: Aro de caja

source: Mute Triangle
ca: Triangle sord
es: Triángulo sordo

source: select MIDI instrument _ for channel _
ca: selecciona instrument MIDI _ pel canal _
es: selecciona instrumento MIDI _ para el canal _

source: tilt z
ar: الميل ض
ca: inclinació z
cs: náklon z
de: Neigung z
el: κλίση z
es: inclinación z
gl: inclinación z
ja: 仰角 z
pt_br: inclinação z
ru: наклон z
tr: eğilim z
uz: burilish z

source: Long Guiro
ca: Güiro llarg
es: Güiro largo

source: read into _ from file _
ca: llegeix a _ des de l'arxiu _
cs: načti do _ ze souboru
de: lies in _ aus der Datei _
es: lee a _ desde archivo _

source: bmp280 connected
ca: bmp280 connectat
cs: bmp280 připojen
de: BMP280 verbunden
el: -bmp280 ενώθηκε
es: bmp280 conectado
ja: bmp280 接続された
pt_br: bmp280 conectado
ru: bmp280 подключен
tr: bmp280 bağlandı
uz: bmp280 ulangan

source: THIS is a String! :)
ca: AIXÒ és un Text! :)
cs: TOTO je řetězec! :-)
de: DAS ist ein Text! :)
es: ¡ESTO es un Texto! :)

source: eight note
ca: corxera
cs: osminková nota
de: Achtelnote
es: corchea

source: set pattern to _ bars
ca: fixa el patró a _ compassos
de: setze Muster auf _ Takte
es: fija el patrón a _ compases

source: wifi connect to _ password _
ca: connecta't a la wifi _ amb contrasenya _
cs: WiFi připojení k AP _ heslo _
de: WiFi-Verbindung zu _ Passwort _
es: conéctate a la wifi _ con contraseña _

source: draw triangle on TFT at x _ y _ , x _ y _ , x _ y _ color _
ca: dibuixa triangle a x _ y _ , x _ y _ , x _ y _ color _
cs: nakresli na TFT trojúhelník s vrcholy x _ y_ , x _ y, x _ y _ barva _
de: zeichne Dreieck auf TFT bei x _ y_ , x _ y, x _ y _ Farbe _
el: σχεδιάσε τρίγωνο στο TFT στο x _ y _ , x _ y _ , x _ y _ χρώμα _
es: dibuja triángulo en x _ y _ , x _ y _ , x _ y _ color _
ja: TFT上に三角形を描く 位置 x _ y _ , x _ y _ , x _ y _ 色 _
pt_br: desenhe triângulo em x _ y _ , x _ y _ , x _ y _ com cor _
ru: нарисовать треугольник на TFT в x _ y _, x _ y _, x _ y _ color _
tr: TFT üçgen x _ y _ , x _ y _ , x _ y _ renk _
uz: uchburchakni TFT ustiga x _ y _, x _ y _, x _ y _ rangda chizish

source: end of file _
ca: final de l'arxiu _
cs: konec souboru _
de: Ende der Datei _
el: τέλος του αρχείου _
es: fin del archivo _
ja: ファイルの最後 _
pt_br: fim do arquivo _
ru: конец файла _
tr: _ dosya sonu
uz: faylning oxiri _

source: attack time
ca: temps d'atac
es: tiempo de ataque

source: str2num _
ca: text _ a nombre
cs: text->číslo _
es: texto _ a número

source: stop steppers
ar: وقف السائر
ca: atura motors
cs: zastav krokové motory
de: stoppe Schrittmotoren
el: σταμάτα τα βηματικά μοτέρ
es: detén motores
gl: deter motores
ja: ステップを停止する
pt_br: pare os motores
ru: остановить степперы
tr: step motorları durdur
uz: qadamlarni to'xtating

source: electronic
ca: electrònica
es: electrónica

source: High Agogo
ca: Agogó agut
es: Agogô agudo

source: pentatonic _ scale root _
ca: escala pentatònica _ amb arrel _
es: escala pentatónica _ con raíz _

source: release mouse buttons
ca: deixa anar els botons del ratolí
cs: uvolni tlačítka myši
de: Lasse Mausknopf los
es: suelta los botones del ratón

source: attach _ LED NeoPixel strip to pin _
ca: inicialitza tira de _ NeoPíxels al pin _
cs: připoj pásek _ NeoPixel LED na Pin _
de: mache _ LED zum NeoPixel-Streifen an Pin _
el: σύνδεσε _ LED NeoPixel strip στον ακροδέκτη _
es: inicializa tira de _ NeoPíxeles en el pin _
ja: 付ける _ LED個数 ネオピクセル ピン _
pt_br: inicialize a fita _ de NeoPixel no pino _
ru: прикрепить _ светодиодную полосу NeoPixel к контакту _
tr: _ LED Neopiksel şeridini pin _ bağla
uz: _ LED NeoPixel chizig'ini piniga bog'lash _

source: capacitive sensor _
ar: مستشعر سعوي ‪_‬
ca: sensor capacitiu _
cs: kapacitní senzor _
de: kapazitiver Sensor _
el: χωρητικός αισθητήρας _
es: sensor capacitivo _
gl: sensor capacitivo _
ja: 静電容量センサー _
pt_br: sensor capacitivo _
ru: ёмкостный сенсор _
tr: kapasitif sensör _
uz: sig'imi sensor _

source: NeoPanel fill row _ color _
ca: pinta fila _ color _ al NeoPanell
cs: NeoPanel řádek _ barva _
de: NeoPanel fülle Zeile _ Farbe _
es: pinta fila _ color _ en el NeoPanel

source: draw image _ at x _ y _
ca: dibuixar la imatge _ a x _ y _
cs: OLED nakresli obrázek _ na x _ y _
es: dibujar imagen _ en x _ y _
ru: рисовать изображение _ в x _ y _

source: sorted _
ca: _ ordenada
cs: seřazný _
de: _ sortiert
es: _ ordenada

source: sword
ca: espasa
cs: meč
de: Schwert
es: espada

source: brass
ca: vent metall
es: viento metal

source: MiKe digital D8 sensor
ca: MiKe sensor digital D8
es: MiKe sensor digital D8

source: HELLO ROSA!
ca: HOLA, ROSA!
cs: AHOJ KARLE!
de: HALLO ROSA!
es: ¡HOLA, ROSA!

source: defer display updates
ca: ajornar les actualitzacions de la pantalla
cs: OLED odlož aktualizaci displeje
es: posponer las actualizaciones de la pantalla
ru: отложить обновления экрана

source: Farm movement detected?
ca: Farm es detecta moviment?
es: Farm se detecta movimiento?

source: kbd;end
ca: fi
cs: end
de: Ende
es: fin

source: port _
es: puerto _

source: Farm water pump _
ca: Farm _ la bomba d'aigua
es: Farm _ la bomba de agua

source: small heart
ca: cor petit
cs: malé srdce
de: kleines Herz
es: corazón pequeño

source: Hello, world!
ca: Hola, món!
cs: Ahoj světe!
de: Hallo, Welt!
es: ¡Hola, mundo!

source: trigger event _
ca: dispara esdeveniment _
cs: trigger události _
de: löse Ereignis _ aus
el: ενεργοποίηση γεγονότος _
es: dispara evento _
ja: トリガーイベント _
pt_br: dispare evento _
ru: вызвать событие _
tr: _ olayını tetikle
uz: voqeani boshlash

source: stop servo _
ca: atura servo _
cs: zastav Servo _
de: stoppe Servo _
el: σταμάτησε το σέρβο _
es: detén servo _
ja: サーボ停止 _
pt_br: pare o servo _
ru: остановить сервопривод
tr: servoyu durdur
uz: servoni to'xtatish _

source: Cutebot sees line on left _ right _
ca: El Cutebot veu la línia a l'esquerra _ i la dreta _
es: Cutebot ve línea a su izquierda _ y su derecha _

source: move fantàstic _ mm
ca: mou el fantàstic _ mm
de: bewege fantàstic _ mm
es: mueve el fantàstic en _ mm

source: Low Timbale
ca: Timbala greu
es: Timbal grave

source: _ without white space
ca: _ sense espais en blanc
cs: _ bez mezer (bílych znaků)
de: _ ohne Leerzeichen
es: _ sin espacios en blanco
ru: _ без пробелов

source: fract _ = _
ca: frac _ = _
cs: zlomek _ = _
de: Bruch _ = _
es: frac _ = _
ru: дробь _ = _

source: Acoustic Snare
ca: Caixa acústica
es: Caja acústica

source: MiKe front lights to _
ca: MiKe llums del davant a _
es: MiKe luces delanteras a _

source: start WebSocket server
ca: inicia el servidor de WebSocket
cs: spustit WebSocket server
de: sterte WebSocket-Server
es: inicia el servidor de WebSocket

source: _ mouse click
ca: clic _ del ratolí
de: _ Mausklick
es: click _ del ratón

source: MiKe circle lights off
ca: MiKe apaga el cercle de llums
es: MiKe apaga círculo de luces

source: butterfly
ca: papallona
cs: motýl
de: Schmetterling
es: mariposa

source: turn _ / _ of circle
ca: gira _ / _ de volta
cs: otoč o _/ _ kruhu
de: drehe _ / _ eines Kreises
el: στρίψε _ / _ του κύκλου
es: gira _ / _ de vuelta
ja: 回る _ / _ 円
pt_br: gire _ / _ de volta
ru: поворот _ / _ круг
tr: dairenin _ / _ kadar dön
uz: aylanadan _ / _ buriling

source: Imagina play _ octave _ for _ ms
ca: Imagina toca la nota _ a l'octava _ durant _ ms
es: Imagina toca la nota _ a la octava _ durante _ ms

source: IR Remote
ca: Infraroigs
cs: IR Ovladač
de: IR-Fernzugriff
el: IR Τηλεχειριστήριο
es: Infrarrojos
gl: Infravermellos
ja: IR 距離
pt_br: Infravermelho
ru: ИК-пульт
tr: IR Uzaktan Kumanda
uz: IR masofadan boshqarish pulti

source: Beak Up
ca: Bec cap amunt
de: Schnabel oben
el: Ράμφος Πάνω
es: Pico hacia arriba
ja: くちばしを上げる
pt_br: Bico para cima
ru: Клюв вверх
tr: Gaga Yukarı

source: Keyboard and Mouse
ca: Teclat i ratolí
cs: Klávesnice a myš
de: Tastatur und Maus
es: Teclado y Ratón
ru: Клавиатура и мышь

source: Pseudorandomness
ca: Pseudo-aleatorietat
cs: Pseudonádodné
de: Pseudozufallszahl
es: Pseudoaleatoriedad

source: uppercase _
ca: _ en majúscules
cs: velká písmena _
de: _ in Großbuchstaben
es: _ en mayúscula
ru: в верхний регистр _

source: set plotter speed to _ %
ca: fixa velocitat del plotter a _ %
de: set Plottergeschwindigkeit auf _ %
es: fija velocidad del plotter a _ %

source: Farm light level
ca: Farm nivell de llum ambiental
es: Farm nivell de luz ambiental

source: clear
ca: netejar
cs: vymaž OLED
es: limpiar
ru: очистить

source: ED1 Stepper Motor
ca: Motors ED1
cs: EDI krokový motor
de: ED1 Schrittmotor
el: ED1 Μότερ Βήμάτος
es: Motores ED1
gl: Motores ED1
ja: ED1ステップモーター
pt_br: Motores ED1
ru: ED1 Шагомер
tr: ED1 Step Motoru
uz: ED1 Stepper Motori

source: brush
ca: escombretes
es: escobillas

source: light level
ar: مستوى الضوء
ca: nivell de llum
cs: intenzita světla
de: Lichtstärke
el: Μέτρηση φωτός
es: nivel de luz
gl: nivel de luz
ja: 光強度
pt_br: nível de luz
ru: уровень освещённости
tr: ışık seviyesi
uz: yorug'lik darajasi

source: NeoPanel fill column _ color _
ca: pinta columna _ color _ al NeoPanell
cs: NeoPanel sloupec _ barva _
de: NeoPanel fülle Spalte _ Farbe _
es: pinta columna _ color _ en el NeoPanel

source: filter _ with _
ca: filtra _ utilitzant _
cs: filtruj _ podle _
es: filtra _ utilizando _

source: pausing _ ms
ca: pausant _ ms
cs: pauza _ ms
de: pausiere _ ms
el: παύση _ χιλιοστά δευτερολέπτου
es: pausando _ ms
ja: 一時停止 _ ミリ秒
pt_br: pause por _ ms
ru: приостановка _ млс
tr: _ ms duraklatma
uz: ps pauza qilmoq

source: heart
ca: cor
cs: srdce
de: Herz
es: corazón

source: press key _
ca: prem tecla _
cs: stiskni klávesu _
es: pulsa tecla _

source: Acoustic Bass Drum
ca: Bombo acústic
es: Bombo acústico

source: MiKe circle light _ (1-18) to _
ca: MiKe llum _ del cercle(1-18) a _
es: MiKe luz _ del círculo(1-18) a _

source: plotter move X _ Y _
ca: mou plotter en X _ i Y _
de: Plotter gehe X _ Y _
es: mueve plotter en X _ e Y _

source: move mouse pointer by _ , _
ca: mou cursor del ratolí _ , _
cs: posuň ukazatel myši o _ , _
de: bewege Mauszeiger zu _ , _
es: mueve puntero del ratón en _ , _

source: TdR receive IR code
ca: TdR codi IR rebut
es: TdR código IR recibido

source: HTTP server
ca: Servidor HTTP
el: HTTP εξυπηρετητής
es: Servidor HTTP
ja: HTTPサーバー
pt_br: Servidor HTTP
ru: HTTP сервер
tr: HTTP sunucusu

source: HTTP server request
ca: sol·licitud HTTP al servidor
cs: požadavek na HTTP server
de: HTTP-Server-Anfrage
el: HTTP εξυπηρετητή αίτηση
es: petición HTTP al servidor
ja: HTTPサーバーの要求
pt_br: pedido HTTP ao servidor
ru: HTTP-запрос сервера
tr: HTTP sunucu isteği
uz: HTTP server so'rovi

source: and _ steps per chord
ca: i _ graus per acord
es: y _ grados por acorde

source: with body _
ca: amb contingut _
cs: s tělem _
de: mit Body _
el: με σώμα _
es: con contenido _
ja: with ボディ _
pt_br: com o conteúdo _
ru: с телом _
tr: gövde _
uz: tana bilan _

source: on
ca: encén
es: enciende

source: stop all notes on channel _
ca: atura totes les notes al canal _
es: detén todas las notas en el canal _

source: mixolydian
ca: mixolídia
es: mixolidia

source: _ ends with _
ca: _ acaba en _
cs: _ končí textem _
de: _ endet auf _
es: _ acaba en _
ru: _ заканчивается строкой _

source: Low Bongo
ca: Bongo greu
es: Bongo grave

source: MIDI channel
ca: canal MIDI
es: canal MIDI

source: acceleration
ca: acceleració
cs: zrychlení
de: Beschleunigung
el: επιτάχυνση
es: aceleración
ja: 加速度
pt_br: aceleração
ru: аккселератов
tr: ivme
uz: tezlashtirish

source: shuffled _
ca: _ barrejada
cs: proházený _
de: _ gemischt
es: _ mezclada

source: Servo
ca: Servomotors
el: Σέρβο μοτέρ
es: Servomotores
gl: Servomotores
ja: サーボ
pt_br: Servomotores
ru: Cервопривод

source: fract _ × _
ca: frac _ × _
cs: zlomek _ * _
de: Bruch _ × _
es: frac _ × _
ru: дробь _ × _

source: rabbit
ca: conill
cs: zajíc
de: Kaninchen
es: conejo

source: Pluck
ca: Guitarra
cs: Drknání na struny
es: Cuerda tañida

source: synth lead
ca: sintetitzador solista
es: sintetizador solista

source: NeoPanel fill rectangle x _ y _ width _ height _ color _
ca: pinta rectangle a x _ y _ amplada _ alçada _ color _ al NeoPanell
cs: NeoPanel vyplň obdélník na x _ y _ šířka _ výška _ barva _
de: NeoPanel fülle Rechteck x _ y _ Breite _ Höhe _ Farbe _
es: pinta rectángulo x _ y _ ancho _ alto _ color _ en el NeoPanel

source: kbd;PgDown
ca: AvPg
cs: PgDown
de: Bild ab
es: RePg

source: stop scrolling
ar: توقف عن التمرير
ca: atura l'animació
cs: zastav zobrazení
de: stoppe Scrollen
el: σταμάτημα κύλισης
es: detén la animación
gl: deter a animación
ja: スクロール停止
pt_br: pare a animação
ru: остановить прокрутку
tr: kaydırmayı durdur
uz: o'tishni to'xtatish

source: path of request _
ca: camí de la sol·licitud _
cs: cesta požadavku _
de: Pfad der Anfrage _
el: διαδρομή αίτησης _
es: ruta de la petición _
ja: リクエストのパス _
pt_br: caminho do pedido _
ru: путь запроса _
tr: istek yolu _
uz: so'rov yo'li _

source: Calliope set LED red _ green _ blue _
ca: posa el LED de la Calliope a vermell _ verd _ blau _
cs: Calliope setze LED rot _ grün _ blau _
de: Calliope setze LED rot _ grün _ blau _
es: pon el LED de la Calliope a rojo _ verde _ azul _
ja: Calliope LEDの設定 赤 _ 緑 _ 青 _
pt_br: fixe o LED do Calliope em vermelho _ verde _ azul _
ru: Установить каллиопа LED красный _ зеленый _ синий _
tr: Calliope LED ayarla kırmızı _ yeşil _ mavi _
uz: Calliope diodli qizil _ yashil _ ko'k _ belgilash

source: method of request _
ca: mètode de la sol·licitud _
cs: metoda pro odpověď _
de: Methode der Anfrage _
el: μέθοδος της αίτησης _
es: método de la petición _
ja: リクエストのメソッド _
pt_br: método do pedido _
ru: метод запроса _
tr: istek metodu _
uz: so'rov usuli _

source: strength
ca: potència
de: Stärke
el: δύναμη
es: potencia
ja: 強度
pt_br: potência
ru: Мощность
tr: güç

source: unplot x _ y _
ar: محو رسم س _ ص _
ca: apaga x _ y _
cs: zhasni x _ y _
de: lösche x _ y _
el: καθάρισε x _ y _
es: apaga x _ y _
gl: apagar x _ y _
ja: プロットを消す x _ y _
pt_br: apague x _ y _
ru: убрать черчение x _ y _
tr: söndür x _ y _
uz: chiqarish x _ y _

source: Tilt Right
ca: Inclinat a la dreta
de: Neigung Rechts
el: Κλίνε Δεξιά
es: Inclinado hacia la derecha
ja: 右へ向く
pt_br: Inclinação à direita
ru: Наклон вправо
tr: Sağa Yat

source: small diamond
ca: diamant petit
cs: malý diamant
de: kleiner Diamant
es: diamante pequeño

source: play note _ octave _ for _ ms
ar: تلعب نوتا _ اوكتاف _ خلال _ مللي ثانية
ca: toca la nota _ a l'octava _ durant _ ms
cs: hraj notu _ oktáva _ po _ ms
de: spiele Note _ Oktave _ für _ ms
el: παίξε νότα _ οκτάβα _ για _ χδ
es: toca la nota _ en la octava _ durante _ ms
gl: tocar a nota _ na oitava _ durante _ ms
ja: 音符を再生 _ 音階 _ 長さ _ ミリ秒
pt_br: toque a nota _ na oitava _ por _ ms
ru: воспроизвести ноту _ октавы _ на протяжении _ мс
tr: _ notasını _ oktavda _ milisaniye çal
uz: eslatmani _ octave _ ms davomida ijro etish

source: Cowbell
ca: Esquellot
es: Cencerro

source: yes
ca: sí
cs: ano
de: ja
es: sí

source: orchestra
ca: orquèstra
es: orquesta

source: tortoise
ca: tortuga
cs: želva
de: Schildkröte
es: tortuga

source: Hummingbird Rotation Servo _ _ %
ca: Hummingbird Servo Rotacional _ _ %
de: Hummingbird Drehung Servo _ _ %
el: Hummingbird Περιστροφή Servo _ _ %
es: Hummingbird Servo de rotacion _ _ %
gl: Hummingbird Servo Rotacional _ _ %
ja: Hummingbird 回転サーボ _ _ %
pt_br: Hummingbird Servo de Rotação _ _ %
ru: Hummingbird поворот сервопривода _ _ %
tr: Hummingbird _ Servosunu _ % döndür
uz: Hummingbird aylantirish servo _ _%

source: start BLE Keyboard
ca: inicia teclat BLE
de: starte BLE-Tastatur
es: inicia teclado BLE

source: locrian
ca: lòcria
es: locria

source: Closed Hi-Hat
ca: Xarles tancat
es: Charles cerrado

source: MiKe _ obstacle ?
ca: MiKe obstacle a la _ ?
es: MiKe obstáculo _ ?

source: ms humidity %
ca: ms humitat %
es: ms humedad %

source: prefix
es: prefijo
ru: префикс

source: show display buffer
ca: mostrar memòria intermèdia de visualització
cs: OLED ukaž obraz z paměti displeje
es: mostrar búfer de visualización
ru: показать буфер экрана

source: start WebThing server
ca: inicia el servidor de WebThings
cs: spustit WebThing Server
de: starte WebThing-Server
el: ξεκίνα εξυπηρετητή WebThing
es: inicia el servidor de WebThings
gl: iniciar o servidor de WebThings
ja: WebThingサーバーを開始
pt_br: inicia o servidor WebThings
ru: запустить сервер WebThing
tr: WebThing sunucusunu başlat
uz: WebThing serverini ishga tushiring

source: image.bmp
ca: imatge.bmp
cs: obrázek.bmp
de: bild.bmp
es: imagen.bmp

source: decay time
ca: temps de decaïment
es: tiempo de decaimiento

source: denominator of fraction _
ca: denominador de fracció _
cs: jmenovatel zlomku _
de: Nenner des Bruchs _
es: denominador de fracción _
ru: знаменатель дроби _

source: Low Conga
ca: Conga greu
es: Conga grave

source: diamond
ca: diamant
cs: diamant
de: Diamant
es: diamante

source: start tone _ Hz
ca: comença a tocar la freqüència _ Hz
cs: spusť tón _ Hz
de: spiele Ton mit _ Hz
es: toca la frecuencia _ Hz
ru: начать звук на частоте _ Гц

source: shuffle _
ca: barreja _
cs: proházej _
de: mische _
es: mezcla _

source: TdR light level
ca: TdR nivell de llum
es: TdR nivell de luz

source: TCS34725 connected
ca: TCS34725 connectat
cs: TCS34725 připojen
de: TCS34725 verbunden
el: TCS34725 συνδέθηκε
es: TCS34725 conectado
ja: TCS34725 接続された
pt_br: TCS34725 conectado
ru: TCS34725 подключен
tr: TCS34725 bağlandı
uz: TCS34725 ulangan

source: and headers _
ca: i capçaleres _
cs: a záhlaví _
de: und Header _
el: και επικεφαλίδες _
es: y cabeceras _
ja: and ヘッダー _
pt_br: e cabeçalho _
ru: и заголовки
tr: ve üstbilgiler _
uz: va sarlavhalar _

source: mouse;left
ca: esquerre
cs: levé
es: izquierdo

source: both sensors
ca: amdós sensors
cs: oba senzory
de: beide Sensoren
es: ambos sensores

source: guitar
ca: guitarra
es: guitarra

source: Open Hi-Hat
ca: Xarles obert
es: Charles abierto

source: dorian
ca: dòrica
es: dórica

source: percussive
ca: percussió
es: percusión

source: MiKe Robot go _ at _ %
ca: MiKe Robot vés a _ a _ %
es: MiKe Robot ir _ a _ %

source: Finch Turn _ _ ° at _ %
ca: gira cap a la _ _ ° a velocitat _ %
de: Finch Drehe _ _ ° mit _ %
el: Finch Στρίψε _ _ ° με _ %
es: gira hacia la _ _ ° a velocidad _ %
ja: Finch 回転 _ _ ° 位置 _ %
pt_br: girar o Finch _ _ ° à velocidade de _ %
ru: Повернуть Finch _ _ ° на _ %
tr: Finch Dön _ _ ° at _ %

source: arpeggiate _ in order _ duration _ and volume _ on _ _
ca: arpegia _ amb ordre _ durada _ i volum _ al _ _
es: arpegia _ en orden _ duración _ y volumen _ en el _ _

source: major 7th
ca: 7ª major
es: 7ª mayor

source: Finch Distance (cm)
ca: distància (cm)
de: Finch Entfernung (cm)
el: Finch Απόσταση (εκ)
es: distancia (cm)
ja: Finch 距離 (cm)
pt_br: distância do Finch (cm)
ru: Дистанция Finch (см)
tr: Finch Mesafe (cm)

source: TFT touch pressure
ca: pressió del toc a la TFT
cs: TFT tlak doteku
de: TFT Berührungsdruck
es: pressión del toque a la TFT

source: Imagina set digital pin _ to _
ca: Imagina posa el pin digital _ a _
es: Imagina pon el pin digital _ a _

source: Farm soil moisture
ca: Farm humitat del sol
es: Farm humedad del suelo

source: TFT touch Y position
ca: posició Y del toc a la TFT
cs: TFT dotek Y souřadnice
de: TFT Berührungsstelle y-Position
es: posición Y del toque a la TFT

source: sad
ca: trist
cs: smutný
de: traurig
es: triste

source: TFT touched
ca: TFT tocada
cs: TFT dotek
de: TFT berührt
es: TFT tocada

source: set display color _
ca: fixa el color de la pantalla a _
cs: nastav barvu displeje _
de: setze Anzeigefarbe _
es: fija el color de la pantalla a _
ru: задать цвет экрана _

source: most
ca: molts
cs: většina
es: la mayoría de

source: TdR clear RGB LED
ca: TdR apaga el led RGB
es: TdR apaga el LED RGB

source: Ride Cymbal 1
ca: Plat de ritme (ride) 1
es: Plato de ritmo (ride) 1

source: portamento control
ca: control del portamento
es: control del portamento

source: duck
ca: aneguet
cs: kachna
de: Ente
es: patito

source: Low Wood Block
ca: Caixa xinesa greu
es: Caja china grave

source: aList
ca: unaLlista
cs: sezname
de: Liste
es: unaLista

source: Ok
ar: وافق
ca: D'acord
es: De acuerdo
gl: Aceptar
ja: 確定
ru: ОК
tr: Tamam

source: scissors
ca: tisores
cs: nůžky
de: Schere
es: tijeras

source: roller skate
ca: patí
cs: kolečkové brusle
de: Rollschuh
es: patín

source: Cutebot set servo _ to speed _ (-100 to 100)
ca: Fixa la velocitat del servo _ a _ (-100 a 100)
es: fija la velocidad del servo _ a _ (-100 a 100)

source: numerator of fraction _
ca: numerador de fracció _
cs: čitatel zlomku _
de: Zähler des Bruchs _
es: numerador de fracción _
ru: числитель дроби _

source: current beat
ca: temps actual
cs: aktuální doba
de: aktueller Schlag
es: tiempo actual

source: Ride Cymbal 2
ca: Plat de ritme (ride) 2
es: Plato de ritmo (ride) 2

source: Low Agogo
ca: Agogó greu
es: Agogô grave

source: humm;Other
ca: Altres
cs: Jiné
de: Sonstige
el: Άλλα
es: Otro
gl: Outros
ja: その他
pt_br: Outro
ru: Прочее
tr: Diğer
uz: Boshqalar

source: Bass Drum 1
ca: Bombo 1
es: Bombo 1

source: diminished
ca: disminuïda
es: disminuida

source: triangle
cs: trojúhelník
de: Dreieck
es: triángulo

source: Chinese Cymbal
ca: Plat xinès
es: Plato chino

source: sb stop _
es: sb para _

source: set clap threshold _
ca: fixa el llindar d'aplaudiment a _
cs: nastav práh tlesknutí _
de: setze Applausschwellwert _
es: fija el umbral de palmada en _
ru: установить предел хлопка _

source: binary _
ca: binari _
cs: binární _
es: binario _

source: ghost
ca: fantasma
cs: duch
de: Geist
es: fantasma
