Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: set NeoPixels _ _ _ _ _ _ _ _ _ _
ca: posa NeoPíxels _ _ _ _ _ _ _ _ _ _
cs: nastav NeoPixel _ _ _ _ _ _ _ _ _ _
de: setze NeoPixel _ _ _ _ _ _ _ _ _ _
el: όρισε NeoPixels _ _ _ _ _ _ _ _ _ _
es: pon NeoPíxeles _ _ _ _ _ _ _ _ _ _
gl: poñer NeoPixeis _ _ _ _ _ _ _ _ _ _
ja: ネオピクセルを設定 _ _ _ _ _ _ _ _ _ _
pt_br: defina NeoPixels _ _ _ _ _ _ _ _ _ _
ru: задать NeoPixels _ _ _ _ _ _ _ _ _ _
tr: NeoPixel leri _ _ _ _ _ _ _ _ _ _ yap
uz: o'rnatish NeoPixels _ _ _ _ _ _ _ _ _ _

source: play tone pin _ frequency _
ar: لعب نغمة منفذ _ موجة تردد _
ca: toca un to al pin _ de freqüència _
cs: na pinu _ hrej tón o frekvenci _
de: spiele Ton Pin _ Frequenz _
el: παίξε τόνο στον ακροδέκτη _ συχνότητα _
es: toca un tono en el pin _ con frecuencia _
gl: toca un ton no pin _ na frecuencia _
ja: 音再生ピン _ 周波数 _
pt_br: toque um tom no pino _ com a frequência _
ru: воспроизвести тон на контакте _ с частотой _
tr: ton çal pin _ frekans _
uz: ohang tezligini _ ijro etish _

source: serial write _ starting at _
ca: escriu _ al port sèrie començant per _
cs: do seriového portu zapiš _ od _
de: serial schreibe _ starte bei _
es: escribe _ al puerto serie empezando por _
tr: seri yaz _ , _ bayttan başlayarak

source: radio send pair _ = _
ar: أرسل عبر الراديو زوج _ = _
ca: envia associació _ = _ per ràdio
cs: odešli rádiem jméno _ hodnota _
de: Radio sende Paar _ = _
el: ράδιο στείλε ζευγάρι _ =_
es: envía associación _ = _ por radio
gl: enviar asociación _ = _ por radio
ja: 送信されたペア _ = _
pt_br: envie associação _ = _ por rádio
ru: отправка пары по радио _ = _
tr: radyo değer yolla _ = _
uz: radio juftligini _ = _ yuborish

source: aStringListOrByteArray
ca: unTextLlistaOllistaDeBytes
cs: řetězec/pole bajtů
de: ZeichenfolgeListeOderByteArray
es: unTextoListaOlistaDeBytes
tr: birDizgiListeVeyaBaytDizisi

source: set all NeoPixels color _
ca: posa tots els NeoPíxels de color _
cs: nastav na všech NepoPixelech barvu _
de: setze alle NeoPixel auf Farbe _
el: όρισε όλα τα NeoPixels σε χρώμα _
es: pon todos los NeoPíxeles de color _
gl: poñer todos os NeoPixeis de cor _
ja: すべてのネオピクセルを設定 色 _
pt_br: defina todos os NeoPixels de cor _
ru: задать цвета всем NeoPixels _
tr: Tüm NeoPixel renklerini _ yap
uz: barcha NeoPixels ranglarini sozlash _

source: shape for letter _
ar: شكل الحرف _
ca: forma de la lletra _
cs: tvar pro písmeno _
de: Form für Buchstabe _
el: σχήμα για γράμμα _
es: forma para letra _
gl: forma para a letra _
ja: 文字の形 _
pt_br: forma para letra _
ru: форма для буквы _
tr: _ harfinin şekli
uz: xatning shakli _

source: radio message received?
ar: وصلت الرسالة عبر الراديو؟
ca: missatge de ràdio rebut?
cs: přijata rádiová zpráva?
de: Radio Nachricht erhalten?
el: παραλήφθηκε το μήνυμα ραδίου
es: ¿mensaje de radio recibido?
gl: mensaxe de radio recibida?
ja: 送信メッセージを受信したか?
pt_br: mensagem de rádio recebida?
ru: радио сообщение получено?
tr: radyo mesajı alındı mı?
uz: radio xabar olinganmi?

source: byte array
ca: llista de bytes
cs: pole bajtů
es: lista de bytes
ru: массив байт
tr: bayt dizisi

source: replace item _ of list _ with _
ca: canvia l'element _ de la llista _ per _
cs: nahraď prvek _ v seznamu _ hodnotou _
de: ersetze Element _ in Liste _ durch _
el: αντικατέστησε στοιχείο _ της λίστας _ με _
es: sustituye elemento _ de lista _ por _
ja: 置換 アイテム _ リスト _ 値 _
pt_br: substitua elemento _ da lista _ por _
ru: заменить элемент _ списка _ на _
tr: listede değiştir öğe#: _ liste: _ yeni değer _
uz: _ ro'yxatidagi _ bandini _ bilan almashtiring

source: add _ to list _
ca: afegeix _ a la llista _
cs: přidej _ do seznamu
de: füge _ zu Liste _ hinzu
el: πρόσθεσε _ στην λίστα _
es: añade _ a lista _
ja: 追加 _ をリスト _ に
pt_br: adicione _ à lista _
ru: добавить _ в список _
tr: listeye ekle değer: _ liste: _
uz: _ ro'yxatiga _ qo'shish

source: spi send _
ar: spi بعث _
ca: envia _ per SPI
cs: pošli do SPI _
de: spi sende _
el: spi στείλε _
es: spi envía _
gl: spi enviar _
ja: spi 送信 _
pt_br: spi a enviar _
ru: отправка spi _
tr: spi gönder _
uz: spi yuboring _

source: radio last signal strength
ar: راديو قوة الإشارة الأخيرة
ca: intensitat de l'última senyal de ràdio
cs: síla posledního radiového signálu
de: Radio letzte Signalstärke
el: ράδιο δύναμη τελευταίου σήματος
es: intensidad de la última señal de radio
gl: intensidade da última señal de radio
pt_br: intensidade do último sinal de rádio
ru: последняя мощность радио сигнала
tr: radyo son sinyal gücü
uz: radio oxirgi signal kuchi

source: all
ca: tots
cs: vše
de: alle
es: todos
ru: все
tr: tüm

source: last
ca: últim
cs: poslední
de: letztes
es: último
ru: последний
tr: son

source: cat;Variables
ar: المتغيرات
ca: Variables
cs: Proměnné
de: Variablen
el: Μεταβλητές
es: Variables
gl: Variábeis
ja: 変数
pt_br: Variáveis
ru: Переменные
tr: Değişkenler
uz: O'zgaruvchan

source: length of _
ar: طول _
ca: llargada de _
cs: délka _
de: Länge von _
el: μήκος του _
es: tamaño de _
gl: largo de _
ja: _ の長さ
pt_br: tamanho de _
ru: длина _
tr: _ uzunluğu
uz: uzunligi _

source: new byte array _
ca: nova llista de bytes de llargada _
cs: nové pole bajtů _
de: neues Byte-Array _
el: νέος byte πίνακας _
es: nueva lista de bytes de tamaño _
pt_br: novo vetor de bytes _
ru: новый байтовый массив _
tr: yeni bayt dizisi

source: radio send string _
ar: أرسل عبر الراديو سلسلة _
ca: envia text _ per ràdio
cs: odešli rádiem text _
de: Radio sende Zeichenfolge _
el: ράδιο στείλε σειρά χαρακτήρων
es: envía texto _ por radio
gl: enviar texto _ por radio
ja: 送信された文字列 _
pt_br: envie texto _ por rádio
ru: отправка строки по радио _
tr: radyo dizgi yolla _
uz: radio yuborish satr _

source: copy _ from _
ca: copia _ a partir de _
cs: kopíruj _ od _
de: kopiere _ beginnend bei _
el: αντίγραψε _ από _
es: copia _ desde _
ja: コピー _ を _ から
pt_br: copie _ desde _
ru: скопировать _ из _
tr: kopyala _ başla _
uz: _ dan _ nusxalash

source: cat;Advanced:
ca: Avançat:
cs: Rozšířené bloky:
de: Fortgeschrittene Blöcke:
el: Προχωρημένα:
es: Avanzado:
pt_br: Avançado:
ru: Продвинутый:
tr: Gelişmiş:

source: Enter function name:
ca: Nom de la funció:
cs: Zadej jméno funkce:
de: Gib der Funktion einen Namen:
el: Συμπλήρωσε το όνομα της λειτουργίας:
es: Nombre de la función:
gl: Nome da función:
ja: 機能名を入力:
pt_br: Nome da função:
ru: Введите название функции:
tr: İşlev adını gir:
uz: Funksiya nomini kiriting:

source: rpi channel _
ca: canal RPI _
cs: kanál RPI _
de: rpi Kanal _
es: canal de rpi _
ru: канал rpi _
tr: rpi kanal _

source: cat;Data
ca: Dades
cs: Data
de: Daten
el: Δεδομένα
es: Datos
ja: データ
pt_br: Dados
ru: Данные
tr: Veri
uz: Ma'lumotlar

source: as byte array _
ca: llista de bytes a partir de _
cs: jako pole bajtů _
de: als Byte-Array _
es: lista de bytes a partir de _
ru: как массив байт
tr: bayt dizisine çevir _

source: serial close
ca: tanca port sèrie
cs: zavři seriový port
de: serial schließen
es: cierra puerto serie
tr: seri portu kapat

source: print _
ar: طبع _
ca: escriu _
cs: tiskni _
de: drucke _
el: τύπωσε _
es: escribe _
gl: escribir _
ja: 表示する _
pt_br: escreva _
ru: вывод _
tr: yaz _
uz: chop etish _

source: radio last number
ar: راديو آخر رقم
ca: últim nombre rebut per ràdio
cs: poslední rádiem přijaté číslo
de: Radio letzte Zahl
el: ράδιο τελευταίος αριθμός
es: último número recibido por radio
gl: último número recibido por radio
ja: 送信された最新の数字
pt_br: último número recebido por rádio
ru: последний номер радио
tr: radyo son sayı
uz: radio oxirgi raqami

source: find _ in _
ca: busca _ en _
cs: najdi _ v _
de: suche _ in _
el: βρες _ μέσα _
es: busca _ en _
ja: 検索 _ を _ の中
pt_br: encontre _ em _
ru: найти _ в _
tr: _ bul _ içinde
uz: _ ichidan topish

source: mode _
cs: režim _
de: Modus _
es: modo _
ru: режим _
tr: mod _

source: string from unicode _
ca: caràcter amb unicode _
cs: řetězec z unicode _
de: Zeichenfolge aus Unicode _
el: συμβολοσείρα από unicode _
es: carácter con unicode _
ja: Unicode _ の文字列
pt_br: texto com unicode _
ru: строка из юникода _
tr: unicode dan harfe _
uz: unikoddan olingan satr _

source: bird
ca: ocell
cs: pták
de: Vogel
es: pájaro
ru: птица
tr: kuş

source: cat;Generic
ca: Genèric
cs: Obecné
de: Allgemein
es: Genérico
ru: Общие
tr: genel

source: radio send packet _
ca: envia paquet per ràdio _
cs: odešli packet _ rádiem
de: Radio sende Paket _
el: ράδιο αποστολή πακέτου _
es: envía paquete por radio _
gl: enviar paquetes por radio _
pt_br: envie pacote por radio _
ru: отправка радио пакета _
tr: radyo paket yolla _
uz: radio paketini jo'natish _

source: stop WiFi
ar: وقف واي فاي
ca: atura WiFi
cs: zastav WiFi
de: stoppe WiFi
el: σταμάτα WIFI
es: detén WiFi
gl: deter a WiFi
ja: WiFiの停止
pt_br: termine WiFi
ru: остановить WiFi
tr: WIFI durdur
uz: Wi-Fi-ni to'xtatish

source: ignore
ar: تجاهل
ca: ignora
cs: ignoruj
de: ignoriere
el: αγνόησε
es: ignora
gl: ignorar
ja: 無視する
ru: игнорировать
tr: yoksay
uz: e'tibor bermaslik

source: Add a reporter block
ca: Crea un bloc reportador
cs: Přidej blok povelů s návratovou hodnotou
de: Füge Rückgabeblock hinzu
el: Πρόσθεσε μπλοκ αναφοράς
es: Crea un bloque reportador
gl: Engadir un bloque de reportes
ja: リポーターブロックを追加
pt_br: Criar um bloco repórter
ru: Добавить блок докладчик
tr: Bildiren bloğu ekle
uz: Uzatuvchi blokni qo'shish

source: dog
ca: gos
cs: pes
de: Hund
es: perro
ru: собака
tr: köpek

source: i2c get device _ register _
ar: الحصول على جهاز _ سجل _ i2c
ca: llegeix del dispositiu I2C _ el registre _
cs: čti z I2C zařízení _ registr _
de: i2c lies Gerät _ Register _
el: i2c πάρε από συσκευή _ καταχωρητή _
es: lee del dispositivo i2c _ el registro _
ja: i2c デバイス取得 _ アドレス _
pt_br: leia do dispositivo i2c _ o registrador _
ru: i2c получить устройство _ зарегистрировать_
tr: i2c oku modül _ yazmaç _
uz: i2c qurilmani _ ro'yxatiga olish

source: separator _
ca: amb separador _
cs: oddělovač _
el: διαχωριστικό _
es: usando separador _
ja: 分割子 _
pt_br: usando separador _
ru: разделитель _
tr: ayırıcı _
uz: ajratuvchi _

source: join _ _
ca: uneix _ _
cs: spoj _ _
de: verbinde _ _
el: ένωσε _ _
es: une _ _
ja: 連結 _ _
pt_br: una _ _
ru: соединить _ _
tr: birleştir _ _
uz: bog'lamoq

source: hex _
ca: hexadecimal _
el: δεκαεξαδικό _
es: hexadecimal _
gl: hexadecimal _
ja: 16進数 _
pt_br: hexadecimal _

source: spi receive
ar: spi إستلم
ca: llegeix SPI
cs: přijmi z SPI
de: spi empfange
el: spi λάβε
es: spi lee
gl: spi ler
ja: spi 受信
pt_br: spi a receber
ru: получение spi
tr: spi oku
uz: spi olish

source: set acceleration range _ g = 100
ca: fixa l'escala d'acceleració en _ g = 100
cs: nastav rozsah akcelerace _ g = 100
de: setze Beschleunigungsbereich auf _ g = 100
es: fija el rango de aceleración en _ g = 100
ru: задать интервал ускорения _ g = 100
tr: ivme aralığını _ yap g = 100

source: tilt x
ar: الميل س
ca: inclinació x
cs: náklon x
de: Neigung x
el: κλίση x
es: inclinación x
gl: inclinación x
ja: 仰角 x
pt_br: inclinação x
ru: наклон x
tr: eğilim x
uz: burilish x

source: radio set channel (0-83) _
ar: راديو ضبط قناة (0-83) _
ca: fixa el canal de ràdio a (0-83) _
cs: nastav kanál rádia (0-83) _
de: Radio setze Kanal _ (0-83)
el: ράδιο όρισε κανάλι σε (0-83) _
es: fija el canal de radio a (0-83) _
gl: pon a canle de rádio a (0-83) _
pt_br: fixe canal de rádio a (0-83) _
ru: задать канал радио (0-83) _
tr: radyo kanal ayarla (0-83) _
uz: radio kanali kanal (0-83) _

source: join items of list _
ca: uneix elements de la llista _
cs: spoj prvky seznamu _
de: verbinde Elemente von Liste _
el: ένωσε τα στοιχεία της λίστας _
es: une elementos de la lista _
ja: リストのアイテムを連結 _
pt_br: una elementos da lista _
ru: соединить элементы из списка _
tr: _ listesinin öğelerini birleştir
uz: _ ro'yxat elementlariga qo'shilish

source: draw shape _ at x _ y _
ar: رسم شكل _ في س _ ص _
ca: dibuixa forma _ a x _ y _
cs: nakresli tvar _ na x _ y _
de: zeichne Form _ bei x _ y _
el: σχεδίασε σχήμα _ στο x _ y _
es: dibuja forma _ en x _ y _
gl: debuxar a forma _ en x _ y _
ja: 形を描く _ 位置 x _ y _
pt_br: desenhe forma _ em x _ y _
ru: нарисовать фигуру _ по координатам x _ y _
tr: _ şeklini çiz x _ y _
uz: _shaklini _ x _ y _ ga chizish

source: cat;My Blocks
ca: Els meus blocs
cs: Moje bloky
de: Meine Blöcke
el: Τα Mπλοκ μου
es: Mis bloques
gl: Os meus bloques
ja: 私のブロック
pt_br: Meus blocos
ru: Мои Блоки
tr: Benim Bloklarım
uz: Mening Bloklarim

source: serial write _
ca: escriu _ al port sèrie
cs: do seriového portu zapiš _
de: serial schreibe _
es: escribe _ al puerto serie
tr: seri yaz _

source: brighten all NeoPixels by _
ca: il·luminar tots els NeoPíxels en _
cs: zjasni všechny NeoPixely _ o _
de: helle alle NeoPixel um _ auf
es: aclarar todos los NeoPixels en _
ru: увеличить яркость всем NeoPixels на _
tr: tüm NeoPixelleri _ aydınlat

source: random
ca: qualsevol
cs: náhodný
de: zufälliges
es: cualquiera
ru: случайный
tr: rasgele

source: serial read
ca: llegeix port sèrie
cs: přeči ze seriového portu
de: serial lies
es: lee puerto serie
tr: seri oku

source: disable radio
ar: تعطيل الراديو
ca: inhabilita ràdio
cs: deaktivuj radio
de: deaktiviere Radio
el: Απενεργοποίηση ραδίου
es: inhabilita radio
gl: desactivar a radio
ja: 送信を無効化
pt_br: desabilite rádio
ru: отключить радио
tr: radyoyu etkisizleştir
uz: radioni o'chirib qo'yish

source: Basic Sensors
ca: Sensors bàsics
cs: Jednoduché Senzory
de: Einfache Sensoren
el: Βασικοί Αισθητήρες
es: Sensores básicos
gl: Sensores básicos
ja: 基本のセンサー
pt_br: Sensores básicos
ru: Базовые Сенсоры
tr: Temel Sensörler
uz: Asosiy sensorlar

source: spi exchange bytes _
ca: intercanvi a bytes _ per SPI
cs: SPI přenes bajty _
de: spi tausche Bytes _
es: bytes de intercambio de spi _
tr: spi baytları takasla _

source: with all _
ca: plena amb _
cs: se všemi _
de: mit allen _
es: llena de _
ru: со всеми _
tr: hepsini _ yap

source: radio set group _ (0-255)
ca: fixa el grup de ràdio a _ (0-255)
cs: nastav skupinu rádia na _ (0-255)
de: Radio setze Gruppe _ (0-255)
es: fija el grupo de radio a (0-255) _
ru: задать группу радио _ (0-255)
tr: radyo grubu _ yap (0-255)

source: new list length _
ar: قائمة جديدة طول _
ca: nova llista de llargada _
cs: nová délka seznamu _
de: neue Liste Länge _
el: μήκος νέου καταλόγου _
es: nueva lista de tamaño _
gl: nova lonxitude da lista _
ja: 新しいリストの長さ _
pt_br: nova lista de tamanho _
ru: новая длина списка _
tr: _ öğeli yeni liste yarat
uz: yangi ro'yxatning uzunligi _

source: set NeoPixel _ color _
ca: posa NeoPíxel _ de color _
cs: nastav NeoPixel _ barva _
de: setze NeoPixel _ Farbe _
el: όρισε NeoPixel _ χρώμα _
es: pon NeoPíxel _ de color _
gl: poñer NeoPixel _ de cor _
ja: ネオピクセルを設定 _ 色 _
pt_br: defina NeoPixel _ de cor _
ru: задать NeoPixel _ цвет _
tr: NeoPixel _ renk _ yap
uz: NeoPixel _ rangga _ belgilash

source: smiles
ca: foca
cs: smajlíky
es: foca
ru: улыбки
tr: gülümseme

source: item _ of _
ar: غرض _ من _
ca: element _ de _
cs: prvek _ z _
de: Element _ von _
el: στοιχείο _ του _
es: elemento _ de _
gl: elemento _ de _
ja: アイテム _ _ の
pt_br: elemento _ de _
ru: элемент _ из _
tr: öğe#: _ liste/dizgi: _
uz: element _ ning _

source: WiFi status
ar: حالة واي فاي
ca: estat de la WiFi
cs: WiFi stav
el: WIFI κατάσταση
es: estado de la WiFi
gl: estado da WiFi
ja: WiFiの状態
pt_br: estado do WiFi
ru: статус WiFi
tr: WIFI durumu
uz: Wi-Fi holati

source: radio last message type
ar: راديو نوع الرسالة الماضية
ca: tipus de l'últim missatge rebut per ràdio
cs: typ poslední radiové zprávy
de: Radio Typ der letzten Nachricht
el: ράδιο τύπος τελευταίου μηνύματος
es: tipo del último mensaje recibido por radio
gl: tipo da última mensaxe recibido por radio
pt_br: tipo da última mensagem recebida por rádio
ru: последний тип радио-сообщения
tr: radyo son mesaj tipi
uz: radio so'nggi xabar turi

source: NeoPixel
ca: NeoPíxels
es: NeoPíxeles
ja: ネオピクセル
tr: Neopiksel

source: brighten NeoPixel _ by _
ca: il·luminar NeoPíxel _ en _
cs: zjasni NeoPixel _ o _
de: helle NeoPixel _ um _ auf
es: aclarar NeoPixel _ en _
ru: увеличить яркость NeoPixel _ на _
tr: _ NeoPixeli _ aydınlat

source: Add a command block
ca: Crea un bloc comanda
cs: Přidej blok povelů
de: Füge Befehlsblock hinzu
el: Πρόσθεσε μπλοκ εντολής
es: Crea un bloque comando
gl: Engadir un bloque de ordes
ja: コマンドブロックを追加
pt_br: Criar um bloco de comandos
ru: Добавить блок команд
tr: kumanda bloğu ekle
uz: Buyruq blokini qo'shing

source: aByteListOrString
ca: llistaDeBytesOCadenaDeText
cs: bajt/seznam/řetězec
de: ByteListeOderZeichenfolge
es: listaDeBytesOCadenaDeTexto
ru: массивБайтИлиСтрока
tr: birBaytListeVeyaDizgi

source: delete item _ of list _
ca: elimina l'element _ de la llista _
cs: smaž prvek _ ze seznamu _
de: entferne Element _ aus Liste _
el: διάγραψε το στοιχείο _ της λίστας _
es: elimina elemento _ de lista _
ja: 削除 アイテム _ リスト _
pt_br: apague elemento _ da lista _
ru: удалить элемент _ из списка _
tr: listeden sil öğe#: _ liste: _
uz: _ ro'yxatidan _ elementini o'chirish

source: has WiFi support
ar: لديه دعم واي فاي
ca: té suport per a WiFi
cs: podporuje WiFi
de: unterstützt WiFi
el: διαθέτει υποστήριξη WIFI
es: tiene soporte para WiFi
gl: admite WiFi
ja: WiFiをサポート
pt_br: tem suporte para WiFi
ru: поддерживает WiFi
tr: WIFI desteği var
uz: Wi-Fi bor

source: cutebotlight;both
ca: ambdós
es: ambos

source: HTTP Server
ca: Servidor HTTP
el: HTTP εξυπηρετητής
es: Servidor HTTP
pt_br: Servidor HTTP
ru: HTTP Сервер

source: Display a bubble showing the value.
ca: Mostra una bafarada amb el valor.
cs: Zobrazení bubliny s hodnotou.
de: Zeigt in einer Sprechblase den Wert an.
es: Muestra una burbuja con el valor.
tr: Değeri gösteren bir balon görüntüleyin.

source: Connect
ar: وصل
ca: Connecta
cs: Připojit
de: Verbinden
el: Συνδέσου
es: Conecta
gl: Conectar
ja: 接続
pt_br: Conectar
ru: Подключить
tr: Bağlan
uz: Ulanish

source: Firmware Install
ca: Instal·lació del firmware
cs: Instalace firmware
de: Firmwareinstallation
es: Instalación del firmware
tr: Firmware Kurulumu

source: Report (-o) if the two values are equal.
ca: Reporta (-o) si els dos valors són iguals.
cs: Vrátí (-o) když jsou obě hodnoty stejné.
de: Gibt (-o) zurück, falls beide Werte identisch sind.
es: Reporta (-o) si los dos valores son iguales.
tr: İki değer eşitse (-o) rapor edin.

source: Octo stop
ca: atura Octo
es: detén Octo

source: Yes
ar: نعم
ca: Sí
cs: Ano
de: Ja
el: Ναι
es: Sí
gl: Si
ja: はい
pt_br: Sim
ru: Да
tr: Evet
uz: Ha

source: disconnect
ar: قطع الاتصال
ca: desconnecta
cs: odpojit
de: trennen
el: Αποσυνδέσου
es: desconecta
gl: desconectar
ja: 切断
pt_br: desconecta
ru: отключить
tr: ayrıl
uz: ajratish

source: connect (BLE)
ca: connecta (BLE)
cs: připojit (BLE)
de: verbinden (BLE)
es: conecta (BLE)

source: Quit MicroBlocks?
ar: الخروج من MicroBlocks؟
ca: Sortir de MicroBlocks?
cs: Ukončit MicroBlocks?
de: MicroBlocks beenden?
el: Να σταματήσω το MicroBlocks;
es: ¿Salir de MicroBlocks?
gl: Saír de MicroBlocks?
ja: MicroBlocksを止めますか?
pt_br: Sair do MicroBlocks?
ru: Выйти из MicroBlocks?
tr: MicroBlocks'dan çıkmak istermisiniz?
uz: MicroBlocks dan chiqasizmi?

source: extract block
ca: extrau bloc
cs: extrahovat blok
de: extrahiere Block
es: extrae bloque
gl: extraer bloque
ja: ブロックを展開
pt_br: extrai bloco
ru: извлечь блок
tr: bloğu ayırt
uz: blokni tortib olish

source: Discard current project?
ar: تجاهل المشروع الحالي؟
ca: Vols descartar el projecte actual?
cs: Zahodit aktuální projekt?
de: Aktuelles Projekt verwerfen?
el: Να μην αποθηκεύσω το τρέχων έργο;
es: ¿Quieres descartar el proyecto actual?
gl: Quere desbotar o proxecto actual?
ja: 現在のプロジェクトを破棄しますか?
pt_br: Descartar o projeto atual?
ru: Отменить этот проект?
tr: Projenizi iptal etmek istermisiniz?
uz: Joriy loyiha bekor qilinsinmi?

source: giraffe
ca: girafa
cs: žirafa
es: jirafa

source: New
ar: جديد
ca: Nou
cs: Nový
de: neu
el: Νέο
es: Nuevo
gl: Novo
ja: 新規
pt_br: Novo
ru: Новый
tr: Yeni
uz: Yangi

source: Left
ca: Esquerra
cs: Doprava
de: Links
el: Αριστερά
es: Izquierda
ja: 左折
pt_br: Esquerda
ru: Влево
tr: Sol

source: snake
ca: serp
cs: had
de: Schlange
es: serpiente

source: TdR button 1
ca: TdR botó 1
es: TdR botón 1

source: Open Cuica
ca: Cuica oberta
es: Cuica abierta

source: synth SFX
ca: efectes sintetitzats
es: efectos sintetizados

source: wait until beat _
ca: espera fins al temps _
de: warte bis Schlag _
es: espera hasta el tiempo _

source: gcd _ _
ca: mcd de _ i _
cs: NSD _ _
de: ggT _ _
es: mcd de _ y _
ru: НОД _ _

source: simplify fraction _
ca: simplifica fracció _
cs: zjednoduš zlomek _
de: gekürzter Bruch _
es: simplifica fracción _
ru: упростить дробь _

source: ethnic
ca: ètnic
es: étnico

source: Tambourine
ca: Pandereta
es: Pandereta

source: Short Guiro
ca: Güiro curt
es: Güiro corto

source: Mute Cuica
ca: Cuica sorda
es: Cuica sorda

source: current bar
ca: compàs actual
cs: aktuální takt
de: aktueller Takt
es: compás actual

source: Farm set light _
ca: Farm _ el llum
es: Farm _ la luz

source: Graph
ca: Gràfica
cs: Graf
es: Gráfico
tr: Grafik

source: display character _
ca: mostra caràcter _
cs: zobraz znak _
de: zeige Buchstaben _
el: εμφάνισε χαρακτήρα _
es: muestra carácter _
gl: amosar carácter _
ja: 文字を表示 _
pt_br: mostre caractere _
ru: отображать символ _
tr: _ harfini göster
uz: belgini ko'rsatish _

source: _ pseudorandom numbers _ to _ with seed _
ca: _ nombres pseudo-aleatoris entre _ i _ amb llavor _
cs: _ pseudonáhodná čísla od _ do _ s klíčem
es: _ números pseudoaleatorios entre _ y _ con semilla _

source: wifi last string
ca: wifi últim text
cs: poslední řetězec WiFi
de: wifi letzte Zeichenfolge
es: último texto recibido por wifi

source: thing description JSON
ca: JSON de la cosa
cs: WebThing JSON popis
de: Thing Beschreibung JSON
el: περιγραφή αντικειμένου JSON
es: JSON de la cosa
ja: Thing の説明 JSON
pt_br: descrição JSON da coisa
ru: описание вещи JSON
tr: nesnenin tanımı JSON
uz: narsa tavsifi JSON

source: ms scale brightness to _ %
ca: ms escala la brillantor al _ %
es: ms escala el brillo al _ %

source: map _ over _
ca: aplica _ sobre _
cs: mapuj _ pomocí _
es: aplica _ sobre _

source: set string property _ title _ @Type _
ca: posa a la propietat textual _ el títol _ i @Type _
cs: nastav textovou hodnotu _ jméno _ @Typ _
de: setze Zeichenfolge Eigenschaft _ Name _ @Typ _
el: όρισε κειμένου ιδιότητα _ τίτλος _ @Τύπος _
es: pon a la propiedad textual _ el título _ y @Type _
ja: 文字列属性を設定 _ タイトル _ @タイプ _
pt_br: fixe a propriedade texto _ com o título _ e @Type _
ru: установить строковое свойство _ title _ @Type _
tr: dizgi özellik _ ad _ @Tip _
uz: satr xususiyatini belgilash _ sarlavha _ @Turi _

source: bme280 connected
ca: bme280 connectat
cs: bme280 připojen
de: BME280 verbunden
el: bme280 ενώθηκε
es: bme280 conectado
ja: bme280 接続された
pt_br: bme280 conectado
ru: bme280 подключен
tr: bme280 bağlandı
uz: bme280 ulangan

source: All
ca: Tots
cs: Vše
de: Alle
el: Όλα
es: Todos
ja: 全部
pt_br: Todos
ru: Все
tr: Tüm

source: Imagina distance (cm)
ca: Imagina distància (cm)
es: Imagina distancia (cm)

source: has white _
ca: amb blanc _
cs: s bílou _
de: mit Weiß _
el: έχει άσπρο _
es: con blanco _
ja: 白色 _
pt_br: com branco _
ru: имеет белый _
tr: beyaz var _
uz: oq _

source: TdR test buzzer
ca: TdR prova el brunzidor
es: TdR prueba el zumbador

source: fract _ - _
ca: frac _ - _
cs: zlomek _ - _
de: Bruch _ - _
es: frac _ - _
ru: дробь _ - _

source: receive IR code from device _
ar: تلقي رمز الأشعة تحت الحمراء من الجهاز _
ca: rep codi IR del dispositiu _
cs: přijmi IR kód ze zařízení _
de: empfange IR-Code vom Gerät _
el: λήψη κωδικού IR από τη συσκευή _
es: recibe código IR del dispositivo _
gl: recibir código IR dende o dispositivo _
ja: IR コード受信 デバイス _
pt_br: receba código IR do dispositivo _
ru: получение ИК-кода с устройства _
tr: _ aygıtından IR kod oku
uz: qurilmadan IR kodni olish _

source: num2str _
ca: nombre _ a text
cs: číslo->text _
es: número _ a texto

source: power (mW)
ca: potència (mW)
es: potencia (mW)
