Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: Reports the three-letter BLE ID of the board if it supports BLE.
ca: Reporta l'identificador BLE de tres caràcters de la placa, si suporta BLE.
cs: Vrátí 3-znakové BLE-ID pokud deska mikropočítače podporuje BLE.
es: Reporta el identificador BLE de tres caracteres de la placa, si soporta BLE.

source: Set the SPI clock speed, mode, channel (Raspberry Pi only), and bit order.
ca: Ajusta la velocitat del rellotge, mode, canal (només per a Raspberry Pi) i ordre de bits del bus SPI.
cs: Nastaví rychlost hodin SPI, kanál (pouce RPI) a pořadí bitů.
es: Ajusta la velocidad del reloj, modo, canal (solo para Raspberry Pi) y orden de bits del bus SPI.

source: Send a byte array to the serial port, starting at the given byte.
ca: Envia una llista de bytes pel port sèrie, començant pel byte especificat.
cs: Odeslání pole bajtů po sériovém portu počínaje daným bajtem.
es: Envía una lista de bytes por el puerto serie, empezando por el byte especificado.

source: Run when the given message is received as a broadcast.
ca: Executa quan es rebi el missatge especificat.
cs: Spuštění úkolu když je přijata zadaná zpráva.
es: Ejecuta cuando se reciba el mensaje especificado.

source: Report the given argument or defaultValue if the argument was not supplied by the caller.
ca: Dins una funció, reporta l'argument indicat per l'índex, o un valor per defecte si aquest argument no s'ha proporcionat.
cs: Vrátí zadaný argument nebo default hodnotu pokud argument nebyl při volání dodán.
es: En una función, reporta el argumento indicado por el índice, o un valor por defecto si este argumento no se ha proporcionado.

source: Convert a value to the given data type.
ca: Converteix un valor al tipus de dades especificat.
cs: Zkonvertuje hodnotu do zadaného datového typu.
es: Convierte un valor al tipo de datos especificado.

source: If the condition is (-o) report the first alternative otherwise report the second alternative.
ca: Si la condició és (-o) reporta la primera alternativa, si no, reporta la segona alternativa.
cs: Když je podmínka (-o) vrací první variantu jinak vrací druhou variantu.
es: Si la condición es (-o) reporta la primera alternativa, si no, reporta la segunda alternativa.

source: Missing language?
ca: Falta un idioma?
cs: Chybí jazyk?
es: ¿Falta un idioma?

source: Reports (-o) if a BLE client is connected.
ca: Reporta (-o) si hi ha un client BLE connectat.
cs: Vrátí (-o) pokud je připojen BLE klient.
es: Reporta (-o) si hay un cliente BLE conectado.

source: Reports (-o) if the board is connected to IDE.
ca: Reporta (-o) si la placa està connectada a la IDE.
cs: Vrátí (-o) pokud je mikropočítač připojen k IDE.
es: Reporta (-o) si la placa está conectada a la IDE.

source: Map a value in the "from" range to the corresponding value in the "to" range.
ca: Transforma un nombre des del seu rang original fins al seu valor corresponent en un altre rang.
cs: Mapuje hodnotu ze vstupního rozsahu do výstupního rozsahu.
es: Transforma un número desde su rango original hasta su valor correspondiente en otro rango.

source: Report a list containing the given range of numbers (with optional increment). Useful in "for" loops.
ca: Reporta una llista que conté el rang de nombres definit (amb increment opcional). Útil en bucles "per".
cs: Vrátí seznam obsahující zadaný rozsah čísel. Užitečné pro počítané cykly ("for").
es: Reporta una lista que contiene el rango de números definido (con incremento opcional). Útil en bucles "por".

source: CBPro set _ servo _ angle to _ deg
ca: posa el servo de _ número _ a _ graus
es: fija servo de _ número _ a _ grados

source: WuKong2040 clear all rainbowLED
ca: apaga LEDs multicolor
es: apaga LEDs multicolor

source: CBPro IR code received?
ca: codi IR rebut?
es: ¿código IR recibido?

source: The firmware on the board is not compatible with this version of MicroBlocks.
ca: El firmware d'aquesta placa no és compatible amb aquesta versió de MicroBlocks.
cs: Firmware v mikropočítači není kompatibilní s touto verzí MicroBlocks.
es: El firmware de esta placa no es compatible con esta versión de MicroBlocks.

source: autoload board libraries
ca: auto-carrega llibreries de placa
cs: automatické načítání knihoven z mikropočítače
es: auto-carga librarías de placa

source: WuKong2040 stop all motors
ca: atura tots els motors
es: detén todos los motores

source: CBPro stop external motor
ca: atura motor extern
es: detén motor externo

source: CBPro version
ca: versió del CBPro
es: versión del CBPro

source: WuKong2040 rainbowLED _ R _ G _ B _ (0~255)
ca: posa LED multicolor _ a vermell _ verd _ blau _ (0~255)
es: pon LED multicolor _ a rojo _ verde _ azul _ (0~255)

source: PlugShare when project empty
ca: auto-PlugShare en projectes buits
cs: PlugShare, když je projekt prázdný
es: auto-PlugShare en proyectos vacíos

source: CBPro tracking state
ca: estat del seguiment de línia
es: estado del seguimiento de línea

source: CBPro set external motor power to _ (-100 to 100)
ca: fixa la potència del motor extern a _ (-100 a 100)
es: fija la potencia del motor externo a _ (-100 a 100)

source: CBPro servo _ speed to _ (-100 to 100)
ca: posa el servo _ a velocitat _ (-100 a 100)
es: pon servo _ a velocidad _ (-100 a 100)

source: CBPro tracking state is (L - - R) _ _ _ _
ca: l'estat del seguiment de línia és (E--D) _ _ _ _
es: el estado del seguimiento de línea es (I--D) _ _ _ _

source: CBPro tracking offset
ca: desfasament del seguiment de línia
es: desfase del seguimiento de línea

source: CBPro IR code
ca: codi IR
es: código IR

source: WuKong2040 motor _ speed to _ (-100~100)
ca: posa el motor _ a velocitat _ (-100~100)
es: pon el motor _ a velocidad _ (-100~100)

source: WuKong2040 stop motor _
ca: atura motor _
es: detén el motor _

source: WuKong2040 buzzer beep _ ms
ca: toca el brunzidor durant _ ms
es: pita durante _ ms

source: WuKong2040 rainbowLED _ color to _
ca: posa LED multicolor _ a _
es: pon LED multicolor _ a _

source: make the IDE darker
ca: enfosqueix la IDE
cs: nastaví IDE do tmavého režimu
es: oscurece la IDE
tr: ortamı karart

source: BLE id
ca: identificador BLE
es: identificador BLE

source: BLE connected
ca: connectat via BLE
cs: BLE připojeno
es: conectado por BLE

source: seconds
ca: segons
cs: vteřiny
es: segundos

source: version
ca: versió
cs: verze
es: versión

source: install ESP firmware from microblocks.fun
ca: instal·la firmware ESP des de microblocks.fun
es: instalar firmware ESP desde microblocks.fun

source: folder;Web of Things
ca: Web of Things
es: Web of Things

source: folder;CPX
ca: CPX
es: CPX

source: folder;microbit and Calliope
ca: microbit i Calliope
es: microbit y Calliope

source: folder; by board
ca: per placa
es: por placa

source: folder;Art
ca: Art
es: Arte

source: folder;Games
ca: Jocs
es: Juegos

source: folder;Music
ca: Música
es: Música

source: folder;Citilab ED1 and M5Stack
ca: Citilab ED1 i M5Stack
es: Citilab ED1 y M5Stack

source: ms;stop
ca: atura
es: detén

source: ble message received?
es: ¿mensaje BLE recibido?

source: ble last string
es: último texto recibido por BLE

source: ble set group _ (0-255)
es: fija el grupo de BLE a _ (0-255)

source: address type
es: tipo de dirección

source: device name
es: nombre del dispositivo

source: hasType _
es: tiene tipo _

source: exit loop
es: sal del bucle

source: allow WiFi while using BLE _
es: permite el uso de la WiFi mientras BLE esté activo _

source: ble send number _
es: envía número _ por BLE

source: ble send string _
es: envía texto _ por BLE

source: ble send pair _ = _
es: envía par _ = _ por BLE

source: ble last number
es: último número recibido por BLE

source: scan received
es: escaneo recibido

source: address
es: dirección

source: folder;Examples
es: Ejemplos

source: NeoPanel
ca: NeoPanell
cs: NepoPixel panel

source: Radio
ca: Ràdio
ja: 電波
pt_br: Rádio
ru: Радио
tr: Radyo

source: d#
ca: re#

source: Cabasa
ca: Cabassa

source: Maracas
ca: Maraques

source: ensemble
ca: cors

source: s꞉b LEDs off
ca: s꞉b apaga els LED

source: s꞉b LEDs to _
ca: s꞉b LEDs a _

source: s꞉b LED _ (1-4) to _
ca: s꞉b LED _ (1-4) a _

source: s꞉b audio output to shield _
ca: s꞉b sortida d'audio per la shield:bit _

source: s꞉b stop _
ca: s꞉b atura _

source: s꞉b turn 180 servo S- _ (1-8) to angle _
ca: s꞉b gira el servo 180 S- _ (1-8) a l'angle _

source: s꞉b turn 360 servo S- _ (1-8) _ at _ %
ca: s꞉b gira el servo 360 S- _ (1-8) _ a _ %

source: s꞉b turn DC M- _ (1-4) motor _ at _ %
ca: s꞉b gira el motor CC M- _ (1-4) _ a _ %

source: s꞉b turn Stepper- _ (1-2) motor _ for _ _
ca: s꞉b gira el motor PaP- _ (1-2) _ per _ _

source: s꞉b set pin S- _ (1-8) to _ %
ca: s꞉b posa el pin S- _ (1-8) a _ %

source: ms light %
ca: ms llum %

source: ms sound %
ca: ms so %

source: define
ca: defineix
cs: definovat
de: definiere
el: όρισε
gl: definir
ja: 定義
ru: определить
tr: tanımla
uz: belgilang

source: no
cs: ne
de: nein

source: normal (65%)
cs: standard (65%)

source: No
ar: لا
cs: Ne
de: Nein
el: Όχι
gl: Non
ja: いいえ
pt_br: Não
ru: Нет
tr: Hayır
uz: Yo'q

source: no op
ar: لا عملية
de: kein Befehl
el: καμμία εντολή
ja: 何もしない
pt_br: não op
ru: нет ОП
tr: işlem yok
uz: op yo'q

source: libfolder;Libraries
ar: المكتبات
de: Module
el: Βιβλιοθήκες
gl: Bibliotecas
ja: ライブラリ
pt_br: Bibliotecas
tr: Kütüphaneler
uz: Kutubxonalar

source: libfolder;AI
de: KI
tr: Yapay Zeka

source: libfolder;Graphics and Displays
de: Displays und Anzeigen
tr: Grafikler ve Görüntüleme

source: libfolder;Kits and Boards
de: Kits und Boards
tr: Kitler ve Boardlar

source: libfolder;Network
de: Netzwerk
tr: Ağ

source: libfolder;Other
de: Sonstige
el: Άλλα
gl: Outros
ja: その他
pt_br: Outro
tr: Diğer
uz: Boshqalar

source: libfolder;Robots
de: Roboter
tr: Robotlar

source: libfolder;Sensing
de: Sensoren
tr: Algılama

source: libfolder;Sound
de: Klang
el: Ήχος
gl: Son
ja: 音量
pt_br: Som
tr: Ses
uz: Ovoz

source: libfolder;System
de: System
tr: Sistem

source: Web Thing
el: Αντικείμενο Δικτύου
tr: Web Nesneleri

source: libfolder;Motors
tr: Motorlar

source: libfolder;WorkInProgress
tr: Çalışma devam ediyor

source: pre
ru: пре
