Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: Report the board type.
ca: Reporta el tipus de placa.
cs: Vrátí typ mikropočítače/desky.
de: Gibt den Typ des Boards zurück.
es: Reporta el tipo de placa.
tr: Kart tipini bildirin.

source: Report number of digital pins on this device.
ca: Reporta el número de pins digitals en aquest dispositiu.
cs: Vrátí počet digitálních pinů mikropočítače/desky.
de: Gibt die Anzahl digitaler Pins auf dem Gerät zurück.
es: Reporta el número de pines digitales en este dispositivo.
tr: Bu cihazdaki dijital pin sayısını bildirin.

source: Report the value of a register (0-255) of an I2C device (0-127).
ca: Reporta el valor d'un registre (0-255) d'un dispositiu I2C (0-127).
cs: Vrátí hodnotu registru (0-255) z I2C zařízení (adresa 0-127).
de: Gibt den Wert eines Registers (0-255) auf einem I2C-Gerät (0-127) zurück.
es: Reporta el valor de un registro (0-255) de un dispositivo I2C (0-127).
tr: I2C cihazının (0-127) sayacının (0-255) değerini bildirin.

source: Send a byte (0-255) to an SPI device.
ca: Envia un byte (0-255) a un dispositiu SPI.
cs: Odeslání bajtu (0-255) do SPI zařízení.
de: Sendet ein Byte (0-255) an ein SPI-Gerät.
es: Envía un byte (0-255) a un dispositivo SPI.
tr: SPI cihazına bir bayt (0-255) gönderin.

source: Report data received from the serial port (a byte array).
ca: Reporta les dades rebudes pel port sèrie (una llista de bytes).
cs: Vrátí data přijatá ze sériového portu (pole bajtů).
de: Gibt die empfangenen Daten vom seriellen Anschluss (als Byte-Array) an.
es: Reporta los datos recibidos por el puerto serie (una lista de bytes).
tr: Seri bağlantı noktasından (bir bayt dizisi) alınan verileri bildirin.

source: Receive multiple bytes from an I2C device.
ca: Rep múltiples bytes d'un dispositiu I2C.
cs: Příjem více bajtů z I2C zařízení.
de: Empfängt mehrere Byte von einem I2C-Gerät.
es: Recibe múltiples bytes de un dispositivo I2C.
tr: I2C cihazından birden çok bayt alın.

source: Send a byte array to the serial port.
ca: Envia una llista de bytes pel port sèrie.
cs: Odeslání pole bajtů po sériovém portu.
de: Sendet ein Byte-Array zum seriellen Anschluss.
es: Envía una lista de bytes por el puerto serie.
tr: Seri bağlantı noktasına bir bayt dizisi gönderin.

source: Run when the board powers up or when the IDE start button is clicked.
ca: Executa quan la placa s'engegui o en clicar al botó d'inici de l'editor.
cs: Úkol spuštěný po zapnutí napájení desky mikropočítače nebo při kliknutí na tlačítko start v pravém horním rohu.
de: Wird ausgeführt, falls das Board an die Stromversorgung angeschlossen oder der IDE-Start-Knopf gedrückt wird.
es: Ejecuta cuando la placa se encienda o al hacer click sobre el botón de inicio.
tr: Kart açıldığında veya IDE başlat düğmesine tıklandığında çalıştırın.

source: Run when buttons A, B, or A+B are pressed.
ca: Executa quan es premin els botons A, B, o tots dos alhora.
cs: Úkol spuštěný při stisku tlačítka A, B nebo A+B.
de: Wird ausgeführt, falls der Knopf A, B oder A+B gedrückt wurde.
es: Ejecuta cuando se pulsen los botones A, B, o ambos a la vez.
tr: A, B veya A+B düğmelerine basıldığında çalıştırın.

source: Wait until the condition becomes (-o) .
ca: Espera fins que la condició sigui (-o) .
cs: Čekání na splnění podmínky (-o) .
de: Wartet bis die Bedingung (-o) wird.
es: Espera hasta que la condición sea (-o) .
tr: Koşul (-o) olana kadar bekleyin.

source: Do nothing. Used to add notes and documentation.
ca: No fa res. S'utilitza per afegir notes i documentació.
cs: Prázdný příkaz. Nedělá nic, používá se pro poznámky a dokumentaci.
de: Macht nichts. Wird zum Kommentieren und Dokumentieren genutzt.
es: No hagas nada. Se usa para añadir notas y documentación.
tr: Hiçbir şey yapma. Notlar ve belgeler eklemek için kullanılır.

source: Repeat the enclosed blocks until the condition becomes (-o) .
ca: Repeteix l'execució dels blocs que conté, fins que la condició esdevingui (-o) .
cs: Opakování vnořených bloků tolikrát dokud není splněna podmínka.
de: Wiederholt die umschlossenen Blöcke bis die Bedingung (-o) wird.
es: Repite la ejecución de los bloques que contiene, hasta que la condición sea (-o) .
tr: Koşul (-o) olana kadar İçerilen blokları tekrarlayın.

source: Wait the given number of microseconds.
ca: Espera el nombre de microsegons especificat.
cs: Čekání po zadaný čas (v mikrosekundách).
de: Wartet die in Mikrosekunden angegebene Zeit.
es: Espera el numero de microsegundos especificado.
tr: Verilen mikrosaniye kadar bekleyin.

source: Report the last broadcast message received.
ca: Reporta l'últim missatge emès i rebut.
cs: Vrátí poslední přijato zprávu systému.
de: Gibt die zuletzt empfangene Nachricht zurück.
es: Reporta el último mensaje emitido y recibido.
tr: Alınan son yayın mesajını bildirin.

source: Call the function with the given name and optional parameter list and report its return value.
ca: Crida la funció amb el nom especificat amb la llista de paràmetres opcional proporcionada, i reporta'n el valor de retorn.
cs: Zavolá funkci daného jména s případnými parametry a vrátí návratovou hodnotu.
de: Ruft die Funktion mit dem angegebenen Namen sowie den optionalen Parametern auf und gibt einen Wert zurück.
es: Llama la función con el nombre especificado con la lista de parámetros opcional proporcionada, y reporta su valor de retorno.
tr: Belirtilen ad ve isteğe bağlı parametre listesi ile işlevi çağırın ve dönüş değerini bildirin.

source: Stop all tasks except this one.
ca: Atura totes les tasques excepte aquesta.
cs: Zastaví všechny úkoly kromě aktuálního.
de: Beendet alle Skripte außer diesem.
es: Detén todas las tareas excepto esta.
tr: Bunun dışındaki tüm görevleri durdurun.

source: Report the absolute value of the given number (always >= 0).
ca: Reporta el valor absolut del nombre especificat (sempre >= 0).
cs: Vátí absolutní hodnotu čísla (vždy >=0 ).
de: Gibt den absoluten Betrag der Zahl zurück (stets >= 0).
es: Reporta el valor absoluto del número especificado (siempre >= 0).
tr: Verilen sayının mutlak değerini bildirin (daima >= 0).

source: Report the minimum of the values.
ca: Reporta el més petit dels valors especificats.
cs: Vrátí nejmenší hodnotu.
de: Gibt das Minimum der Werte zurück.
es: Reporta el menor de los valores especificados.
tr: Minimum değeri bildirin.

source: Report a randomly chosen number in the given range.
ca: Reporta un nombre a l'atzar dins el rang especificat.
cs: Vrátí náhodné číslo z rozsahu.
de: Gibt eine zufälligen Wert aus dem gegebenen Bereich zurück.
es: Reporta un número al azar dentro del rango especificado.
tr: Verilen aralıkta rastgele seçilen bir sayıyı bildirin.

source: Report (-o) if the first value is less than the second one.
ca: Reporta (-o) si el primer valor és menor que el segon.
cs: Vrátí (-o) když je první hodnota menší než druhá.
de: Gibt (-o) zurück, falls der erste Wert kleiner als der zweite Wert ist.
es: Reporta (-o) si el primer valor es menor que el segundo.
tr: İlk değer ikinciden küçükse (-o) rapor edin.

source: Report (-o) if the first value is less than or equal to the second one.
ca: Reporta (-o) si el primer valor és menor o igual que el segon.
cs: Vrátí (-o) když je první hodnota menší nebo stejná jako druhá.
de: Gibt (-o) zurück, falls der erste Wert kleiner oder gleich dem zweiten Wert ist.
es: Reporta (-o) si el primer valor es menor o igual que el segundo.
tr: İlk değer ikinciden küçük veya ona eşit ise (-o) rapor edin .

source: Report (-o) if the two values are not equal.
ca: Reporta (-o) si els dos valors són diferents.
cs: Vrátí (-o) když jsou hodnoty odlišné.
de: Gibt (-o) zurück, falls beide Werte ungleich sind.
es: Reporta (-o) si los dos valores son distintos.
tr: İki değer eşit değilse (-o) rapor edin .

source: Report (-o) if the first value is greater than or equal to the second one.
ca: Reporta (-o) si el primer valor és major o igual que el segon.
cs: Vrátí (-o) když je první hodnota větší nebo stejná jako druhá.
de: Gibt (-o) zurück, falls der erste Wert größer oder gleich dem zweiten Wert ist.
es: Reporta (-o) si el primer valor es mayor o igual que el segundo.
tr: İlk değer ikinciden büyük veya ona eşitse (-o) bildirin.

source: Report (-o) if both values are (-o)
ca: Reporta (-o) si els dos valors són (-o)
cs: Vrátí (-o) pokud jsou obě hodnoty (-o)
de: Gibt (-o) zurück, falls beide Werte (-o) sind.
es: Reporta (-o) si ambos valores son (-o)
tr: Her iki değer de (-o) ise (-o) raporla

source: Report the numerical value of a hexadecimal string (range: -0x1FFFFFFF to 0x1FFFFFFF)
ca: Retorna el valor numèric decimal d'una cadena de text hexadecimal (rang: -0x1FFFFFFF a 0x1FFFFFFF)
cs: Vrátí numerickou hodnotu jako hexadecimální řetězec (rozsah: -0x1FFFFFFF to 0x1FFFFFFF)
de: Gibt den numerischen Wert einer hexadezimalen Zeichenfolge zurück (Bereich: -0x1FFFFFFF bis 0x1FFFFFFF).
es: Reporta el valor numérico decimal de una cadena de texto hexadecimal (rango: -0x1FFFFFFF a 0x1FFFFFFF)
tr: Onaltılık bir dizenin sayısal değerini bildirin (aralık: -0x1FFFFFFF - 0x1FFFFFFFF)

source: Report bitwise AND of two numbers.
ca: Reporta l'operació bit a bit "i" (AND) entre dos nombres.
cs: Vrátí bitové AND dvou čísel.
de: Gibt die bitweise UND-Verknüpfung zweier Zahlen zurück.
es: Reporta la operación bit a bit "y" (AND) entre dos números.
tr: İki sayının bit düzeyinde VE değerini bildirin.

source: Report bitwise XOR (exclusive OR) of two numbers.
ca: Reporta l'operació bit a bit "o exclusiva" (XOR) entre dos nombres.
cs: Vrátí bitové XOR dvou čísel.
de: Gibt die bitweise XOR-Verknüpfung (exklusives ODER) zweier Zahlen zurück.
es: Reporta la operación bit a bit "o exclusiva" (XOR) entre dos números.
tr: İki sayının bit düzeyinde XOR'unu (özel VEYA) bildirin.

source: Report the number of items in a list, string, or byte array.
ca: Reporta el nombre d'elements d'una llista, cadena de text o llista de bytes.
cs: Vrátí počet položek (délku) seznamu, řetězce nebo pole bajtů.
de: Gibt die Anzahl der Elemente der Liste, der Zeichenfolge oder des Byte-Arrays zurück.
es: Reporta el número de elementos de una lista, cadena de texto o lista de bytes.
tr: Liste, dize veya bayt dizisindeki öğelerin sayısını bildirin.

source: Join (concatenate) the given lists, strings, or byte arrays and report the result.
ca: Reporta la unió (concatenació) de les llistes, cadenes de text o llistes de bytes especificades.
cs: Spojí zadané seznamy, řetězce nebo pole bajtů a vrátí výsledek.
de: Verbindet (verkettet) die angegebenen Listen, Zeichenfolgen oder Byte-Array und gibt das Ergebnis zurück.
es: Reporta la unión (concatenación) de las listas, cadenas de texto o listes de bytes especificadas.
tr: Verilen listeleri, dizeleri veya bayt dizilerini birleştirin ve sonucu bildirin.

source: Report (-o) if either value is (-o)
ca: Reporta (-o) si algun dels dos valors és (-o)
cs: Vrátí (-o) pokud je nějaká z hodnot (-o)
de: Gibt (-o) zurück, falls mindestens einer der beiden Werte (-o) ist.
es: Reporta (-o) si alguno de los valores es (-o)
tr: Herhangi bir değer (-o) ise (-o) raporla

source: Find and report the index of an item in a list or a substring within a string. Report -1 if not found.
ca: Cerca i reporta la posició d'un element en una llista, o una cadena de text dins d'una altra. Reporta -1 si no s'hi troba.
cs: Vyhledá a vrátí index položky v seznamu nebo podřetězce v textu. Pokud není položka nalezena vrátí -1.
de: Gib die Stelle des Elements in der Liste oder der Teilzeichenfolge in der Zeichenfolge zurück. Gibt -1 zurück, falls nichts gefunden.
es: Busca y reporta la posición de un elemento en una lista, o una cadena de texto dentro de otra. Reporta -1 si no se encuentra.
tr: Bir listedeki bir öğenin dizinini veya bir dize içindeki bir alt dizeyi bulun ve bildirin. Bulunamazsa -1 rapor edin.

source: Report a copy from the given index through the end (or optional stop index) of the given list, string, or byte array.
ca: Reporta una còpia d'una llista, cadena de text o llista de bytes a partir de la posició d'inici especificada i fins al final (o fins la posició final opcional especificada).
cs: Pro zadaný seznam/text/pole bajtů Vrátí kopii od daného indexu do konce (případně do zadaného koncového indexu.
de: Gibt eine Kopie vom angegebenen Index bis zum Ende (oder optional zum Stopindex) der Liste, der Zeichenfolge oder des Byte-Array zurück.
es: Reporta una copia de una lista, cadena de texto o lista de bytes a partir de la posición de inicio especificada y hasta el final (o hasta la posición final opcional especificada).
tr: Verilen listenin, dizenin veya bayt dizisinin sonuna (veya isteğe bağlı durdurma indeksine) kadar verilen dizinden bir kopya bildirin.

source: Combine the items of a list into a string, optionally separated by a delimiter (e.g. comma).
ca: Combina els elements d'una llista en una cadena de text, opcionalment separats per un delimitador (com ara una coma).
cs: Spojí položky seznamu do řetězce, s použitím volitelného oddělovače položek.
de: verbindet die Elemente der Liste zu einer Zeichenfolge, optional mit Trennzeichen getrennt.
es: Combina los elementos de una lista en una cadena de texto, opcionalmente separados por un delimitador (por ejemplo, una coma).
tr: Bir listenin öğelerini, isteğe bağlı olarak bir sınırlayıcıyla (ör. virgül) ayırarak bir dizede birleştirin.

source: Create and report a short list containing the given items. Length limited by available stack space.
ca: Crea i reporta una llista amb els elements especificats. La llargada de la llista està limitada a l'espai disponible a la pila.
cs: Vytvoří a vrátí seznam obsahující dané položky. Délka je limitována dostupnou velikostí zásobníku.
de: Erstellt eine kurze Liste mit den angegebenen Elementen und gibt diese zurück. Die Größe ist durch den Stack-Speicher begrenzt.
es: Crea y reporta una lista con los elementos especificados. La largada de la lista esta limitada al espacio disponible en la pila.
tr: Verilen öğeleri içeren kısa bir liste oluşturun ve rapor edin. Uzunluk, kullanılabilir yığın alanıyla sınırlıdır.

source: Report a string containing the given Unicode value ("code point") or list of values.
ca: Reporta una cadena de text formada pel valor o llista de valors Unicode especificats.
cs: Vrací řetězec obsahující zadanou hodnotu Unicode nebo seznamu hodnot.
de: Gibt eine Zeichenfolge zurück, die den angegebenen Unicode-Wert oder eine Liste von Werten enthält.
es: Reporta una cadena de texto formada por el valor o lista de valores Unicode especificados.
tr: Verilen Unicode değerini ("kod noktası") veya değerler listesini içeren bir dize bildirin.

source: Report a byte array containing the UTF-8 bytes of the given string.
ca: Reporta una llista de bytes que contingui els bytes UTF-8 de la cadena de text especificada.
cs: Vrací pole bajtů obsahující UTF-8 hodnoty znaků zadaného řetězce.
de: Gibt ein Byte-Array zurück, das die UTF-8-Bytes der angegebenen Zeichenfolge enthält.
es: Reporta una lista de bytes que contenga los bytes UTF-8 de la cadena de texto especificada.
tr: Verilen dizenin UTF-8 baytlarını içeren bir bayt dizisini bildirin.

source: Report the number of words of memory available. Stop button frees up memory.
ca: Reporta el número de paraules (grups de 32 bits, o 4 bytes) de memòria disponibles.
cs: Vrací velikost dostupné paměti (words). Stop uvolňuje paměť.
de: Gibt die Größe des verfügbaren Speichers zurück. Der Stopp-Knopf gibt Speicher frei.
es: Reporta el número de palabras (grupos de 32 bits, o 4 bytes) de memoria disponibles.
tr: Kullanılabilir bellekteki sözcük sayısını bildirin. Durdur düğmesi hafızayı boşaltır.

source: microseconds since _
ca: microsegons des de _
cs: počet mikrosekund od _
es: microsegundos desde _
tr: _ den beri mikrosaniyeler

source: scale _
ca: escala _
cs: měřítko _
es: escala _

source: set TFT backlight _ (0-10)
ca: fixa la llum de fons a _ (0-10)
cs: nastav podsvícení TFT _ (0-10)
es: fija luz de fondo a _ (0-10)

source: hue _
ca: to de _
cs: odstín _
es: tono _

source: i2c device _ exists?
ca: existeix el dispositiu i2c _ ?
cs: existuje I2C zařízení _ ?
es: ¿existe el dispositivo i2c _ ?
tr: i2c aygıt _ varsa?

source: sqrt _
ca: arrel de _
es: raíz de _
tr: kare kök _

source: color hue _ (0-360) saturation _ % brightness _ %
ca: color amb to _ (0-360) saturació _ % i brillantor _ %
cs: barva - odstín _ (0-360) saturace _ % jas _ %
es: color con tono _ (0-360) saturación _ % brillo _ %

source: gm;SFX
ca: efectes especials
es: Efectos especiales

source: blue _
ca: blau de _
cs: modrá _
es: azul de _

source: make image _
ca: construeix imatge _
cs: vytvoř obrázek _
es: construye imagen _
ru: создать изображение _

source: saturation _
ca: saturació de _
cs: saturace _
es: saturación de _

source: green _
ca: verd de _
cs: zelená _
es: verde de _

source: red _
ca: vermell de _
cs: červená _
es: rojo de _

source: _ with saturation _ %
ca: _ amb saturació _ %
cs: _ se saturací _ %
es: _ con saturación _ %

source: brightness _
ca: brillantor de _
cs: jas _
es: brillo de _

source: draw bitmap _ palette _ on TFT at x _ y _
ca: dibuixa bitmap _ amb paleta _ a x _ y _
cs: nakresli na TFT bitmapu _ na x _ y
es: dibuja mapa de bits _ con paleta _ en x _ y _

source: bg color _
ca: color de fons _
cs: barva pozadí _
es: color de fondo _

source: drumkit;SFX
ca: efectes especials
es: Efectos especiales

source: Color Operators
ca: Colors
cs: Operace s barvami
es: Color

source: clear TFT display
ca: esborra pantalla TFT
cs: vymaž TFT displej
es: borra pantalla TFT

source: _ with hue _ (0-360)
ca: _ amb to _ (0-360)
cs: _ odstínu _ (0-360)
es: _ con tono _ (0-360)

source: milliseconds since _
ca: mil·lisegons des de _
cs: počet milisekund od _
es: milisegundos desde _
tr: _ den beri milisaniyeler

source: end time _
ca: fins a _
cs: do _
es: hasta _
tr: bitme zamanı

source: _ with brightness _ %
ca: _ amb brillantor _ %
cs: _ s jasem _ %
es: _ con brillo _ %

source: draw text _ on TFT at x _ y _ color _
ca: escriu _ a x _ y _ amb color _
cs: nakresli na TFT text _ na x _ y _ barva _
es: escribe _ en x _ y _ con color _

source: gray _ %
ca: gris _ %
cs: šedá _ %
es: gris _ %

source: draw vector x _ y _ angle _ length _ color _
ca: dibuixa vector x _ y _ angle _ llargada _ color _
cs: nakresli na TFT vektor z x _ y _ úhel _ délka _ barva _
es: dibuja vector x _ y _ ángulo _ longitud _ color _

source: fract _ / _
ca: frac _ / _
cs: zlomek _ / _
de: Bruch _ / _
es: fracción _/_
ru: дробь _ / _

source: shift NeoPixel _ color by _
ca: canvia el color del NeoPíxel _ en _
cs: posuň NeoPixel_ barva o _ pozic
es: cambia el color del NeoPíxel _ por _
tr: NeoPixel _ rengini _ kaydır

source: 360 degree
ca: 360 graus
es: 360 grados

source: CBPro set NeoPixel _ to _
ca: posa el NeoPixel _ a _
es: fija NeoPíxel _ del CBPro a _

source: cutebotturn;left-in-place
ca: esquerra (sobre el seu eix)
es: izquierda (sobre su eje)

source: 180 degree
ca: 180 graus
es: 180 grados

source: 270 degree
ca: 270 graus
es: 270 grados

source: 135 degrees
ca: 135 graus
es: 135 grados

source: testWill
ca: testamentDeProva
es: testamentoDePrueba

source: hihat for _ ms on DAC pin _
ca: plat durant _ ms al pin DAC _
es: plato durante _ ms en el pin DAC _

source: ms scroll text _ with color _
ca: ms anima el text _ amb el color _
es: anima el texto _ con color _

source: set pixel x _ y _ erase _
ca: posa píxel x _ y _ esborrat _
cs: OLED nastav bod x _ y _ výmaz _
es: pon píxel x _ y _ borrado _
ru: установить точку x _ y _ стереть _

source: laser for _ ms with frequency _ speed _ on pin _
ca: làser durant _ ms amb freqüència _ i velocitat _ al pin _
es: láser durante _ ms con frecuencia _ velocidad _ en el pin _

source: kick for _ ms on pin _
ca: bombo durant _ ms al pin _
es: bombo durante _ ms en pin _

source: 45 degrees
ca: 45 graus
es: 45 grados

source: 180 degrees
ca: 180 graus
es: 180 grados

source: CBPro speed of _ wheel (cm/s)
ca: velocitat de la roda _ (cm/s)
es: velocidad de la rueda _ (cm/s)

source: CBPro stop all
ca: atura-ho tot
es: deténlo todo

source: CBPro distance (cm)
ca: distància frontal (cm)
es: distancia frontal (cm)

source: 90 degrees
ca: 90 graus
es: 90 grados

source: CBPro move _ (-255 to 255 cm)
ca: mou-te _ (-255 a 255 cm)
es: mueve _ (-255 a 255 cm)

source: Last will!
ca: Última voluntat!
cs: MQTT Poslední vůle!
es: ¡Última voluntad!

source: MQTT set will topic _ payload _
ca: posa el testament de MQTT a tema _ contingut _
cs: MQTT závěť nastav topic _ payload _
es: fija el testamento de MQTT a tema _ contenido _

source: buffer sizes _
ca: mides del buffer _
cs: velikosti bufferů MQTT _
es: tamaños del buffer _

source: noise for _ ms pitch shifted by _ on pin _
ca: soroll durant _ ms amb to desfasat en _ al pin _
es: ruido durante _ ms con tono desplazado por _ en el pin _

source: fade noise for _ ms pitch shifted by _ on DAC pin _
ca: soroll atenuat durant _ ms amb to desfasat en _ al pin DAC _
es: atenúa ruido en _ ms con tono desplazado por _ en el pin DAC _

source: snare for _ ms on DAC pin _
ca: caixa durant _ ms al pin DAC _
es: caja durante _ ms en el pin DAC _

source: cutebotturn;right-in-place
ca: dreta (sobre el seu eix)
es: derecha (sobre su eje)

source: CBPro set wheel speed left _ right _ (-60 to 60 cm/s)
ca: gira roda esquerra a _ i dreta a _ (-60 a 60 cm/s)
es: fija la velocidad de la rueda izquierda a _ y derecha a _ (-60 a 60 cm/s)

source: CBPro turn _ degrees
ca: gira _ graus
es: gira _ grados

source: CBPro set headlight _ to _
ca: posa la llum _ a _
es: pon el faro _ a _

source: Octo last beam
ca: últim missatge Octo
es: último mensaje Octo

source: Octo beam received?
ca: missatge Octo rebut?
es: ¿mensaje Octo recibido?

source: Octo set group _ (0-99)
ca: fixa grup Octo a _ (0-99)
es: fija grupo de Octo a _ (0-99)

source: CBPro stop wheel _
ca: atura roda _
es: detén rueda _

source: tom for _ ms pitch shifted by _ on pin _
ca: tambor durant _ ms amb to desfasat en _ al pin _
es: tambor durante _ ms con tono desplazado por _ en el pin _

source: advanced mode
ca: mode avançat
cs: pokročilý režim
es: modo avanzado
tr: gelişmiş mod

source: show advanced blocks, menu items and editor functionalities
ca: mostra blocs, opcions de menú i funcionalitats d'edició avançades
cs: zobrazit pokročilé bloky, položky menu a funkce editoru
es: muestra bloques, opciones de menú y funcionalidades de edición avanzadas
tr: gelişmiş blokları, menü öğelerini, ve editör işlevlerini göster

source: Reports firmware version loaded on the board.
ca: Reporta la versió del firmware carregat a la placa.
cs: Vrátí aktuální verzi firmware mikropočítače.
es: Reporta la versión del firmware cargado en la placa.

source: folder;Motors
ca: Motors
cs: Motory
es: Motores

source: Report the microseconds since the given start microseconds. Handles clock wrap.
ca: Reporta els microsegons des del moment d'inici especificat.
cs: Vrátí počet mikrosekund od daného počátečního stavu.
es: Reporta los microsegundos desde el momento de inicio especificado.

source: Report the milliseconds since the given start milliseconds. Handles clock wrap.
ca: Reporta els mil·lisegons des del moment d'inici especificat.
cs: Vrátí počet milisekund od daného počátečního stavu.
es: Reporta los milisegundos desde el momento de inicio especificado.

source: Write a byte to the pin at the specified baud rate.
ca: Envia un byte al pin amb la taxa de bauds especificada.
cs: Odeslání jednoho bajtu na výstup specifikovanou rychlostí (baud).
es: Envía un byte por el pin con la tasa de baudios especificada.

source: folder;WorkInProgress
ca: En construcció
cs: Připravuje se
es: En construcción

source: Report the seconds since power up.
ca: Reporta els segons des que la placa s'ha engegat.
cs: Vrátí počet vteřin od zapnutí mikropočítače.
es: Reporta los segundos desde que se encendió la placa.
