Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: next line of file _
ca: següent línia de l'arxiu _
cs: další řádek souboru _
de: nächste Zeile der Datei _
el: επόμενη γραμμή του αρχείου _
es: siguiente línea del archivo _
ja: 次の行 ファイル _
pt_br: linha seguinte do arquivo _
ru: следующая строка файла _
tr: _ dosyasının sonraki satırı
uz: faylning keyingi qatori _

source: a ByteArray
ca: una LlistaDeBytes
cs: pole bajtů
de: einByteArray
es: una ListaDeBytes

source: _ is uppercase
ca: _ és en majúscules
cs: _ je velké písmeno
de: _ ist in Großbuchstaben
es: _ está en mayúscula
ru: _ в верхнем регистре

source: suffix
ca: sufix
es: sufijo
ru: суффикс

source: string from unicodes _
ca: text a partir dels unicodes _
cs: řetězec z Unicode _
de: Zeichenfolge aus Unicode _
es: texto a partir de los unicodes _

source: Network_Password
ca: Contrasenya_De_Xarxa
cs: Síťové heslo
de: Netzwerkpasswort
es: Contraseña_de_red

source: Motion
ca: Moviment
cs: Pohyb
de: Bewegung
el: Κίνηση
es: Movimiento
ja: モーション
pt_br: Movimento
ru: Движение
tr: Hareket
uz: Harakat

source: step count
ca: passes
cs: počet kroků
de: Schrittzahl
el: μέτρησε βήματα
es: recuento de pasos
ja: ステップカウント
pt_br: contagem de passos
ru: количество шагов
tr: adım sayısı
uz: qadamlar soni

source: button _ pressed
ca: toc curt al botó _
cs: stisknuto tlačítko _
de: Knopf _ gedrückt
el: κουμπί _ πατήθηκε
es: pulsación corta en botón _
ja: ボタン _ 押す
pt_br: clique no botão _
ru: кнопка _ нажата
tr: buton _ basıldı
uz: _ tugmasi bosildi

source: Calliope set speaker _
ca: posa l'altaveu de la Calliope a _
cs: Calliope setze Lautsprecher _
de: Calliope setze Lautsprecher _
es: pon el altavoz de la Calliope a _
ja: Calliope スピーカの設定 _
pt_br: fixe o alto-falante do Calliope em _
ru: Каллиопа
tr: Calliope hoparlörü _ yap
uz: Calliope karnayni _ belgilash

source: Calliope loudness
ca: nivell de soroll de la Calliope
cs: Calliope Lautstärke
de: Calliope Lautstärke
es: nivel de ruido de la Calliope
ja: Calliope 音の大きさ
pt_br: Volume sonoro do Calliope
ru: Громкость Каллиопа
tr: Calliope ses yüksekliği
uz: Kalliopa balandligi

source: attach _ DotStar LEDs to data pin _ clock pin _
ca: inicialitza tira de _ LEDs DotStar al pin de dades _ i pin de rellotge _
cs: schließe _ DotStar LEDs an Daten-Pin _ Uhr-Pin _ an
de: verbinde _ DotStar LEDs an Daten-Pin _ Uhr-Pin _
es: inicializa tira de _ LEDs DotStar al pin de datos _ y pin de reloj _
ja: 接続 _ DotStar LEDs データピン _ クロックピン _
pt_br: inicialize fita de _ LEDs DotStar no pino de dados _ e pino de relógio _
ru: подключить _ светодиоды DotStar к контакту данных _ контакту синхронизации _
tr: _ DotStar LED"lerini veri pin _ saat pin _ bağla
uz: _ DotStar diodlarini LED-ga ulang

source: temperature (Celsius) DHT22 pin _
ca: temperatura (°C) del DHT22 al pin _
cs: teplota (Celsius) DHT22 Pin _
de: Temperatur (Celsius) DHT22 Pin _
el: θερμοκρασία (Κελσίου) DHT22 ακροδέκτης _
es: temperatura (ºC) del DHT22 en pin _
ja: 温度 (Celsius) DHT22 ピン _
pt_br: temperatura (°C) do DHT22 no pino _
ru: температура (С) DHT22 pin _
tr: ısı(Celsius) DHT22 pin _
uz: harorat (C) DHT22 pin _

source: HTTP client
ca: Client HTTP
el: HTTP πελάτης
es: Cliente HTTP
ja: HTTPクライアント
pt_br: Cliente HTTP
ru: HTTP-клиент
tr: HTTP istemcisi
uz: HTTP mijoz

source: last WebSocket event
ca: últim esdeveniment de WebSocket
cs: poslední událost WebSocekt
de: letztes WebSocket-Ereignis
es: último evento de WebSocket

source: set thing name to _
ca: fixa el nom de la cosa a _
cs: nastav jméno WebThing na _
de: setze Thing Namen auf _
el: όρισε το όνομα του αντικειμένου σε _
es: fija el nombre de la cosa a _
ja: Thing の名前を設定 _
pt_br: fixe o nome da coisa em _
ru: установить имя вещи на _
tr: nesne adını _ yap
uz: narsa nomini _ ga sozlash

source: MiKe Robot speed _ %
ca: MiKe Robot fixa la velocitat a _ %
es: MiKe Robot velocidad _ %

source: MiKe digital D8 to _
ca: Mike fixa l'actuador D8 a _
es: Mike fija actuador D8 a _

source: sb set pin S- _ (1-8) to _ %
es: sb pon el pin S- _ (1-8) a _ %

source: ms display #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _
ca: ms mostra #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _
es: ms pantalla #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _ #BR# _ _ _ _ _

source: ms display #BR# _ #BR# with color _
ca: ms mostra #BR# _ #BR# amb el color _
es: ms pantalla #BR# _ #BR# con el color _

source: ms display image _ with color _
ca: ms mostra la imatge _ amb el color _
es: ms muestra la imagen _ con el color _

source: ms;reset
ca: reseteja
es: resetea

source: TdR button 2
ca: TdR botó 2
es: TdR botón 2

source: Farm water level
ca: Farm nivell d'aigua
es: Farm nivell de agua

source: Home play _ octave _ for _ ms
ca: Home toca la nota _ a l'octava _ durant _ ms
es: Home toca la nota _ en la octava _ durante _ ms

source: Home movement detected?
ca: Home es detecta moviment?
es: Home ¿se detecta movimiento?

source: retain _ QoS _
ca: amb retenció _ i qualitat del servei _
cs: zachovej _ QoS _
es: con retención _ y calidad del servicio _

source: MQTT event
ca: esdeveniment MQTT
cs: MQTT událost
es: evento MQTT

source: UDP stop
ca: atura UDP
cs: zastav UDP
de: UDP stoppe
es: detén UDP

source: binary data _
ca: dades binàries _
cs: binární data _
de: Binärdaten _
es: datos binarios _

source: UDP remote port
ca: port remot UDP
cs: vzdálený UDP port
de: UDP Sender-Port
es: puerto remoto de UDP

source: cutebotwheel;right
ca: dret
es: derecha

source: cutebot;forward
ca: endavant
de: vorwärts
es: adelante

source: Wukong stop motor _
ca: Atura el motor _
es: detén el motor _

source: Wukong stop all
ca: Atura tots els motors
es: detén todos los motores

source: Wukong set NeoPixels _ _ _ _
ca: Posa els NeoPíxels del Wukong a _ _ _ _
es: pon los NeoPíxeles del Wukong a _ _ _ _

source: Wukong set LED brightness to _
ca: Fixa la brillantor del LED a _
es: fija el brillo del LED a _

source: button _ is pressed
ca: botó _ premut
es: boton _ pulsado

source: rocker value of _
ca: inclinació _ de la palanca
es: inclinación _ de la palanca

source: NeZha set motor _ speed to _ %
ca: posa el motor _ a velocitat _ %
es: pon el motor _ a velocidad _ %

source: NeZha set _ servo _ angle to _
ca: posa el motor de _ graus número _ a angle _
es: pon el motor de _ grados número _ a ángulo _

source: Octopus value of trimpot (0~1023) at pin _
ca: Octopus valor del potenciòmetre (0~1023) al pin _
es: valor del potenciómetro (0~1023) en el pin _

source: Octopus OLED show _ at x _ y _
ca: Octopus OLED mostra _ a les coordenades x _ y _
es: muestra _ en las coordenadas x _ y _ del OLED

source: Octopus OLED draw line from x _ y _ to x _ y _
ca: Octopus dibuixa una línia des de les coordenades x _ y _ a x _ y _ a la pantalla OLED
es: dibuja línea desde x _ y _ a x _ y _ en el OLED

source: Octopus OLED draw pixel x _ y _
ca: Octopus OLED pinta un píxel a les coordenades x _ y _
es: pinta un píxel en x _ y _ en el OLED

source: Octopus OLED draw circle x _ y _ radius _
ca: Octopus OLED dibbuixa un cercle x _ y _ radi _
es: dibuja un círculo en x _ y _ con radio _ en el OLED

source: Use "Connect" button to connect to a MicroBlocks device.
ar: استخدم زر "وصل" للاتصال بجهاز MicroBlocks.
ca: Utilitza el botó "Connecta" per connectar-te a un dispositiu MicroBlocks.
cs: Použijte tlačítko "Připojit" pro připojení zařízeni s MicroBlocks.
de: Drücke "Verbinden", um dein MicroBlocks-Gerät zu verbinden.
el: Χρησιμοποίησε “Συνδέσου” για να συνδεθείς στη συσκευή MicroBlocks.
es: Utiliza el botón "Conecta" para conectarte a un dispositivo MicroBlocks.
gl: Utilice o botón «Conectar» para conectarse a un dispositivo MicroBlocks.
ja: MicroBlocksデバイスに接続するには,"接続"ボタンを使用してください.
pt_br: Use o botão "Conectar" para conectar a um dispositivo MicroBlocks.
ru: Используйте кнопку "Подключить" для соединения с устройством MicroBlocks.
tr: MicroBlocks cihazına balanmak için "Bağlan" düğmesini kullan.
uz: MicroBlocks qurilmasiga ulanish uchun "Connect" tugmasini bosing.

source: copy all scripts to clipboard
ca: copia tots els programes al porta-retalls
cs: zkopírovat všechny skripty do schránky
de: kopiere alle Skripte in die Zwischenablage
el: Αντίγραψε όλα τα κείμενα στο πρόχειρο
es: copia todos los programas al portapapeles
gl: copiar todos os programas no portappeis
ja: すべてのスクリプトをクリップボードへコピーする
pt_br: copia todos os programas para a área de transferência
ru: скопировать все скрипты в буфер обмена
tr: tüm betikleri panoya kopyala
uz: barcha skriptlarni clipboardga nusxalash

source: undo the last block drop
ca: extreu l'últim bloc col·locat
cs: vrátit zpět poslední položení bloku
de: letzte Blockverschiebung zurücknehmen
es: extrae el último bloque colocado

source: small (50%)
ca: petita (50%)
cs: malé (50%)
de: klein (50%)
es: pequeño (50%)

source: download and install latest VM
ca: descarrega i instal·la l'última màquina virtual
cs: stáhnout a instalovat nejnovější virtuální stroj
de: aktuelle VM herunterladen und installieren
el: κατέβασε και εγκατάστησε το τελευταίο VM
es: descarga e instala la última máquina virtual
ja: 最新のVMをダウンロードしてインストール
pt_br: baixa e instala a última máquina virtual
ru: скачать и установить последнюю версию виртуальной машины
tr: en son VM'yi indirin ve yükleyin
uz: so'nggi VM-ni yuklab oling va o'rnating

source: Uploading MicroBlocks to board...
ca: Instal·lant MicroBlocks a la placa...
cs: MicroBlocks bude instalován do mikropočítče...
de: MicroBlocks wird auf das Board geladen...
el: Φορτώνει MicroBlocks στην κάρτα…
es: Instalando MicroBlocks en la placa...
ja: ボードへMicroBlocksをアップロード中...
pt_br: Instalando MicroBlocks na placa...
ru: MicroBlocks загружается на плату...
tr: MicroBlocks karta yükleniyor...
uz: MicroBlocks yuklanmoqda ...

source: show instructions
ar: عرض التعليمات
ca: mostra instruccions
cs: ukázat kódy instrukcí
de: zeige Op-Code
el: δείξε εντολές
es: muestra instrucciones
gl: amosar as instrucións
ja: 手順を表示
pt_br: mostra instruções
ru: Показать инструкции
tr: yönergeleri göster
uz: yo'riqnomalarni ko'rsatish

source: find variable modifiers
ca: cerca modificadors de la variable
cs: najít modifikátory proměnné
de: suche Variablenänderung
es: busca modificadores de la variable
tr: değişkenin değiştiricilerini bulun

source: find scripts or block definitions where this variable is being set or changed
ca: cerca programes o definicions de blocs on s'estigui fixant o modificant el valor d'aquesta variable
cs: najít skripty nebo bloky kde je do proměnná zapisováno
de: sucht Skript- oder Blockdefinitionen, in denen diese Variable gesetzt oder geändert wird
es: busca programas o definiciones de bloque en qué se esté fijando o modificando el valor de esta variable
tr: bu değişkene değer atayan veya değiştiren scriptleri veya blok tanımlarını bulun

source: show block definition...
ca: mostra la definició del bloc...
cs: zobraz definici bloku...
de: Blockdefinition anzeigen...
el: δείξε τον ορισμό του μπλοκ
es: muestra la definición del bloque...
gl: amosar a definición do bloque...
ja: ブロック定義を表示...
pt_br: mostra a definição do bloco...
ru: показать определение блока ...
tr: blok tanımını göster...
uz: blok ta'rifini ko'rsatish ...

source: delete the definition of this block
ca: esborra la definició d'aquest bloc
cs: smaž definici aktuálního bloku
de: Blockdefinition für diesen Block löschen
el: διαγραφή του ορισμού αυτού του μπλοκ
es: borra la definición de este bloque
gl: elimina a definición deste bloque
ja: このブロックの定義を削除
pt_br: apaga a definição deste bloco
ru: удалить определение данного блока
tr: bu bloğun tanımını sil
uz: ushbu blokning ta'rifini o'chirib tashlang

source: just this one block
ar: فقط هذه الكتلة
ca: només aquest bloc
cs: jen tento blok
de: nur diesen Block
el: μόνο αυτό το μπλοκ
es: solo este bloque
gl: só este bloque
ja: この1つのブロック
pt_br: apenas este bloco
ru: только этот блок
tr: yalnız bu blok
uz: faqat shu bitta blok

source: delete this block
ca: elimina aquest bloc
cs: smazat tento blok
de: diesen Block löschen
el: διάγραψε αυτό το μπλοκ
es: elimina este bloque
gl: eliminar este bloque
ja: このブロックを削除
pt_br: elimina este bloco
ru: удалить данный блок
tr: bu bloğu sil
uz: ushbu blokni o'chirish

source: duplicate these blocks
ca: duplica aquest bloc i tots els que el segueixen
cs: duplikovat vybrané bloky
de: dupliziere diese Blöcke
el: αντίγραψε αυτά τα μπλοκ
es: duplica este bloque y todos los que le siguen
gl: duplica este bloque e todos os que lle seguen
ja: これらのブロックを複製
pt_br: duplica este bloco e todos os que se seguem
ru: дублировать эти блоки
tr: bu blokları çoğalt
uz: ushbu bloklarni nusxalash

source: copy script
ar: نسخ البرنامج النصي
ca: copia el programa
cs: kopírovat skript
de: dupliziere Skript
el: αντιγραφή κειμένου
es: copia el programa
gl: copia el programa
ja: スクリプトをコピー
pt_br: copia o programa
ru: копировать скрипт
tr: betiği kopyala
uz: skriptdan nusxa olish

source: blockdef;delete
ar: حذف
ca: elimina
cs: vymazat
de: löschen
el: διαγραφή
es: elimina
gl: eliminar
ja: 削除
pt_br: apaga
ru: удалить
tr: sil
uz: o'chirish

source: select all
ca: selecciona-ho tot
cs: vybrat vše
de: alles Auswählen
es: selecciona todo
tr: tümünü seç

source: OK
ca: D'acord
es: De acuerdo
gl: Aceptar
ja: 確定
ru: ОК
tr: Tamam

source: Computer
ca: Ordinador
cs: Počítač
el: Υπολογιστής
es: Ordenador
ja: コンピュータ
pt_br: Computador
ru: Компьютер
tr: Bilgisayar
uz: Kompyuter

source: File
ca: Arxiu
cs: Soubor
de: Datei
el: Αρχείο
es: Fichero
gl: Ficheiro
ja: ファイル
pt_br: Arquivo
ru: Файл
tr: Dosya
uz: Fayl

source: Desktop
ca: Escriptori
cs: Plocha
el: Οθόνη
es: Escritorio
ja: デスクトップ
ru: Рабочий стол
tr: Masaüstü
uz: Ish stoli

source: Tags:
ca: Etiquetes:
cs: Klíčová slova:
de: Schlagworte:
el: Ετικέτες:
es: Etiquetas:
ja: タグ:
pt_br: Etiquetas:
ru: Метки
tr: Tegler:
uz: Teglar:

source: Path, name or URL for library?
ca: Camí, nom o URL de la llibreria?
cs: Cesta, jméno nebo URL knihovny?
de: Pfad, Name oder URL des Moduls?
el: Μονοπάτι, όνομα ή URL για βιβλιοθήκη;
es: ¿Ruta, nombre o URL de la librería?
ja: ライブラリの場所,名前またはURLは?
pt_br: Caminho, nome ou URL da biblioteca?
ru: Путь, имя или URL для библиотеки?
tr: Kütüphanenin Yol, ad veya URL'si?
uz: Kutubxona adresi, nomi yoki URL manzili?

source: Tag name?
ca: Nom de l'etiqueta?
cs: Klíčové slovo?
de: Schlagwort?
el: Όνομα Ετικέτας;
es: ¿Nombre de la etiqueta?
ja: タグの名前は?
pt_br: Nome da etiqueta?
ru: Название метки?
tr: Teg adı?
uz: Teg nomi?

source: Increase block size
ca: Augmenta mida dels blocs
cs: Zvětšit velikost bloku
de: vergößere Blockgröße
es: Aumenta el tamaño de los bloques
tr: Blokları büyüt

source: [l] toggle value, or drop a reporter into it.
ca: [l] commuta'n el valor, o deixa-hi caure un reportador.
cs: [l] přepnutí hodnoty nebo přetažení hodnoty na pozici.
de: [l] Wert auswählen, oder zum Hineinziehen eines Rückgabeblocks.
es: [l] conmuta su valor, o arrastra un reportador encima.
tr: [l] değeri değiştirin veya içine bir raportör bırakın.

source: [l] change the color, or drop a reporter into it.
ca: [l] canvia'n el color, o deixa-hi caure un reportador.
cs: [l] změna barvy nebo přetažení hodnoty na pozici.
de: [l] Farbe auswählen, oder zum Hineinziehen eines Rückgabeblocks
es: [l] canvia su color, o arrastra un reportador encima.
tr: [l] rengi değiştirin veya içine bir raportör bırakın.

source: [l] to run, or drag to build scripts. [r] menu.
ca: [l] per execuitar-lo, o arrosega'l per construir programes. [r] menú.
cs: [l] spustit, přetáhnout pro tvorbu skriptu. [r] menu.
de: [l] zum Starten oder Ziehen zum Bauen eines Skipts. [r] Menü.
es: [l] para ejecutarlo, o arrástralo para construir programas. [r] menú.
tr: çalıştırmak için [l] veya komut dosyaları oluşturmak için sürükleyin. [r] menü.

source: [l] to see value, or drop into an input slot. [r] menu.
ca: [l] per consultar-ne el valor, o deixa'l caure dins d'una casella. [r] menú.
cs: [l] zobrazit hodnotu, přetáhnout do místa pro vstup. [r] menu.
de: [l] zur Werteanzeige oder zum Ziehen in einen Eingabebereich. [r] Menü.
es: [l] para consultar su valor, o arrástralo sobre una casilla. [r] menú.
tr: değeri görmek için veya bir girdi alanına bırakmak için [l] . [r] menü.

source: Drag blocks here to build scripts. [r] menu.
ca: Col·loca-hi blocs per construir programes. [r] menú.
cs: Do tohoto panelu se vkládají bloky pro vytváření skriptu. [r] menu.
de: Ziehe Blöcke hierher um Skripts zu bauen. [r] Menü.
es: Arrastra bloques hasta aquí para construir programas. [r] menú.
tr: Komut dosyaları oluşturmak için blokları buraya sürükleyin. [r] menü.

source: Set an I2C device and register to given value (0-255).
ca: Fixa un dispositiu i registre I2C a un valor determinat (0-255).
cs: Nastaví registr I2C zařízení na zadanou hodnotu (0-255).
de: Legt den Wert eines Registers (0-255) auf einem I2C-Gerät fest.
es: Fija un dispositivy y registro I2C a un valor determinado (0-255).
tr: I2C cihazını ve sayacını verilen değere (0-255) ayarlayın.

source: Open the serial port at the given baud rate.
ca: Obre el port sèrie a la velocitat en bauds especificada.
cs: Otevření sériového portu s danou přenosovou rychlostí.
de: Öffnet einen seriellen Anschluss mit der angegebenen Baudrate.
es: Abre el puerto serie a la velocidad en baudios especificada.
tr: Verilen baud hızında seri bağlantı noktasını açın.

source: Report the first number minus the second.
ca: Reporta la resta entre el primer i el segon nombre.
cs: Vrátí rozdíl čísel.
de: Gibt die Differenz der beiden Zahlen zurück (erste Zahl minus zweite Zahl).
es: Reporta la resta entre el primer y el segundo número.
tr: İlk sayı eksi ikinci sonucunu bildirin.

source: Report the product of the given numbers.
ca: Reporta el producte dels números especificats.
cs: Vrátí součin čísel.
de: Gibt das Produkt der beiden Zahlen zurück.
es: Reporta el producto de los números especificados.
tr: Verilen sayıların çarpımını bildirin.

source: Report the first number divided by the second.
ca: Reporta el resultat de dividir el primer nombre entre el segon.
cs: Vrátí podíl čísel (celočíselný).
de: Gibt den Quotienten der beiden Zahlen zurück (erste Zahl durch zweite Zahl).
es: Reporta el resultado de dividir el primer número entre el segundo.
tr: İkinci bölü ilk sayıyı bildirin.

source: Report the logical inverse of a Boolean ( (-o) or (o-) ) value.
ca: Reporta la inversa d'un valor booleà ( (-o) o (o-) ).
cs: Vrátí opak logické hodnoty ( (-o) or (o-) ).
de: Gibt die logische Umkehrung des Wahrheitswerts ( (-o) oder (o-) ) zurück.
es: Reporta la inversa de un valor booleano ( (-o) o (o-) ).
tr: Boolean ( (-o) veya (o-) ) değerinin mantıksal tersini bildirin.

source: Report bitwise inverse of the given number.
ca: Reporta l'inversa bit a bit del nombre especificat.
cs: Vrátí bitovou inverzi čísla.
de: Gibt die bitweise Negation der Zahl zurück.
es: Reporta la inversa bit a bit del número especificado.
tr: Verilen sayının bit düzeyinde tersini bildirin.

source: Create a variable local to the containing script with the given initial value.
ca: Crea una variable local al programa que la contingui i assigna-li un valor inicial.
cs: Vytvoří lokální proměnnou aktuálního skriptu s danou počíteční hodnotou.
de: Erzeugt eine lokale Variable im enthaltenen Skript mit dem angegebenen Anfangswert.
es: Crea una variable local al programa que la contenga, y asígnale el valor inicial especificado.
tr: Verilen başlangıç değeriyle yerel bir değişkeni içerilen komut dosyasında oluşturun.

source: Add an item to the end of a list.
ca: Afegeix un element al final d'una llista.
cs: Přidá položku na konec seznamu.
de: Fügt ein Element an das Ende der Liste an.
es: Añade un elemento al final de una lista.
tr: Listenin sonuna bir öğe ekleyin.

source: Replace the Nth item (or all items) of a list or byte array with the given value.
ca: Substitueix l'element en la posició especificada (o tots els elements) d'una llista o llista de bytes pel nou valor especificat.
cs: Nahradí N-tou položku seznamu/pole bajtů (případně všechny) danou hodnotou.
de: Ersetzt das angegebene Element (oder alle Elemente) in der Liste oder dem Byte-Array durch den gegebenen Wert.
es: Sustituye el elemento en la posición especificada (o todos los elementos) de una lista o lista de bytes por el nuevo valor especificado.
tr: Bir listenin veya bayt dizisinin N. öğesini (veya tüm öğelerini) verilen değerle değiştirin.

source: Split the given string with the given delimiter and report the result (a list of strings).
ca: Retorna la cadena de text especificada dividida pels delimitadors especificats (una llista de cadenes de text).
cs: Rozdělí text do seznamu řetězců podle zadaného oddělovače a vrátí tento seznam.
de: teilt die gegebene Zeichenfolge mit dem angegebenen Trennzeichen und gibt dies als Liste von Zeichenfolgen zurück.
es: Retorna la cadena de texto especificada dividida por los delimitadores especificados (una lista de cadenas de texto).
tr: Verilen dizgiyi verilen sınırlayıcı ile bölün ve sonucu rapor edin (dizelerin bir listesi).

source: Report the Unicode value ("code point") of the Nth character of the given string.
ca: Reporta el valor Unicode del caràcter en la posició especificada d'una cadena de text.
cs: Vrací Unicode N-tého znaku řetězce.
de: Gibt den Unicode-Wert ("Codepunkt") des N-ten Zeichens der angegebenen Zeichenfolge an.
es: Reporta el valor Unicode del carácter en la posición especificada de una cadena de texto.
tr: Verilen dizenin N. karakterinin Unicode değerini ("kod noktası") bildirin.

source: Report a new byte array of the given length filled with zero or the optional value.
ca: Reporta una nova llista de bytes de la llargada especificada que contingui zeros (o el valor opcional especificat) en totes les seves posicions.
cs: Vrací nové pole bajtů dané délky vyplněné nulami případně zadanou volitelnou hodnotou.
de: Gibt ein neues Byte-Array der angegebenen Länge zurück, das mit Nullen oder dem optionalen Wert gefüllt ist.
es: Reporta una nueva lista de bytes del tamaño especificado que contenga ceros (o el valor opcional especificado) en todas sus posiciones.
tr: Sıfır veya isteğe bağlı değerle doldurulmuş, verilen uzunlukta yeni bir bayt dizisi bildirin.

source: attach IR receiver to pin _
ca: inicialitza receptor IR al pin _
cs: přípoj IR přijímač k pinu _
de: verbinde IR-Empfänger an Pin _
el: επισυνάψτε δέκτη IR στον ακροδέκτη _
es: inicializa receptor IR en el pin _
gl: inicializar o receptor IR no pin _
ja: IR 受信機を接続 ピン _
pt_br: inicializa receptor IR no pin _
ru: подключите ИК-приемник к контакту _
tr: IR alıcısını _ pinine bağla
uz: IR qabul qilgichini _ pinga ulang-

source: while holding _
ca: mantenint _ premut
cs: dokud stisknuto _
es: manteniendo _ pulsado

source: kbd;CapsLock
ca: Bloqueig de majúscules
cs: CapsLock
de: Feststelltaste
es: BloqMayús

source: Lists
ca: Llistes
cs: Seznamy
de: Listen
es: Listas

source: reversed _
ca: _ invertida
cs: obrácený _
de: _ umgekehrt
es: _ invertida

source: house
ca: casa
cs: dům
de: Haus
es: casa

source: attach buzzer to pin _
ca: inicialitza brunzidor al pin _
cs: připoj bzučák k pinu Pin _
de: verbinde Summer mit Pin _
el: επισυνάψε το βομβητή στον ακροδέκτη _
es: inicializa zumbador en el pin _
gl: inicializar zunidor no pin _
ja: ブザーをつける ピン _
pt_br: inicialize campainha no pino _
ru: подключить зуммер к контакту _
tr: sesli uyarıcıyı _ pinine bağla
uz: qo’ng’iroqni pinga biriktirish

source: play frequency _ for _ ms
ca: toca la freqüència _ durant _ ms
cs: hraj kmitočet _ po _ ms
de: spiele Frequenz _ Hz für _ ms
el: παίξε συχνότητα _ για _ χδ
es: toca la frecuencia _ durante _ ms
gl: tocar a frecuencia _ durante _ ms
ja: 周波数を再生 _ 長さ _ ミリ秒
pt_br: toque a frequência _ por _ ms
ru: частота воспроизведения _ в течение _ мс
tr: _ frekansını _ milisaniye çal
uz: chastotasini _ ms davomida ijro etish
