Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: pluck MIDI key _ for _ msecs
ca: punteja la nota MIDI _ durant _ ms
cs: zadrnkej MIDI klávesu _ oktáva _ po _ ms
es: tañe la nota MIDI _ durante _ ms

source: Low-Mid Tom
ca: Tom-tom mig-greu
es: Tom-tom medio-grave

source: Hi-Mid Tom
ca: Tom-tom mig-agut
es: Tom-tom medio-agudo

source: Crash Cymbal 1
ca: Plat d'accents (crash) 1
es: Plato de acentos (crash) 1

source: Ride Bell
ca: Campana
es: Campana

source: send MIDI start playing
ca: inicia seqüenciador MIDI
es: inicia secuenciador MIDI

source: send MIDI stop playing
ca: pausa seqüenciador MIDI
es: pausa secuenciador MIDI

source: chord progression _ with root _
ca: progressió d'acords _ amb arrel _
es: progresión de acordes _ con raíz _

source: trtl;home
ca: torna a casa
cs: domů
de: gehe zum Ursprung
el: Σπίτι
es: vuelve a casa
ja: ホーム
pt_br: volte para casa
ru: домашняя страница
tr: başlangıç
uz: uy

source: IP address
ca: adreça IP
cs: IP addresa
de: IP-Adresse
el: IP διεύθυνση
es: dirección IP
gl: enderezo IP
ja: IPアドレス
pt_br: endereço IP
ru: IP адресс
tr: IP adresi

source: set all DotStar LEDs to r _ g _ b _
ca: posa tots els LEDs DotStar a vermell _ verd _ blau _
cs: setze alle DotStar LEDs auf r _ g _ b _
de: setze alle DotStar LEDs auf r _ g _ b _
es: pon todos los LEDs DotStar a rojo _ verde _ azul _
ja: 設定 すべてのDotStar LEDs を r _ g _ b _
pt_br: fixe todos os LEDs DotStar em vermelho _ verde _ azul _
ru: установить все светодиоды DotStar на r _ g _ b _
tr: Tüm DotStar LED"lerini k _ y _ m _ yap
uz: barcha DotStar LEDlarni r _ g _ b _ ga belgilash

source: start HTTP server
ca: inicia el servidor HTTP
cs: spustit HTTP Server
de: starte HTTP-Server
el: ξεκίνα τον HTTP εξυπηρετητή
es: inicia el servidor HTTP
ja: HTTPサーバーを開始
pt_br: inicie o servidor HTTP
ru: запустить HTTP-сервер
tr: HTTP sunucusunu başlat
uz: HTTP serverni ishga tushirish

source: type of WebSocket event _
ca: tipus de l'esdeveniment de WebSocket _
cs: typ WebSocket události _
de: Typ des WebSocket-Ereignisses _
es: tipo del evento de WebSocket _

source: register event _ type _
ca: registra l'esdeveniment _ de tipus _
cs: registruj událost _ typ _
de: registriere Ereignis _ Typ _
el: καταχώρησε γεγονός _ τύπος _
es: registra el evento _ de tipo _
gl: rexistrar o evento _ do tipo _
ja: 登録イベント _ タイプ _
pt_br: registre o evento _ do tipo _
ru: зарегистрировать событие _ тип _
tr: kaydet olay _ tip _
uz: voqeani ro'yxatdan o'tkazish _ turi _

source: ms light
es: ms luz

source: plotter move _ steps
ca: mou plotter _ passes
de: Plotter gehe _ Schritte
es: mueve plotter _ pasos

source: plotter turn _ degrees
ca: gira rumb del plotter en _ °
de: Plotter drehe _ Grad
es: rota rumbo del plotter en _ °

source: plotter turn _ / _ of circle
ca: gira rumb del plotter en _ / _ de volta
de: Plotter drehe _ / _ eines Kreises
es: rota rumbo del plotter en _ / _ de vuelta

source: Imagina set _ to _
ca: Imagina moviment del _ : _
es: Imagina movimiento del _ : _

source: Farm _ the trapdoor
ca: Farm _ la portella
es: Farm _ la trampilla

source: Farm play _ octave _ for _ ms
ca: Farm toca la nota _ a l'octava _ durant _ ms
es: Farm toca la nota _ en la octava _ durante _ ms

source: Home set light _
ca: Home _ el llum
es: Home _ la luz

source: Home clear leds
ca: Home apaga els Neopixels
es: Home apaga Neopixels

source: Wukong set servo _ to speed _ (-100 to 100)
ca: Posa el servo _ a velocitat _ (-100 a 100)
es: pon el servo _ a velocidad _ (-100 a 100)

source: other...
ar: غير...
ca: un altre...
cs: jiné...
de: sonstige...
el: άλλα…
es: otro...
gl: outro...
ja: その他...
pt_br: outro...
ru: другие...
tr: diğer...
uz: boshqa...

source: none
ar: لا شيء
ca: cap
cs: žádné připojení
de: kein Anschluss
el: κανένα
es: ninguno
gl: ningún
ja: なし
pt_br: nenhum
ru: никакой
tr: hiçbiri
uz: hech qaysi

source: More info at http://microblocks.fun
ca: Més informació a http://microblocks.fun
cs: Další informace na http://microblocks.fun
de: Mehr Informationen unter http://microblocks.fun
el: Περισσότερες πληροφορίες στο http://microblocks.fun
es: Más información en http://microblocks.fun
gl: Máis información en http://microblocks.fun
ja: より多くの情報は http://microblocks.fun
pt_br: Mais informações em http://microblocks.fun
ru: Подробнее: http://microblocks.fun
tr: Daha fazla bilgi için: http://microblocks.fun
uz: Qo'shimcha ma'lumot: http://microblocks.fun

source: No boards found; is your board plugged in?
ar: لم يتم العثور على لوحات‪.‬ هل تم توصيل اللوحة الخاصة بك؟
ca: No s'ha trobat cap placa; has connectat la teva placa?
cs: Nenalezen žádný mikropočítač, je připojen?
de: Kein Board gefunden; ist dein Board eingesteckt?
el: Δεν βρέθηκαν κάρτες, είναι συνδεδεμένη η κάρτα σου;
es: No se ha encontrado ninguna placa; ¿has conectado tu placa?
gl: Non se atopou ningunha placa; ten conectada a súa placa?
ja: ボードが見つかりません，ボードが接続されていますか?
pt_br: Nenhuma placa encontrada, sua placa está conectada?
ru: Плат не найдено. Вы уверены, что плата подключена?
tr: Kart algılanmadı; kardınız bağlı mı?
uz: Hech qanday platalar topilmadi; sizning platangiz ulanganmi?

source: show data graph
ca: mostra la gràfica de dades
cs: zobrazit data v grafu
de: zeige Daten als Diagramm
el: εμφάνισε την γραφική παράσταση
es: muestra el gráfico de datos
gl: amosar a gráfica de datos
ja: グラフを表示
pt_br: mostra o gráfico de dados
ru: показать график данных
tr: veri grafiğini göster
uz: ma'lumotlar grafigini ko'rsatish

source: disable autoloading board libraries
ca: no carreguis llibreries de placa automàticament
cs: deaktivovat automatické načítání knihoven mikropočítače
de: deaktiviere automatisches Laden von Board-Modulen
el: απενεργοποίηση αυτόματης φόρτωσης των βιβλιοθηκών της κάρτας
es: desactivar autocarga de librerías de placa
ja: ボードライブラリの自動読み込みを無効化
pt_br: desativa o autocarregamento das bibliotecas de placas
ru: отключить автозагрузку библиотек платы
tr: kütüphanelerin otomatik yüklemesini devre dışı bırak
uz: plata kutibxonalarini avtomatik yuklashni o'chirib qo'yish

source: show implementation blocks
ca: mostra els blocs d'implementació
cs: zobrazovat implementační bloky
de: zeige Implementationsblöcke
es: mostrar los bloques de implementación

source: Firmware Installed
ca: Firmware instal·lat
cs: Firmware instalován
de: Firmware installiert
es: Firmware instalado
tr: Firmware Kuruldu

source: Reconnect to the board by clicking the "Connect" button (USB icon).
ca: Torna a connectar-te a la placa clicant el botó de connexió (icona USB).
cs: Znovu připojte mikropočítač stisknutím tlačítka "Připojit" (ikona USB).
de: Verbinde das Board durch Klicken des Connect-Buttons (USB-Icon) neu.
es: Reconéctate a la placa clicando sobre el botón de conexión (icono USB).
tr: "Bağlan" (USB simgesi) düğmesine tıklayarak board'a yeniden bağlanın.

source: Connect USB cable while holding down the white BOOTSEL button before proceeding.
ca: Abans de continuar, connecta el cable USB mentre prems el botó blanc "BOOTSEL".
cs: Před pokračováním stiskněte a držte bílé tlačítko BOOTSEL a připojte USB kabel.
de: halte während des Anschließens des USB-Kabels den weißen BOOTSEL-Button gedrückt, fahre dann hier fort.
es: Antes de continuar, conecta el cable USB mientras mantienes el botón BOOTSEL pulsado.
tr: Devam etmeden önce beyaz BOOTSEL düğmesini basılı tutarken USB kablosunu bağlayın.

source: You will be asked to save the firmware file.
ca: Se't demenarà que desis l'arxiu de firmware.
cs: Budete dotázáni na uložení souboru s firmware.
de: Du wirst aufgefordert, die Firmware-Datei zu speichern.
es: Se te pedirá que guardes el fichero de firmware.
tr: Firmware dosyanızı kaydetmeniz istenecektir.

source: Save the firmware file when prompted.
ca: Desa l'arxiu de firmware quan se't demani.
cs: Uloží soubor firmware po vyzvání.
de: Die Firmware Datei lokal speichern.
es: Guarda el archivo de firmware cuando se te pida.
tr: İstediğinizde firmware dosyasını kaydedin.

source: dark mode
ca: mode fosc
cs: tmavý režim
es: modo oscuro
tr: karanlık mod

source: Could not fetch library.
ca: No s'ha pogut obtenir la llibreria.
cs: Nelze načíst knihovnu.
de: Modul konnte nicht geladen werden.
el: Δεν μπόρεσε να φορτώσει την βιβλιοθήκη.
es: No se pudo obtener la librería.
ja: ライブラリを取得できなかった.
pt_br: Não é possível obter a biblioteca.
ru: Не удалось вызвать библиотеку.
tr: Kütüphane yüklenemedi.
uz: Kutubxonani tortib olib bo'lmadi.

source: Host does not exist or is currently down.
ca: El servidor no existeix, o està fora de servei.
cs: Server neexistuje nebo jem momentálně nedostupný.
de: Host existiert nicht oder ist momentan nicht erreichbar.
el: Οικοδεσπότης δεν υπάρχει ή δεν λειτουργεί
es: El servidor no existe o está fuera de servicio.
ja: ホストが存在しない,または現在ダウンしている.
pt_br: O servidor não existe ou não está funcionando.
ru: Хост не существует или в данный момент не работает.
tr: Ana makine mevcut değil veya şu anda kapalı.
uz: Xost mavjud emas yoki hozirda ishlamayapti.

source: Block Category
ca: Categoria de blocs
cs: Kategorie bloků
de: Blockkategorie
es: Categoría de bloques
tr: Blok Kategorisi

source: Drag blocks from here to build scripts. Drop scripts here to delete them.
ca: Arrossega blocs des d'aquí fins a la zona de programació per construir programes. Deixa-hi caure programes per eliminar-los.
cs: Odsud se tahají bloky pro vytváření skriptů. Pro smazání skriptu jej upusťte zde.
de: Ziehe Blöcke von hier in den Skriptbereich. Schiebe Skripte hierher um sie zu löschen.
es: Arrastra bloques des de aquí hasta la zona de programación para construir programas. Arrastra programas hasta aquí para eliminarlos.
tr: Komut dosyaları oluşturmak için blokları buradan sürükleyin. Silmek için komut dosyalarını buraya bırakın.

source: Turn the user LED on or off.
ca: Encén o apaga del LED d'usuari.
cs: Zhasnutí/rozsvícení uživatelské LED na desce.
de: Schaltet die Benutzer-LED ein oder aus.
es: Enciende o apaga el LED de usuario.
tr: Kullanıcı LED'ini açın veya kapatın.

source: Report the state of button A ( (-o) or (o-) ).
ca: Reporta l'estat del botó A ( (-o) o (o-) ).
cs: Vrátí stav tlačítka A ( (-o) or (o-) ).
de: Gibt den Zustand der Taste A zurück ( (-o) oder (o-) ).
es: Reporta el estado del botón A ( (-o) o (o-) ).
tr: A düğmesinin ( (-o) veya (o-) ) durumunu bildirin.

source: Report the milliseconds since power up.
ca: Reporta els mil·lisegons des que la placa s'ha engegat.
cs: Vrátí počet milisekund od zapnutí mikropočítače.
de: Gibt die Zeit in ms seit dem Einschalten zurück.
es: Reporta los milisegundos des de que se encendió la placa.
tr: Güç açıldıktan sonraki milisaniyeleri bildirin.

source: Report a number proportional to the voltage on an analog pin (0 = ground, 1023 = supply voltage).
ca: Reporta un nombre proporcional al voltatge en un pin analògic (0 = terra, 1023 = voltatge subministrat).
cs: Vrátí hodnotu odpovídající napětí na analogovém vstupu (0=GND, 1023=napájecí napětí).
de: Gibt eine Zahl proportional zur Spannung an einem analogen Pin zurück (0 = Masse, 1023 = Versorgungsspannung).
es: Reporta un número proporcional al voltaje en un pin analógico (0 = tierra, 1023 = voltaje suministrado).
tr: Analog pin üzerindeki voltajla orantılı bir sayı bildirin (0 = toprak, 1023 = besleme voltajı).

source: Send multiple bytes to an I2C device.
ca: Envia múltiples bytes a un dispositiu I2C.
cs: Odeslání více bajtů do I2C zařízení.
de: Sendet mehrere Byte an ein I2C-Gerät.
es: Envía múltiples bytes a un dispositivo I2C.
tr: I2C cihazına birden çok bayt gönderin.

source: Read a byte from an SPI device while sending a zero byte. Report the byte received.
ca: Llegeix un byte d'un dispositiu SPI, i envia un byte zero. Reporta el byte rebut.
cs: Vrátí přečtený bajt z SPI zařízení zatímco odešle bajt=0.
de: Liest ein Byte von einem SPI-Gerät während es ein Null-Byte sendet. Gibt das Byte zurück.
es: Lee un byte de un dispositivo SPI, y envía un byte cero. Reporta el byte recibido.
tr: Sıfır bayt gönderirken bir SPI cihazından bir bayt okuyun. Alınan baytı bildirin.

source: Run the first set of blocks whose test condition is (-o) .
ca: Executa el primer grup de blocs pels quals la condició sigui (-o) .
cs: Provede první skupinu bloků když je splněna podmínka (-o) .
de: Es wird der Blockbereich ausgeführt, für den die Bedinung (-o) ist.
es: Ejecuta el primer grupo de bloques para los cuales la condición sea (-o) .
tr: Test koşulu (-o) olan ilk blok grubunu çalıştırın.

source: Run when the condition becomes (-o) .
ca: Executa quan la condició esdevingui (-o) .
cs: Úkol běží při splnění podmínky (-o) .
de: Wird ausgeführt, falls die Bedingung (-o) wird.
es: Ejecuta cuando la condición sea (-o) .
tr: Koşul (-o) olduğunda çalıştırın.

source: Return (report) the given value from a function or script.
ca: Retorna (reporta) el valor especificat des d'una funció o programa.
cs: Vrátí výstupní hodnotu z funkce nebo skriptu.
de: Gibt den angegebenen Wert einer Funktion oder eines Skripts zurück.
es: Retorna (reporta) el valor especificado des de una función o programa.
tr: Bir işlevden veya betikten verilen değeri döndürün (bildirin).

source: Broadcast the given message.
ca: Emet el missatge especificat.
cs: Rozeslání zadané zprávy.
de: Sendet die angegebene Nachricht.
es: Emite el mensaje especificado.
tr: Verilen mesajı yayınlayın.

source: Stop this task.
ca: Atura aquesta tasca.
cs: Zastaví tento úkol.
de: Beendet das Skript
es: Detén esta tarea.
tr: Bu görevi durdur.

source: Call the function with the given name and optional parameter list.
ca: Executa la funció amb el nom especificat amb la llista de paràmetres opcional proporcionada.
cs: Zavolá funkci daného jména s případnými parametry.
de: Ruft die Funktion mit dem angegebenen Namen und den optionalen Parametern auf.
es: Ejecuta la función con el nombre especificado con la lista de parámetros opcional proporcionada.
tr: Verilen ad ve isteğe bağlı parametre listesi ile işlevi çağırın.

source: Report the sum of the given numbers.
ca: Reporta la suma dels nombres especificats.
cs: Vrátí součet zadaných čísel.
de: Gibt die Summe der gegebenen Zahlen zurück.
es: Reporta la suma de los números especificados.
tr: Verilen sayıların toplamını bildiriniz.

source: Report the remainder of dividing the first number by the second.
ca: Reporta el residu de dividir el primer nombre entre el segon.
cs: Vrátí zbytek po celočíselném dělení.
de: Gibt den Rest bei Division der ersten Zahl durch die zweite Zahl zurück.
es: Reporta el residuo de dividir el primer número entre el segundo.
tr: İlk sayıyı ikinciye bölmenin kalanını bildirin.

source: Report the maximum of the values.
ca: Reporta el més gran dels valors especificats.
cs: Vrátí největší hodnotu.
de: Gibt das Maximum der Werte zurück.
es: Reporta el mayor de los valores especificados.
tr: Maksimum değeri bildirin.

source: Report the given number shifted left by the given number of bits.
ca: Reporta el nombre especificat desplaçat aritmèticament cap a l'esquerra el nombre de bits especificat.
cs: Vrátí hodnotu čísla posunutou doleva o zadaný počet bitů.
de: Gibt die Zahl zurück, die aus der bitweisen Verschiebung der Eingabe um die angegebene Anzahl von Bits nach links entsteht.
es: Reporta el número especificado desplazado aritméticamente hacia la izquierda el número de bits especificado.
tr: Verilen sayıyı verilen bit sayısı kadar sola kaydırın.

source: Report the Nth item of a list, string, or byte array.
ca: Reporta l'element en la posició especificada d'una llista, cadena de text o llista de bytes.
cs: Vrátí n-tou položku seznamu, řetězce nebo pole bajtů.
de: Gibt das angegebene Element aus der Liste, der Zeichenfolge oder dem Byte-Array zurück.
es: Reporta el elemento en la posición especificada de una lista, cadena de texto o lista de bytes.
tr: Bir listenin, dizenin veya bayt dizisinin N. öğesini bildirin.

source: Delete the Nth item (or all items) of a list.
ca: Elimina l'element en la posició especificada (o tots els elements) d'una llista.
cs: Smaže N-tou položku seznamu (případně všechny).
de: Lösche das angegebene Element (oder alle Elemente) aus der Liste.
es: Elimina el elemento en la posición especificada (o todos los elementos) de una lista.
tr: Listenin N. öğesini (veya tüm öğelerini) silin.

source: Report a new list of the given length filled with zero or the optional value.
ca: Reporta una nova llista de la mida especificada que contingui zeros (o el valor opcional especificat) en totes les seves posicions.
cs: Vrací nový seznam dané délky vyplněný nulami případně zadanou volitelnou hodnotou.
de: Gibt eine neue Liste der angegebenen Länge zurück, die mit Nullen oder dem optionalen Wert gefüllt ist.
es: Reporta una nueva lista del tamaño especificado que contenga ceros (o el valor opcional especificado) en todas sus posiciones.
tr: Sıfır veya isteğe bağlı değerle doldurulmuş verilen uzunlukta yeni bir liste bildirin.

source: shift all NeoPixel colors by _
ca: canvia tots els colors dels NeoPíxels en _
cs: posuň všechny barvy NeoPixel o _ pozic
es: cambia todos los colores de los NeoPíxels por _
tr: tüm NeoPixel renklerini _ kaydır

source: cat;Control
ar: مراقبة
ca: Control
cs: Řízení
de: Steuerung
el: Έλεγχος Ροής
es: Control
gl: Control
ja: 操作
pt_br: Controle
ru: Контроль
tr: Kontrol
uz: Nazorat

source: when started
ar: عند البداية
ca: en començar
cs: při startu
de: Wenn gestartet
el: όταν ξεκινά
es: al empezar
gl: ao comezar
ja: スタートしたら
pt_br: quando iniciar
ru: когда запущено
tr: başladığında
uz: qachon boshlangan

source: when button _ pressed
ar: عند الضغط على زر _
ca: quan es premi el botó _
cs: při stisku tlačítka _
de: Wenn Knopf _ gedrückt
el: όταν το κουμπί _ πατηθεί
es: cuando se pulse el botón _
gl: cando se preme o botón _
ja: ボタン _ が押されたら
pt_br: quando pressionar o botão _
ru: когда кнопка _ нажата
tr: buton _ basıldığında
uz: _ tugmasini bosganingizda

source: forever _
ar: باستمرار _
ca: per sempre _
cs: opakuj stále _
de: fortlaufend _
el: Για πάντα επανάλαβε _
es: por siempre _
gl: por sempre _
ja: ずっと _
pt_br: para sempre _
ru: всегда _
tr: devamlı tekrarla _
uz: doimiy _

source: repeat _ _
ar: تكرار _ _
ca: repeteix _ vegades _
cs: opakuj _ _ krát
de: wiederhole _ mal _
el: επανάλαβε _ _
es: repite _ veces _
gl: repetir _ veces _
ja: 繰り返す _ 回 _
pt_br: repita _ vezes _
ru: повторить _ _
tr: tekrarla _ kere _
uz: takrorlash _ _

source: not _
ar: ليس _
ca: no _
cs: ne _
de: nicht _
el: αντίθετο _
es: no _
gl: non _
ja: _ でなければ
pt_br: não _
ru: нет _
tr: _ değil
uz: yo'q _

source: convert _ to _
ca: _ convertit en _
cs: převést _ do _
de: wandle _ in _ um
es: convertir _ a _
tr: bunu _ buna _ dönüştür

source: counter-clockwise
ar: عكس عقارب الساعه
ca: sentit antihorari
cs: proti směru hodinových ručiček
de: gegen Uhrzeigersinn
el: αριστερόστροφα
es: sentido antihorario
gl: sentido antihorario
ja: 逆時計回り
pt_br: sentido anti-horário
ru: против часовой стрелки
tr: saat yönüne ters
uz: soat yo'nalishi bo'yicha-hisoblash

source: ED1 Buttons
ca: Botons ED1
cs: EDI tlačítka
de: ED1 Knöpfe
el: ED1 Κομβία
es: Botones ED1
gl: Botóns ED1
ja: ED1ボタン
pt_br: Botões ED1
ru: ED1 Кнопки
tr: ED1 Butonları
uz: ED1 tugmachalari

source: set capacitive threshold to _
ar: ضبط عتبة سعوية إلى _
ca: fixa llindar capacitiu a _
cs: nastav limit kapacitního senzoru na _
de: setze kapazitiven Schwellenwert auf _
el: ορίσε όριο του χωρητικού σε_
es: fija umbral capacitivo en _
gl: poñer o limiar capacitivo a _
ja: 静電容量センサーを設定する 閾値 _
pt_br: fixe limite capacitivo em _
ru: задать порог ёмкостной чувствительности на _
tr: kapasitif eşik değerini _ yap
uz: threshold sig'imini o'rnatish _

source: Hummingbird Position Servo _ _ °
ca: Hummingbird Servo Posicional _ _ °
el: Hummingbird θέση Servo _ _ °
es: Hummingbird Servo Posicional _ _ °
ja: Hummingbird 位置サーボ _ _ °
pt_br: Hummingbird Servo Posicional _ _ °
ru: Сервопривод положения колибри _ _ °
tr: Hummingbird _ Servosunu _ ° yap
uz: Hummingbird joylashuvi Servo _ _ °

source: kbd;Shift
ca: Majúscules
cs: Shift
de: Umschalttaste
es: Mayúsculas

source: kbd;backspace
ca: retrocés
cs: backspace
de: Backspace
es: retroceso

source: square
ca: quadrat
cs: čtverec
de: Quadrat
es: cuadrado

source: small square
ca: quadrat petit
cs: malý čtverec
de: kleines Quadrat
es: cuadrado pequeño

source: fract _ > _
ca: frac _ > _
cs: zlomek _ > _
de: Bruch _ > _
es: frac _ > _
ru: дробь _ > _

source: lcm _ _
ca: mcm de _ i _
cs: NSN
de: kgV _ _
es: mcm de _ y _
ru: НОК _ _

source: Tone
ca: Tons
cs: Tóny
de: Klang
el: Τόνος
es: Tonos
gl: Tons
ja: 音
pt_br: Tons
ru: Тон
tr: Ton
uz: Ohang

source: delete file _
ca: elimina l'arxiu _
cs: smaž soubor
de: lösche Datei _
el: διάγραψε αρχείο _
es: borra archivo _
ja: ファイルを削除 _
pt_br: apague arquivo _
ru: удалить файл _
tr: _ dosyasını sil
uz: faylni o'chirish _

source: content length of request _
ca: mida del contingut de la sol·licitud _
cs: délka obsahu požadavku _
de: Länge des Inhalts der Anfrage _
es: tamaño del contenido de la petición _

source: ms unplot x _ y _
ca: ms apaga x _ y _
es: ms apaga x _ y _

source: ms display character _ with _
ca: ms mostra el caràcter _ amb _
es: ms muestra el carácter _ con _

source: ms touching ?
ca: ms tàctil ?
es: ms táctil ?

source: Imagina analog reading A1
ca: Imagina lectura analògica d'A1
es: Imagina lectura analógica A1

source: Imagina IR reading
ca: Imagina lectura IR
es: Imagina lectura IR

source: Imagina IR transmit device _ command _
ca: Imagina IR envia al dispositiu _ la comanda _
es: Imagina IR envía al dispositivo _ el valor _

source: off
ca: apaga
es: cierra

source: Home set NeoPixels _ _ _ _
ca: Home posa _ _ _ _ als Neopixels
es: Home pon _ _ _ _ en Neopixels

source: cutebotturn;left
ca: esquerra
es: izquierda

source: Reading project from board...
ca: Llegint projecte de la placa...
cs: Načítání projektu z mikropočítače...
de: Projekt wird vom Board gelesen...
el: Διαβάζει το έργο από την κάρτα …
es: Leyendo proyecto de la placa...
pt_br: Lendo projeto da placa...
ru: Загрузить проект с платы
tr: Proje karttan okunuyor...

source: Loading project...
ca: Carregant projecte...
cs: Nahrávání projektu...
de: Projekt wird geladen...
el: Φορτώνει το έργο…
es: Cargando proyecto...
pt_br: Carregando projeto...
ru: Проект загружается...
tr: Proje yükleniyor...

source: Stop
ar: توقف
ca: Atura
el: Σταμάτα
es: Detén
gl: Deter
ja: 停止
pt_br: Para
ru: Стоп
tr: Dur
uz: To'xtatish

source: virtual machine version
ar: نسخة الجهاز الظاهري
ca: versió de la màquina virtual
cs: verze virtuálního stroje
el: εικονική μηχανή έκδοση
es: versión de la máquina virtual
gl: versión da máquina virtual
ja: 仮想マシンのバージョン
pt_br: versão da máquina virtual
ru: версия виртуальной машины
tr: sanal makine sürümü
uz: virtual mashina versiyasi

source: hide implementation blocks
ca: amaga els blocs d'implementació
cs: skrýt implementační bloky
de: verstecke Implementationsblöcke
es: ocultar los bloques de implementación

source: do not show blocks and variables that are internal to libraries (i.e. those whose name begins with underscore)
ca: no mostris blocs i variables que siguin interns a les llibreries (aquells que el seu nom comença amb guió baix)
cs: skrýt interní bloky a proměnné knihoven (t.j. začínající znakem _ )
de: zeige keine Blöcke und Variablen aus internen Bibliotheken an (d. h. solche, deren Name mit einem Unterstrich beginnt)
es: ocultar los bloques y variables internos de las librerias (aquellos cuyo nombre comienza con guión bajo)

source: erase flash and update firmware on ESP board
ca: esborra i reparticiona el firmware en placa ESP
cs: vymazat flash mikropočítače a aktualizovat firmware ESP desky
de: lösche Flash und aktualisiere Firmware auf ESP-Board
es: borra y reparticiona el firmware en placa ESP
ja: ESPボード上のファームウェアを消去して更新
pt_br: apaga a flash e atualiza firmware na placa ESP
ru: стереть и переделить esp
tr: esp yi silme ve yeniden bölümleme
uz: esp tozalash va qaytarish
