Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: input
ca: casella
cs: vstup
de: Eingabe
el: είσοδος
es: casilla
gl: entrada
ja: 入力
pt_br: entrada
ru: ввод
tr: girdi
uz: kiritish

source: Restore block size to 100%
ca: Restaura mida dels blocs al 100%
cs: Obnovit velikost bloku (100%)
de: setze Blockgröße auf 100% zurück
es: Restaura el tamaño de los bloques al 100%
tr: Blokların boyutunu varsayılan seviyeye ayarla

source: Input
ar: المدخلات
ca: Entrada
cs: Vstup
de: Eingabe
el: Εισόδοι
es: Entrada
gl: Entrada
ja: 入力
pt_br: Entrada
ru: Ввод
tr: Girdi
uz: Kiritish

source: Library
ca: Llibreria
cs: Knihovna
de: Bibliothek
es: Librería
tr: Kütüphane

source: Palette
ca: Paleta
cs: Paleta
es: Paleta
tr: Palet

source: Turn a pin on or off ( (-o) or (o-) ).
ca: Activa o desactiva un pin digital ( (-o) o (o-) ).
cs: Nastaví logickou hodnotu na výstupním pinu ( (-o) or (o-) ).
de: Schaltet einen Pin ein oder aus ( (-o) or (o-) ).
es: Activa o desactiva un pin digital ( (-o) o (o-) ).
tr: Bir pimi açın veya kapatın ( (-o) veya (o-) ).

source: Close the serial port.
ca: Tanca el port sèrie.
cs: Zavření sériového portu.
de: Schließt den seriellen Anschluss.
es: Cierra el puerto serie.
tr: Seri bağlantı noktasını kapatın.

source: cat;Output
ar: المخرجات
ca: Sortida
cs: Výstup
de: Ausgabe
el: Εξόδοι
es: Salida
gl: Saída
ja: 出力
pt_br: Saída
ru: Вывод
tr: Çıktı
uz: Chiqarish

source: connected to IDE
ca: connectat a la IDE
cs: připojeno k IDE
de: mit IDE verbunden
es: conectado a la IDE
tr: IDE ye bağlı

source: set pin _ to _
ar: جعل المنفذ _ يساوي _
ca: posa el pin _ a _
cs: zapiš do pinu _ číslo _
de: setze Pin _ auf _
el: όρισε τον ακροδέκτη _ σε _
es: pon pin _ a _
gl: poñer o pin _ a _
ja: ピン設定 _ を _
pt_br: mude o valor do pino _ para _
ru: установить контакт _ на _
tr: pin _ ayarını _ yap
uz: pinni _ ga o'rnatish

source: if _ _ else _
ar: إذا _ _ آخر _
ca: si _ _ si no _
cs: když _ _ jinak _
de: falls _ _ sonst _
el: αν _ _ διαφορετικά _
es: si _ _ si no _
gl: se _ _ se non _
ja: もし _ _ でなければ _
pt_br: se _ _ então _
ru: если _ _ иначе _
tr: eğer _ yap _ değilse _
uz: agar _ _ yana boshqa _

source: broadcast _
ar: نشر _
ca: envia _
cs: rozešli _
de: sende _
el: μετάδωσε _
es: envía _
gl: difundir _
ja: 広く送信する _
pt_br: envie _
ru: трансляция _
tr: _ gönder

source: comment _
ar: تعليق _
ca: comentari _
cs: kommentář _
de: Kommentar _
el: σχόλιο _
es: comentario _
gl: comentario _
ja: コメント _
pt_br: comentário _
ru: комментарий _
tr: yorum _
uz: izoh _

source: for _ in _ _
ar: ل _ في _ _
ca: per cada _ en _ _
cs: pro _ z _ _
de: für _ in _ _
el: για _ μέσα σε _ _
es: por cada _ en _ _
gl: por cada _ en _ _
ja: 繰り返し 変数 _ 以内 _ _
pt_br: para cada _ em _ _
ru: для _ в _ _
tr: her _ için _ _ kapsamında
uz: uchun _ da _ _

source: default
ca: defecte
de: Standardwert
es: defecto
tr: var sayılan

source: min _ _
ca: mínim entre _ i _
es: mínimo entre _ y _
ru: мин _ _
tr: en küçüğü _ _

source: rescale _ from ( _ , _ ) to ( _ , _ )
ca: reescala _ de ( _ , _ ) a ( _ , _ )
cs: mapuj _ z rozsahu ( _ , _ ) do ( _ , _ )
de: verteile _ von ( _ , _ ) auf ( _ , _ )
es: reescalar _ de ( _ , _ ) a ( _ , _ )
ru: изменить масштаб _ ( _ , _ ) до ( _ , _ )
tr: yeniden ölçeklendir _ bundan ( _ , _ ) buna ( _ , _ )

source: Add a variable
ar: إضافة متغير
ca: Crea una variable
cs: Přidej proměnnou
de: Variable hinzufügen
el: Πρόσθεσε μια μεταβλητή
es: Crea una variable
gl: Crear unha variábel
ja: 変数追加
pt_br: Criar uma variável
ru: Добавить переменную
tr: Değişken ekle
uz: O'zgaruvchini qo'shing

source: Delete a variable
ar: حذف متغير
ca: Elimina una variable
cs: Smaž proměnnou
de: Variable löschen
el: Διάγραψε μια μεταβλητή
es: Elimina una variable
gl: Eliminar unha variábel
ja: 変数削除
pt_br: Apagar uma variável
ru: Удалить переменную
tr: Değişken sil
uz: O'zgaruvchini o'chirish

source: New variable name?
ca: Nom de la variable?
cs: JMéno nové proměnné?
de: Neuer Variablenname?
el: Όνομα νέας μεταβλητής?
es: ¿Nombre de la variable?
gl: Novo nome da variábel?
ja: 新しい変数の名前は?：
pt_br: Nome da variável?
ru: Новое название переменной?
tr: Yeni değişkenin adı?
uz: Yangi o'zgaruvchi nom?

source: set _ to _
ar: إجعل _ بقيمة _
ca: assigna _ a _
cs: nastav _ na _
de: setze _ auf _
el: όρισε _ σε _
es: asigna _ a _
gl: asignar _ a _
ja: 設定 _ に _ を
pt_br: mude _ para _
ru: задать _ до _
tr: _ değişkenini _ yap
uz: _ ga _ o'rnatish

source: change _ by _
ar: غير _ ب _
ca: augmenta _ en _
cs: změň _ o _
de: ändere _ um _
el: άλλαξε _ ανά _
es: aumenta _ en _
gl: aumentar _ en _
ja: 変更 _ を _ に
pt_br: altere _ em _
ru: изменить _ на _
tr: _ değişkenini _ değiştir
uz: _ tomonidan _ o'zgartirish

source: initialize local _ to _
ca: inicialitza variable local _ a _
cs: nastav lokální proměnnou _ na _
de: initialisiere lokale _ mit _
el: αρχική τιμή τοπικής μεταβλητής _ σε _
es: inicializa variable local _ a _
pt_br: inicialize variável local _ em _
ru: инициализировать локальный _ для _
tr: _ yerel değişkeni _ yap

source: cat
ca: gat
cs: kočka
de: Katze
es: gato
ru: кошка
tr: kedi

source: fish
ca: peix
cs: ryba
de: Fisch
es: pez
ru: рыба
tr: balık

source: free memory
ca: memòria disponible
cs: volná paměť
de: freier Speicher
el: ελευθέρωσε μνήμη
es: memoria libre
ja: メモリ解放
pt_br: memória livre
ru: свободная память
tr: boş bellek
uz: bo'sh xotira

source: split _ by _
ca: divideix _ per _
cs: rozděl _ podle _
de: trenne _ nach _
es: divide _ por _
ru: разбить _ по _
tr: _ dizisini her _ ayır

source: cat;Comm
ca: Comunicacions
cs: Komunikace
de: Kommunikation
el: Επικοινωνία
es: Comunicaciones
gl: Comunicacións
ja: 通信
pt_br: Comunicações
ru: Связь
tr: İletişim
uz: Aloqa

source: i2c set device _ register _ to _
ar: ضبط جهاز _ سجل _ إلى _ i2c
ca: escriu al dispositiu I2C _ el registre _ amb _
cs: zapiš do I2C zařízení _ do registru _ hodnotu _
de: i2c setze Gerät _ Register _ auf _
el: i2c όρισε στην συσκευή _ καταχωρητή _ σε _
es: escribe al dispositivo i2c _ el registro _ con _
gl: i2c escribir no dispositivo _ o rexistro _ con _
ja: i2c デバイス設定 _ アドレス _ まで _
pt_br: escreva no dispositivo i2c _ o registrador _ com _
ru: i2c задать устройство _ зарегистрировать _ на _
tr: i2c yaz modül _ yazmaç _ değer _
uz: i2c qurilmasini _ ga _ ro'yxatiga olish

source: aByteArray
ca: llistaDeBytes
cs: pole bajtů
de: ByteArray
es: listaDeBytes
tr: baytDizisi

source: serial open _ baud
ca: obre port sèrie a _ bauds
cs: otevři seriový port pro rychlost _
de: serial öffne mit _ Baud
es: abre puerto serie a _ baudios
tr: seri portu başlat _ baud

source: anIntegerStringListOrByteArray
ca: unEnterTextLlistaOllistaDeBytes
cs: číslo/řetězec/pole bajtů
de: GanzzahlZeichenfolgeListeOderByteArray
es: unEnteroTextoListaOlistaDeBytes
tr: tamsayıDizgiListeVeyaBaytdizisi

source: send NeoPixel rgb _
ca: envia RGB _ al NeoPíxel
cs: nastav NeoPixel RGB _
de: sende NeoPixel RGB _
el: στείλε στο NeoPixel κπμ _
es: envía RGB _ al NeoPíxel
gl: enviar RGB _ ao NeoPixel
ja: 送信 NeoPixel RGB _
pt_br: envie RGB _ ao NeoPixel
ru: послать NeoPixel rgb _
tr: NeoPixel rgb _ gönder
uz: NeoPixel rgb ni yuborish

source: my IP address
ar: عنوان IP الخاص بي
ca: la meva adreça IP
cs: moje IP adresa
de: meine IP-Adresse
el: η IP διεύθυνση μου
es: mi dirección IP
gl: o meu enderezo IP
ja: 私のIPアドレス
pt_br: meu endereço IP
ru: мой IP-адрес
tr: IP adresim
uz: mening IP manzilim

source: radio send number _
ar: أرسل عبر الراديو رقم _
ca: envia nombre _ per ràdio
cs: odešli rádiem číslo _
de: Radio sende Zahl _
el: ράδιο στείλε αριθμό _
es: envía número _ por radio
gl: enviar número _ por radio
ja: 送信された数字 _
pt_br: envie número _ por rádio
ru: отправка номера по радио _
tr: radyo sayı yolla _
uz: radio raqamini yuborish _

source: light
ca: llum
cs: světlo
de: Licht
es: luz
tr: ışık

source: rotate NeoPixels by _
ca: rota NeoPíxels en _
cs: rotuj NeoPixel o _
de: rotiere NeoPixel um _
el: στρίψε τα NeoPixels κατά _
es: rota NeoPíxeles en _
gl: rotar NeoPixeis en _
ja: ネオピクセルを回転 角度 _
pt_br: gire NeoPixels em _
ru: повернуть NeoPixels на _
tr: NeoPixelleri _ döndür
uz: NeoPixels ni _ bilan almashtirish

source: clap count
ca: recompte d'aplaudiments
cs: počet tesknutí
de: Anzahl des Händeklatschens
es: recuento de palmadas
ru: количество хлопков

source: microphone
ca: micròfon
cs: mikrofon
de: Mikrofon
es: micrófono
ru: микрофон

source: estimate clap threshold
ca: detecta el llindar d'aplaudiment
cs: odhadni práh tlesknutí
de: Applausstärke
es: detecta el umbral de palmada
ru: оценить порог хлопка

source: Hummingbird Tri-LED _ R _ % G _ % B _ %
ca: Hummingbird Tri-LED _ Vermell _ % Verd _ % Blau _ %
de: Hummingbird Dreifarben-LED _ R _ % G _ % B _ %
es: Hummingbird LED tricolor _ R _ % G _ % B _ %
gl: Hummingbird Tri-LED _ Vermello _ % Verde _ % Azul _ %
ja: Hummingbird 三色LED _ R _ % G _ % B _ %
pt_br: Hummingbird LED tricolor _ R _ % G _ % B _ %
tr: Hummingbird 3renkli-LED _ R _ % G _ % B _ %

source: Finch Wheels L _ % R _ %
ca: posa les rodes a velocitat E _ % D _ %
de: Finch Räder L _ % R _ %
el: Finch Τροχοί Α _ % Δ _ %
es: pon las ruedas a velocidad I _ % D _ %
ja: Finch ホイール 左 _ % 右 _ %
pt_br: rodas do Finch à velocidade E _ % D _ %
ru: Колеса Finch Л _ % П _ %
tr: Finch Tekerlekler Sol _ % Sağ _ %

source: Finch _ Light
ca: llum _
de: Finch _ Licht
el: Finch _ Φως
es: luz _
ja: Finch _ 光量
pt_br: luz _ do Finch
ru: Яркость _ Finch
tr: Finch _ Işık

source: hold key _
ca: mantingues la tecla _ premuda
cs: podrž klávesu _
de: halte Taste _
es: mantén la tecla _ pulsada

source: kbd;Control
ar: مراقبة
ca: Control
cs: Ctrl
de: Steuerung
el: Έλεγχος Ροής
es: Control
gl: Control
ja: 操作
pt_br: Controle
ru: Контроль
tr: Kontrol
uz: Nazorat

source: kbd;enter
ca: intro
cs: enter
de: Enter
es: intro

source: kbd;AltGr
ca: AltGr
cs: AltGr
es: AltGr

source: kbd;home
ca: inici
cs: home
de: gehe zum Ursprung
el: Σπίτι
es: inicio
ja: ホーム
pt_br: volte para casa
ru: домашняя страница
tr: başlangıç
uz: uy

source: mouse;right
ca: dret
cs: pravé
es: derecho

source: mouse;both
ca: ambdós
cs: obě
es: ambos

source: aListOrString
ca: unaLlistaOText
cs: seznam/řetězec
de: ListeOderZeichenfolge
es: unaListaOTexto

source: a few
ca: pocs
cs: několik
es: unos pocos

source: confused
ca: confós
cs: zmatený
de: verwirrt
es: confuso

source: surprised
ca: sorprès
cs: překvapený
de: überrascht
es: sorprendido

source: t-shirt
ca: samarreta
cs: triko
es: camiseta

source: skull
ca: calavera
cs: lebka
de: Totenkopf
es: calavera

source: cursor location
ca: posició del cursor
cs: OLED pozice kurzoru
es: posición del cursor
ru: позиция курсора

source: enable TFT _
ar: مكن TFT _
ca: activa TFT _
cs: aktivuj TFT _
de: aktiviere TFT
el: ενεργοποίησε TFT _
es: activa TFT _
gl: activar TFT _
ja: TFT 有効化
pt_br: ative TFT _
ru: включить TFT _
tr: TFT yi etkinleştir _
uz: yoqish TFT _

source: draw rounded rectangle on TFT at x _ y _ width _ height _ radius _ color _
ca: dibuixa rectangle arrodonit a x _ y _ amplada _ alçada _ radi _ color _
cs: nakresli na TFT zaoblený obdélník na x _ y _ šířka _ výška _ poloměr _ barva _
de: zeichne abgerundetes Rechteck auf TFT bei x _ y _ Breite _ Höhe _ Radius _ Farbe _
el: σχεδίασε στρογγυλεμένο τετράγωνο στο TFT στο x _ y _ πλάτος _ ύψος _ ακτίνα _ χρώμα _
es: dibuja rectángulo redondeado en x _ y _ ancho _ alto _ radio _ color _
ja: TFT上に丸角四角形を描く 位置 x _ y _ 幅 _ 高さ _ 半径 _ 色 _
pt_br: desenhe retângulo arredondado em x _ y _ largura _ altura _ raio _ com cor _
ru: нарисjdfnm прямоугольник с закругленными углами на TFT при x _ y _ ширина _ высота _ радиус _ цвет _
tr: TFT yuvarlatılmış dikdörtgen başla x _ y _ genişlik _ yükseklik _ çap _ renk _
uz: Yumaloq to’rtburchakni TFT ga x_ y_ kenglik _ balandlik _ radius _ rangda chizing

source: write _ on TFT at x _ y _ color _
ca: escriu _ a x _ y _ color _
cs: na TFT napiš _ od x _ y _ barva _
de: Schreibe _ auf TFT bei x _ y _ Farbe _
el: γράψε _ στο TFT στο x _ y _ χρώμα _
es: escribe _ en x _ y _ color _
ja: TFT上に描く _ 位置 x _ y _ 色 _
pt_br: escreva _ em x _ y _ com cor _
ru: записать _ на TFT в х _ у _ цвет _
tr: TFT _ yaz konum x _ y _ renk _
uz: TFT ustiga _ x _ y rangida _ yozish

source: integer part of fraction _
ca: part entera de fracció _
cs: celá část zlomku _
de: ganzer Teil des Bruchs _
es: parte entera de fracción _
ru: целая часть дроби _

source: Ringtone
ca: Politons
cs: Vyzvánění
de: Klingelton
es: Politonos
ru: Рингтон

source: High Tom
ca: Tom-tom agut
es: Tom-tom agudo

source: bass
ca: baix
es: bajo

source: volume
ca: volum
es: volumen

source: variation _
ca: variació _
es: variación _

source: append bytes _ to file _
ca: afegeix bytes _ a l'arxiu _
cs: přidej bajty _ do souboru _
de: füge Bytes _ in Datei _ an
el: πρόσθεσε bytes _ στο αρχείο _
es: añade bytes _ al archivo _
ja: バイト列を追加 _ ファイル _
pt_br: adicione bytes _ no arquivo _
ru: добавить байты _ в файл _
tr: _ baytları _ dosyasına ekle
uz: _ fayliga baytni qo'shish

source: lowercase _
ca: _ en minúscules
cs: malá písmena _
de: _ in Kleinbuchstaben
es: _ en minúscula
ru: в нижний регистр _

source: start step counter
ca: comença a comptar passes
cs: Zahaj počítání kroků
de: Starte Schrittzähler
el: ξεκίνα μετρητή βημάτων
es: empieza a contar pasos
ja: ステップカウンターを始める
pt_br: comece a contar passos
ru: запуск счестик шагомера
tr: adım sayıcıyı başlat
uz: qadamlar sonini hisoblagich

source: button _ long pressed
ca: toc llarg al botó _
cs: dlouze stisknuto tlačítko _
de: Knopf _ lange gedrückt
el: κουμπί _ μακρύ πάτημα
es: pulsación larga en botón _
ja: ボタン _ 長く押す
pt_br: clique longo no botão _
ru: длинное нажатие кнопки
tr: buton _ uzun basıldı
uz: _ tugmasi uzoq bosildi

source: color _ name
ca: nom del color _
cs: barva _ jménu
de: Farbe _ Name
el: χρώμα _ όνομα
es: nombre del color _
ja: 色 _ 名前
pt_br: nome da cor _
ru: цвет _ название
tr: _ renginin adı
uz: rang _ nomi

source: read only _
ca: només lectura _
cs: pouze pro čtení
de: schreibgeschützt
el: διάβασε μόνο _
es: sólo lectura _
ja: 読み出し専用 _
pt_br: somente leitura _
ru: только для чтения _
tr: salt okunur _
uz: faqat o'qish _

source: events JSON
ca: JSON dels esdeveniments
cs: události JSON
de: Ereignisse JSON
el: γεγονότα JSON
es: JSON de los eventos
ja: イベント JSON
pt_br: JSON dos eventos
ru: события JSON
tr: olaylar JSON
uz: voqealar JSON

source: sb LEDs off
es: sb apaga los LED

source: degrees
ca: graus
es: grados

source: ms temperature ºC
ca: ms temperatura ºC
es: ms temperatura ºC

source: TdR rotation
ca: TdR rotació
es: TdR rotación

source: _ steps
ca: _ passes
es: _ pasos

source: 3dBot obstacle < _ cm?
es: 3dBot obstaculo < _ cm?

source: Farm fan _
ca: Farm ventilador _
es: Farm ventilador _

source: Home read RFID card
ca: Home llegeix la targeta RFID
es: Home lee la targeta RFID

source: Cutebot set NeoPixel _ to _
ca: Posa el NeoPíxel _ del Cutebot a _
es: pon el NeoPíxel _ del Cutebot a _

source: reset the yaw
ca: reinicialitza rotació
es: reinicializa rotación

source: cutebot;backward
ca: enrera
de: rückwärts
es: atrás

source: set block size...
ca: mida dels blocs...
cs: nastavit velikost bloku...
de: setze Blockgröße auf ...
es: tamaño de los bloques...

source: revert
ca: reverteix
cs: vrátit
de: zurücknehmen
es: revierte
tr: geri al

source: delete library
ca: elimina aquesta llibreria
cs: smaž knihovnu
de: lösche Bibliothek
es: elimina esta librería
tr: kütüphaneyi sil

source: uploaded
ca: carregat
cs: nahráno
de: hochgeladen
es: subido
tr: yüklenmiş

source: collapse
ar: إخفاء
ca: replega
cs: sbalit
de: einklappen
el: κατάρρευσε
es: pliega
gl: contraer
ja: 縮小
pt_br: colapsar
ru: скрыть
tr: daralt
uz: qulash

source: cutebotside;right
ca: dret
es: derecha

source: number/string
ca: nombre/text
cs: číslo/řetězec
de: Zahl/Zeichenfolge
el: αριθμός/συμβολοσειρά
es: número/texto
gl: número/texto
ja: 数字/文字列
pt_br: número/texto
ru: число/строка
tr: sayı/dizgi
uz: raqam / satr

source: cutebotturn;right
ca: dret
es: derecha

source: folder;AI
ca: Intel·ligència artificial
cs: Umělá Inteligence (AI)
es: Inteligencia Artificial

source: folder;Sound
ca: So
cs: Zvuk
es: Sonido
ru: Звук

source: rename...
ar: إعادة تسمية ...
ca: reanomena...
cs: přejmenovat...
de: umbenennen...
el: μετονομασία
es: renombra...
gl: renomear...
ja: 名前を変更...
pt_br: renomear...
ru: переименовать...
tr: adını değiştir...
uz: qayta nomlash ...

source: (press ESC to cancel)
ca: (prem ESC per cancel·lar)
cs: Stiskněte ESC pro přerušení)
de: (Drücke ESC um abzubrechen)
es: (pulsa ESC para cancelar)
ja: (ESCを押して取消)
pt_br: (pressione ESC para cancelar)
ru: (нажмите ESC для отмены)
tr: (iptal etmek için ESC tuşuna basın)
uz: (bekor qilish uchun ESC tugmasini bosing)

source: clean up
ar: تنظيف
ca: neteja
cs: vyčistit
de: aufräumen
el: καθαρισμός
es: limpia
gl: limpeza
ja: クリアする
pt_br: limpa
ru: очистить
tr: temizle
uz: tozalamoq

source: Okay
ar: وافق
ca: D'acord
es: De acuerdo
gl: Aceptar
ja: 確定
pt_br: De acordo
ru: ОК
tr: Tamam
uz: Ok

source: Boolean constant ( (-o) or (o-) ).
ca: Constant booleana ( (-o) o (o-) ).
cs: Logická hodnota ( (-o) or (o-) ).
de: Wahrheitswert ( (-o) oder (o-) ).
es: Constante booleana ( (-o) o (o-) ).
tr: Boole sabiti ( (-o) veya (o-) ).

source: wake
ca: desperta't
es: despierta

source: copy
ca: copia
cs: kopírovat
de: kopiere
es: copia
tr: kopyala

source: Scripts Pane
ca: Àrea de programes
cs: Panel skriptů
de: Skriptbereich
es: Área de programas
tr: Betik Bölümü

source: Open
ar: فتح
ca: Obre
cs: Otevřít
de: öffnen
el: Άνοιξε
es: Abre
gl: Abrir
ja: 開く
pt_br: Abrir
ru: Открыть
tr: Aç
uz: Ochiq

source: cutebotside;left
ca: esquerra
es: izquierda

source: Invalid URL
ca: URL invàlida
cs: Neplatné URL
de: Ungültige URL
el: ‘Aκυρο URL
es: URL inválida
ja: 間違ったURL
pt_br: URL inválido
ru: Неверная ссылка
tr: geçersiz URL
uz: Noto‘g‘ri URL

source: Boolean Input
ca: Casella booleana
cs: Zadání logické hodnoty
de: Eingabe Wahrheitswert
es: Casilla booleana
tr: Boole Girdisi

source: New library name?
ca: Nom de la nova llibreria?
cs: Jméno nové knihovny?
de: Name der neuen Bibliothek?
es: ¿Nombre de la nueva librería?
tr: Yeni kütüphane adı?

source: paste
ca: enganxa
cs: vložit
de: füge ein
es: pega
tr: yapıştır

source: enable or disable BLE
ca: activa o desactiva BLE
cs: povolit/zakázat BLE
de: aktiviere oder deaktivere BLE
es: activa o desactiva BLE

source: Board type:
ar: نوع اللوحة:
ca: Tipus de placa:
cs: Typ mikropočítače:
de: Board-Typ:
el: Τύπος κάρτας:
es: Tipo de placa:
gl: Tipo de placa:
ja: ボードタイプ:
pt_br: Tipo de placa:
ru: Тип платы:
tr: Kart tipi:
uz: Kengash turi:

source: set RGB LED _ to red _ green _ blue _
ca: posa el LED RGB _ a vermell _ verd _ blau _
es: pon el LED RGB a rojo _ verde _ azul _

source: Plug in the board.
ca: Connecta la placa.
cs: Připojte mikropočítač.
de: Schließe das Board an.
el: Σύνδεσε την κάρτα
es: Conecta la placa.
pt_br: Conecta a placa.
ru: Подключить плату
tr: Kartı bağla.

source: Cloud
ca: Núvol
el: Νέφος
es: Nube
ja: クラウド
pt_br: Nuvem
ru: Облако
tr: Bulut

source: folder;Other
ca: Altres
cs: Jiné
es: Otro
ru: Прочее

source: duration _ ms
ca: durada _ ms
es: duración _ ms

source: delete selection
ca: elimina selecció
cs: smazat vybrané
de: lösche Auswahl
es: elimina selección

source: paste script
ar: لصق البرنامج النصي
ca: enganxa el programa
cs: načíst skript ze schránky
de: füge Skript ein
el: Επικόλησε κείμενο
es: pega el programa
gl: pegar o programa
ja: スクリプトを貼り付ける
pt_br: cola o programa
ru: вставить скрипт
tr: betik yapıştır
uz: skriptni joylashtirish

source: cutebotlight;left
ca: esquerra
es: izquierdo

source: Save
ar: حفظ
ca: Desa
cs: Uložit
de: speichern
el: Αποθήκευσε
es: Guarda
gl: Gardar
ja: 保存
pt_br: Salvar
ru: Сохранить
tr: Kaydet
uz: Saqlash

source: Reset the timer.
ca: Inicialitza el temporitzador.
cs: Vynulování časovače.
de: Setzt den Zeitgeber zurück.
es: Reinicializa el temporizador.
tr: Zamanlayıcıyı sıfırlayın.

source: Use board type
ca: La placa connectada és de tipus
cs: Použít mikropočítač typu
de: Verwende Board-Typ
el: Χρησιμοποίηση κάρτας τύπου
es: ¿La placa conectada es de tipo
ja: 使用するボードタイプ
pt_br: Define o tipo de placa
ru: Использовать тип платы
tr: kart tipini kullan
uz: Plata turi

source: show compiled bytes
ar: عرض بايت المترجمة
ca: mostra els bytes compilats
cs: ukázat kompilované bajty
de: zeige Byte-Code
es: muestra los bytes compilados
gl: amosar os bytes compilados
ja: コンパイルされたバイトを表示
pt_br: mostra os bytes compilados
ru: Показать компилированные байты
tr: derlenmiş baytları göster
uz: olingan baytlarni ko'rsatish

source: open Boardie
ca: connecta't al Boardie
cs: spustit Boardie
de: öffne Boardie
es: conéctate a Boardie

source: copy all scripts to clipboard as URL
ca: copia tots els programes al porta-retalls com a URL
cs: zkopírovat všechny skripty do schránky jako URL
de: kopiere alle Skripte als URL in die Zwischenablage
es: copia todos los programas al portapapeles como URL

source: unicode _ of _
ca: unicode _ de _
cs: unicode _ pro _
de: Unicode _ von _
el: unicode _ του _
es: unicode _ de _
ja: Unicode _ の _
pt_br: unicode _ de _
ru: юникод _ из
tr: unicode harf# _ dizginin: _
uz: _unikodi

source: tilt y
ar: الميل ص
ca: inclinació y
cs: náklon y
de: Neigung y
el: κλίση y
es: inclinación y
gl: inclinación y
ja: 仰角 y
pt_br: inclinação y
ru: наклон y
tr: eğilim y
uz: burilish y

source: to _
ca: fins a _
cs: do _
de: bis _
el: προς _
es: hasta _
ja: に _
pt_br: até _
ru: в _
tr: bitir _
uz: uchun _

source: i2c device _ read list _
ca: llegeix del dispositiu I2C _ a llista _
cs: z I2C zařízení _ přečti seznam _
de: i2c Gerät _ lies Liste _
el: i2c συσκευή _ διάβασε λίστα _
es: lee el dispositivo i2c _ a la lista
ja: i2c デバイス _ リスト読み込み _
pt_br: leia o dispositivo i2c _ para a lista _
ru: i2c устройство _ список чтения _
tr: i2c aygıt _ liste oku _
uz: i2c qurilmasi _ o'qish ro'yxati _

source: i2c device _ write list _
ca: escriu al dispositiu I2C _ el contingut de la llista _
cs: do I2C zařízení _ zapiš seznam _
de: i2c Gerät _ schreibe Liste _
el: i2c συσκευή _ γράψε λίστα _
es: escribe al dispositivo i2c _ el contenido de la lista _
ja: i2c デバイス _ リスト書き込み _
pt_br: escreva no dispositivo i2c _ o conteúdo da lista _
ru: i2c device _ список записи _
tr: i2c aygıt _ liste yaz _
uz: i2c qurilmasi _ yozish ro'yxati _

source: soft serial write byte _ pin _ baud _
ca: escriu byte _ al port sèrie virtual al pin _ a _ bauds
cs: do SW seriového portu zapiš byte _ na pin _ rychlost _
de: soft serial schreibe Byte _ Pin _ Baud _
es: escribe byte _ al puerto serie virtual en pin _ a _ baudios
tr: soft seri yaz bayt _ pin _ baud _

source: radio last string
ar: راديو أخر سلسلة
ca: últim text rebut per ràdio
cs: poslední rádiem přijaý text
de: Radio letzte Zeichenfolge
el: ράδιο τελευταία σειρά χαρακτήρων
es: último texto recibido por radio
gl: último texto recibido por radio
ja: 送信された最新の文字列
pt_br: último texto recebido por rádio
ru: последняя строка радио
tr: radyo son dizgi
uz: radio oxirgi satr

source: clear NeoPixels
ca: apaga NeoPíxels
cs: zhasni NeoPixel
de: lösche alle NeoPixel
el: καθάρισε NeoPixels
es: apaga NeoPíxeles
gl: apagar NeoPixeis
ja: ネオピクセルをクリア
pt_br: apague NeoPixels
ru: очистить NeoPixels
tr: NeoPixelleri söndür
uz: NeoPixelsni tozalash

source: radio set power (0-7) _
ar: راديو ضبط طاقة (0-7) _
ca: fixa potència de ràdio a (0-7) _
cs: nastav výkon rádia (0-7) _
de: Radio setze Stärke _ (0-7)
el: ράδιο όρισε ισχύ σε (0-7) _
es: fija potencia de radio a (0-7) _
gl: pon a potencia da radio a (0-7) _
ja: 送信された設定強度 (0-7) _
pt_br: fixe potência de rádio a (0-7) _
ru: задать мощность радио (0-7) _
tr: radyo güç ayarla (0-7) _
uz: radio rostlagich kuchi (0-7) _
