Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: If your micro:bit shows a sad face, save the firmware.hex file to your disk then drop it onto the MICROBIT drive.
ca: Si la teva micro:bit mostra una cara trista, desa l'arxiu firmware.hex al teu ordinador, i després arrossega'l a la unitat MICROBIT que trobaràs a l'explorador d'arxius.
cs: Pokud micro:bit zobrazí ikonu "sad face", uložte soubor firmware.hex na disk a potom jej přeneste na disk MICROBITu.
de: Wenn dein Micro:bit ein trauriges Gesicht zeigt, speichere die Datei Firmware.hex auf deine Festplatte und lege sie dann auf dem MICROBIT-Laufwerk ab.
es: Si tu micro:bit muestra una cara triste, guarda el fichero firmware.hex en tu ordenador, y después arrástralo a la unidad MICROBIT que encontrarás en el explorador de ficheros.
tr: Micro:bit'iniz üzgün bir yüz gösteriyorsa firmware.hex dosyasını diskinize kaydedin ve ardından MICROBIT sürücüsüne atın.

source: Installing firmware...
ca: Instal·lant firmware...
cs: Instaluji firmware...
de: Installiere Firmware...
es: Instalando firmware...
tr: Firmware kuruluyor...

source: duplicate
ar: كرر
ca: duplica
cs: duplikovat
de: duplizieren
el: αντίγραψε
es: duplica
gl: duplicar
ja: 複製
pt_br: duplica
ru: дублировать
tr: çoğalt
uz: nusxa ko'chirish

source: copy these blocks to the clipboard
ca: copia aquests blocs al porta-retalls
cs: kopírovat vybrané bloky do schránky
de: kopiere diese Blöcke in die Zwischenablage
el: αντίγραψε αυτά τα μπλοκ στο πρόχειρο
es: copia estos bloques al portapapeles
gl: copia estes bloques no portapapeis
ja: これらのブロップをクリップボードにコピー
pt_br: copia estes blocos para a área de transferência
ru: скопировать эти блоки в буфер обмена
tr: bu blokları panoya kopyala
uz: ushbu bloklarni clipboardga nusxalash

source: duplicate all
ca: duplica fins a baix
cs: duplikovat vše
de: dupliziere alles
el: αντιγραφή όλων
es: duplica hasta abajo
gl: duplicar ata abaixo
ja: すべてを複製
pt_br: duplica tudo
ru: дублировать все
tr: tümünü çoğalt
uz: hammasini nusxalash

source: pull out this block
ca: agafa aquest bloc
cs: vytáhnout blok
de: ziehe diesen Block heraus
el: τράβηξε έξω αυτό το μπλοκ
es: agarra este bloque
gl: sacar este bloque
ja: このブロックを折りたたむ
pt_br: retira este bloco
tr: bu bloğu ayırt
uz: bu blokni tortib oling

source: save a picture of this block definition as a PNG file
ca: desa una imatge de la definició d'aquest bloc en format PNG
cs: uložit obrázek definice bloku jako PNG
de: speichere Bild dieser Blockdefinition als PNG-Datei
el: αποθήκευσε τον ορισμό αυτού του μπλοκ σε φωτογραφία σαν PNG αρχείο
es: guarda una imagen de la definición de este bloque en formato PNG
gl: gardar unha imaxe da definición deste bloque en formato PNG
ja: このブロック定義の画面をPNGファイルで保存
pt_br: guarda uma imagem da definição deste bloco em formato PNG
ru: сохранить изображение этого определения блока в виде файла PNG
tr: bu blok tanımının resmini PNG dosyası olarak kaydet
uz: ushbu blok ta'rifining rasmini PNG fayli sifatida saqlang

source: Language
ca: Idioma
cs: Jazyk
de: Sprache
el: Γλώσσα
es: Idioma
gl: Idioma
ja: 言語
pt_br: Idioma
ru: Язык
tr: Dil
uz: Til

source: Custom...
ca: Arxiu...
cs: Uživatelský...
de: Benutzerdefiniert...
el: Προσαρμοσμένο…
es: Archivo...
gl: Personalizado...
ja: カスタム...
pt_br: Personalizado...
ru: Пользовательские ...
tr: Özel...
uz: Boshqa ...

source: Obsolete
ar: قديم
ca: Obsolet
cs: Zastaralé
de: obsolet
el: Ξεπερασμένο
es: Obsoleto
gl: Obsoleto
ja: 廃止
pt_br: Obsoleto
ru: Устаревший
tr: Geçersiz
uz: iste'moldan chiqqan

source: Cancel
ar: إلغاء
ca: Cancel·la
cs: Zrušit
de: Abbrechen
el: Ακύρωση
es: Cancela
gl: Cancelar
ja: 取消
pt_br: Cancelar
ru: Отмена
tr: İptal
uz: bekor qilish

source: Confirm
ar: أكد
ca: Confirmació
cs: Potvrdit
de: Bestätigen
el: Επιβεβαίωση
es: Confirmación
gl: Confirmar
ja: 確認
pt_br: Confirmação
ru: Подтвердить
tr: Onayla
uz: Tasdiqlash

source: folder;Sensing
ca: Sensors
cs: Senzory
es: Sensores

source: show all block definitions
ca: mostra les definicions de tots els blocs
cs: zobraz všechny definice bloků
de: zeige alle Blockdefinitionen
es: muestra las definiciones de todos los bloques
tr: bütün blok tanımlamalarını göster

source: Examples
ca: Exemples
cs: Příklady
de: Beispiele
el: Παραδείγματα
es: Ejemplos
ja: 例
pt_br: Exemplos
ru: Примеры
tr: Örnekler
uz: Namunalar

source: Depends:
ca: Depèn de:
cs: Závislost:
de: Abhängig von:
el: Εξαρτάται:
es: Depende de:
ja: 依存:
pt_br: Depende de:
ru: Зависит:
tr: Bağlı:
uz: Bog‘liq:

source: %1 seconds remaining
ca: Falten %1 segons
cs: %1 zbývající vteřiny
de: %1 Sekunden verbleiben
es: Faltan %1 segundos

source: [l] right arrow to show optional inputs, left arrow to hide.
ca: [l] sobre la fletxa que apunta a la dreta per mostrar caselles opcionals, i sobre la que apunta a l'esquerra per amagar-les.
cs: [l] šipka doprava pro zobrazení volitelných parametrů, šipka doleva pro skrytí.
de: [l] Rechtspfeil zur Anzeige optionaler Eingaben, Linkspfeil zum Verstecken.
es: [l] sobre la flecha que apunta hacia la derecha para mostrar casillas adicionales, y sobre la que apunta hacia la izquierda para ocultar-las.
tr: [l] isteğe bağlı girişleri göstermek için sağ ok, gizlemek için sol ok.

source: Pane Divider
ca: Divisor d'àrea
cs: Oddělovač panelů
de: Bereichsteiler
es: Divisor de área
tr: Bölüm ayırıcısı

source: Report the electrical logic level on a digital pin ( (-o) or (o-) ).
ca: Reporta el nivell lògic elèctric en un pin digital ( (-o) o (o-) ).
cs: Vrátí logickou hodnotu digitálního vstupu.
de: Gibt den Logikpegel eines digitalen Pins zurück ( (-o) or (o-) ).
es: Reporta el nivel lógico eléctrico en un pin digital ( (-o) o (o-) ).
tr: bir dijital pimdeki elektriksel mantık seviyesini ( (-o) veya (o-) ) bildirin.

source: Repeat the enclosed blocks indefinitely.
ca: Repeteix l'execució dels blocs que conté, contínuament.
cs: Nekonečné opakování vnořených bloků.
de: Wiederholt die umschlossenen Blöcke dauerhaft.
es: Repite la ejecución de los bloques que contiene, contínuamente.
tr: İçerilen blokları süresiz olarak tekrarlayın.

source: Wait the given number of milliseconds.
ca: Espera el nombre de mil·lisegons especificat.
cs: Čekání po zadaný čas (v milisekundách).
de: Wartet die in Millisekunden angegebene Zeit.
es: Espera el número de milisegundos especificado.
tr: Verilen milisaniye kadar bekleyin.

source: Repeat the enclosed blocks with the variable set to the current iteration number or item.
ca: Repeteix l'execució dels blocs que conté, fixant la variable a l'element o número de l'interval corresponent en cada iteració.
cs: Opakování vnořených bloků s s proměnnou nastavenou číslo aktuálního cyklu nebo položky seznamu.
de: Wiederholt die umschlossenen Blöcke unter Verwendung einer Laufvariable, die auf die aktuelle Iterationsnummer oder das aktuelle Element gesetzt ist.
es: Repite la ejecución de los bloques que contiene, fijando la variable al elemento o número del intervalo correspondiente a cada iteración.
tr: İçerilen blokları, değişken geçerli yineleme numarasına veya öğeye ayarlanmış olarak tekrarlayın.

source: Report (-o) if the first value is greater than the second one.
ca: Reporta (-o) si el primer valor és major que el segon.
cs: Vrátí (-o) když je první hodnota větší než druhá.
de: Gibt (-o) zurück, falls der erste Wert größer als der zweite Wert ist.
es: Reporta (-o) si el primer valor es mayor que el segundo.
tr: İlk değer ikinciden büyükse (-o) rapor edin.

source: Report (-o) if first input is a value of the given data type.
ca: Reporta (-o) si la primera casella té un valor del tipus especificat.
cs: Vrátí (-o) první údaj je daného typu.
de: Gibt (-o) zurück, falls die Eingabe ein Wert des angegebenen Datentyps ist.
es: Reporta (-o) si la primera casilla tiene un valor del tipo especificado.
tr: Rapor (-o) eğer ilk girdi verilen veri tipiyse.

source: Report bitwise OR of two numbers.
ca: Reporta l'operació bit a bit "o inclusiva" (OR) entre dos nombres.
cs: Vrátí bitové OR dvou čísel.
de: Gibt die bitweise ODER-Verknüpfung zweier Zahlen zurück.
es: Reporta la operación bit a bit "o" (OR) entre dos números.
tr: İki sayının bit düzeyinde VEYA değerini bildirin.

source: button A
ar: زر أ
ca: botó A
cs: tlačítko A
de: Knopf A
el: κουμπί Α
es: botón A
gl: botón A
ja: ボタン A
pt_br: botão A
ru: кнопка A
tr: buton A
uz: A tugmasi

source: timer
ca: cronòmetre
cs: časovač
de: Stoppuhr
es: cronómetro
ru: таймер
tr: süre ölçer

source: reset timer
ca: reinicia el cronòmetre
cs: vynulovat časovač
de: Stoppuhr zurücksetzen
es: reinicia cronómetro
ru: сбросить таймер
tr: süre ölçeri sıfırla

source: microseconds
ar: ميكروثانية
ca: microsegons
cs: mikrosekundy
de: Mikrosekunden
el: εκατομμυριοστά δευτερολέπτου
es: microsegundos
gl: microsegundos
ja: マイクロ秒
pt_br: microsegundos
ru: микросекунд
tr: mikrosaniye
uz: mikrosoniyalar

source: milliseconds
ar: ميلي ثانية
ca: mil·lisegons
cs: milisekundy
de: Millisekunden
el: χιλιοστά δευτερολέπτου
es: milisegundos
gl: milisegundos
ja: ミリ秒
pt_br: milisegundos
ru: миллисекунд
tr: milisaniye
uz: millisekundlar

source: board type
ar: نوع اللوحة
ca: tipus de placa
cs: Typ desky
de: Board-Typ
el: είδος κάρτας
es: tipo de placa
gl: tipo de placa
ja: ボードタイプ
pt_br: tipo de placa
ru: тип платы
tr: kart tipi
uz: karta turi

source: read digital pin _
ar: قراءة المنفذ الرقمي _
ca: lectura digital _
cs: přečtená logická hodnota z pinu _
de: lies digitalen Pin _
el: διάβασε το ψηφιακό ακροδέκτη _
es: lectura digital _
gl: lectura dixital _
ja: デジタルピンを読む _
pt_br: leitura digital _
ru: читать цифровой контакт _
tr: dijital pin oku _
uz: raqamli pinni o'qish _

source: read analog pin _
ar: قراءة المنفذ التناظري _
ca: lectura analògica _
cs: přečtená analogová hodnota z pinu _
de: lies analogen Pin _
el: διάβασε τον αναλογικό ακροδέκτη _
es: lectura analógica _
gl: lectura analóxica _
ja: アナログピンを読む _
pt_br: leitura analógica _
ru: читать аналоговый контакт _
tr: analog pin oku _
uz: analog pinni o'qish _

source: set digital pin _ to _
ar: جعل المنفذ الرقمي _ يساوي _
ca: posa el pin digital _ a _
cs: zapiš do pinu _ logickou hodnotu _
de: setze digitalen Pin _ auf _
el: όρισε το ψηφιακό ακροδέκτη _ σε _
es: pon pin digital _ a _
gl: poñer o pin dixital _ a _
ja: デジタルピン設定 _ を _
pt_br: coloque pino digital _ em _
ru: установить цифровой контакт _ на _
tr: dijital pin _ ayarını _ yap
uz: raqamli pinni _ ga o’rnatish

source: analog pins
ar: المنافذ التناظرية
ca: pins analògics
cs: analogové piny
de: analoge Pins
el: αναλογικοί ακροδέκτες
es: pines analógicos
gl: pins analóxicos
ja: アナログピン
pt_br: pinos analógicos
ru: аналоговые контакты
tr: analog pinler
uz: pin analoglari

source: digital pins
ar: المنافذ الرقمية
ca: pins digitals
cs: digitalní piny
de: digitale Pins
el: ψηφιακοί ακροδέκτες
es: pines digitales
gl: pins dixitais
ja: デジタルピン
pt_br: pinos digitais
ru: цифровые контакты
tr: dijital pinler
uz: raqamli pin

source: wait _ millisecs
ar: انتظر _ ميلي ثانية
ca: espera _ mil·lisegons
cs: čekej _ milisekund
de: warte _ Millisekunden
el: περίμενε, _ χιλιοστά δευτερολέπτου
es: espera _ milisegundos
gl: agardar _ milisegundos
ja: 待つ _ ミリ秒
pt_br: espere _ milisegundos
ru: ждать _ миллисекунд
tr: bekle _ milisaniye
uz: _ millisekundlar kutish

source: else if _ _
ar: آخر إذا _ _
ca: si no, si _ _
cs: jinak když _ _
de: sonst falls _ _
el: διαφορετικά αν _ _
es: si no, si _ _
gl: se non, se _ _
ja: でなければ,もし _ _
pt_br: então, se _ _
ru: иначе, если _ _
tr: yoksa eğer _ _
uz: yana boshqa, agar _ _

source: else
ar: آخر
ca: si no
cs: jinak
de: sonst
el: διαφορετικά
es: si no
gl: se non
ja: でなければ
pt_br: então
ru: иначе
tr: yoksa
uz: yana boshqa

source: when _
ar: عندما _
ca: quan _
cs: dokud _
de: Wenn _
el: όταν _
es: cuando _
gl: cando _
ja: とき _
pt_br: quando _
ru: когда _
tr: _ olunca
uz: qachon _

source: wait until _
ar: انتظر حتى _
ca: espera fins que _
cs: čekej dokud _
de: warte bis _
el: περίμενε μέχρι _
es: espera hasta que _
gl: agardar ata que _
ja: 待つ _ まで
pt_br: espere até que _
ru: ждать пока _
tr: _ olana kadar bekle
uz: _ gacha kutish

source: wait _ microsecs
ar: انتظر _ ميكروثانية
ca: espera _ microsegons
cs: čekej _ mikrosekund
de: warte _ Mikrosekunden
el: περίμενε _ εκατομμυριοστά δευτερολέπτου
es: espera _ microsegundos
gl: agardar _ microsegundos
ja: 待つ _ ミリ秒
pt_br: espere _ microsegundos
ru: ждать _ микросекунд
tr: bekle _ mikrosaniye
uz: _ microsekundlar kutish

source: return _
ar: رجع _
ca: retorna _
cs: vrať _
de: berichte _
el: επιστροφή _
es: retorna _
gl: retornar _
ja: 返す _
pt_br: retorne _
ru: возврат _
tr: döndür _
uz: qaytish _

source: when _ received
ar: عند تلقي _
ca: quan rebi _
cs: když _ přijato
de: Wenn _ empfangen
el: όταν _ ληφθεί
es: al recibir _
gl: ao recibir _
ja: 受信したとき _
pt_br: ao receber _
ru: когда _ получен
tr: _ mesajı geldiğinde
uz: qachon _ qabul qilinganda

source: stop this task
ar: وقف هذه المهمة
ca: atura aquesta tasca
cs: zastav tuto úlohu
de: stoppe dieses Skript
el: σταμάτα αυτό το σενάριο
es: detén esta tarea
gl: deter esta tarefa
ja: この処理を止める
pt_br: pare esta tarefa
ru: остановить эту задачу
tr: bu betiği durdur
uz: bu vazifani to'xtatish

source: stop other tasks
ca: atura les altres tasques
cs: zastav ostatní úlohy
de: stoppe andere Skripte
el: σταμάτα τα άλλα σενάρια
es: detén las otras tareas
ja: 他の処理を止める
pt_br: pare as outras tarefas
ru: остановить другие задачи
tr: öteki betikleri durdur
uz: boshqa vazifalarni to'xtatish

source: stop all
ar: توقيف كل شيء
ca: atura-ho tot
cs: zastav vše
de: stoppe alles
el: σταμάτα όλα τα σενάρια
es: detenlo todo
gl: detelo todo
ja: すべて停止
pt_br: pare tudo
ru: остановить всё
tr: tüm betikleri durdur
uz: hammasini to'xtatish

source: last message
ca: últim missatge
cs: poslední zpráva
de: letzte Nachricht
el: τελευταίο μήνυμα
es: último mensaje
ja: 最新のメッセージ
pt_br: última mensagem
ru: последнее сообщение
tr: son mesaj
uz: oxirgi xabar

source: parameter list
ca: llista de paràmetres
cs: seznam parametrů
de: Parameterliste
es: lista de parámetros
ru: список параметров
tr: parametre listesi

source: cat;Operators
ca: Operadors
cs: Operátory
de: Operatoren
el: Τελεστές
es: Operadores
ja: 演算
pt_br: Operadores
ru: Операторы
tr: İşlemler
uz: Operatorlar

source: _ mod _
ca: _ mòdul _
cs: _ modulo _
el: _ ακέραιο υπόλοιπο _
es: _ módulo _
gl: _ módulo _
ja: _ 割る _ の余り
pt_br: _ módulo _
ru: _ мод _
uz: _ rejim _

source: abs _
ar: قيمه مطلقه _
ca: valor absolut de _
el: απόλυτο _
es: valor absoluto de _
gl: valor absoluto de _
ja: 絶対値 _
pt_br: valor absoluto de _
ru: абс _
tr: mutlak değer _

source: max _ _
ca: màxim entre _ i _
es: mánimo entre _ y _
ru: макс _ _
tr: en büyüğü _ _

source: random _ to _
ar: رقم عشوائي من _ إلى _
ca: nombre a l'atzar entre _ i _
cs: náhodné číslo od _ do _
de: Zufallszahl von _ bis _
el: τυχαίο _ ως _
es: número al azar entre _ y _
gl: número ao chou entre _ e _
ja: から _ まで _ ランダムの値
pt_br: número aleatório entre _ e _
ru: случайное от _ до _
tr: rastgele _ ve _ arası
uz: tasodifiy _ ga _

source: _ and _
ar: _ و _
ca: _ i _
cs: _ a _
de: _ und _
el: _ και _
es: _ y _
gl: _ e _
ja: _ かつ _
pt_br: _ e _
ru: _ и _
tr: _ ve _
uz: _ va _

source: and _
ar: و _
ca: i _
cs: a _
de: und _
el: και _
es: y _
gl: e _
ja: かつ _
pt_br: e _
ru: и _
tr: ve _
uz: va _

source: _ or _
ar: _ أو _
ca: _ o _
cs: _ nebo _
de: _ oder _
el: _ ή _
es: _ o _
gl: _ ou _
ja: _ または _
pt_br: _ ou _
ru: _ или _
tr: _ veya _
uz: _ yoki _

source: or _
ar: أو _
ca: o _
cs: nebo _
de: oder _
el: ή _
es: o _
gl: ou _
ja: または _
pt_br: ou _
ru: или _
tr: veya _
uz: yoki _

source: _ is a _
ca: _ és un _
cs: _ ist ein(e) _
de: _ ist ein(e) _
el: _ είναι ένα _
es: _ es un _
ja: _ は _ である
pt_br: _ é um _
ru: _ это _
tr: _ bir _
uz: _ - bu _

source: if _ then _ else _
ca: si _ llavors _ si no _
cs: když _ pak _ jinak _
es: si _ entonces _ si no _
tr: eğer _ yap _ yoksa _

source: boolean
ca: booleà
cs: logika
de: Wahrheitswert
es: booleano
ja: ブール
pt_br: booleano
ru: булево
tr: boole
uz: mantiqiy

source: string
ca: text
cs: text
de: Zeichenfolge
el: συμβολοσειρά
es: texto
ja: 文字列
pt_br: texto
ru: строка
tr: dizgi
uz: qator

source: list
ca: llista
cs: seznam
de: Liste
el: λίστα
es: lista
ja: リスト
pt_br: lista
ru: список
tr: liste
uz: ro'yxat

source: starting at _
ca: començant des de _
cs: začínající na _
de: beginnend bei _
el: ξεκινά από _
es: empezando desde _
ja: スタート位置 _
pt_br: comece a partir de _
ru: начинается с _
tr: başla _
uz: _ dan boshlab

source: has tone support
ar: لديه دعم نغمة
ca: té suport per a tons
cs: podporuje tóny
de: unterstützt Klänge
el: έχει τονική υποστήριξη
es: tiene soporte para tonos
gl: admite tons
ja: 音をサポート
pt_br: tem suporte para tons
ru: имеет поддержку тона
tr: ton desteği var
uz: ohangni qo'llab-quvvatlaydi

source: start WiFi _ password _
ar: ابدأ واي فاي _ كلمة المرور _
ca: inicia WiFi _ amb contrasenya _
cs: připoj WiFi _ heslo _
de: starte WiFi _ Passwort _
el: ξεκίνα WIFI _ με κωδικό _
es: inicia WiFi _ con contraseña _
gl: iniciar a WiFi _ co contrasinal _
ja: WiFiの開始 _ パスワード _
pt_br: inicie WiFi _ com a senha _
ru: запустить WiFi _ пароль_
tr: WIFI başlat SSID _ şifre _
uz: Wi-Fi ni _ parol bilan ishga tushirish

source: attach NeoPixel panel width _ height _ at pin _
ca: inicialitza panell de NeoPíxels amplada _ alçada _ al pin _
cs: připoj NeoPixel panel šířka _ výška _ na Pin _
de: verbinde NeoPixel-Panel Breite _ Höhe _ an Pin _
es: inicializa panel de NeoPíxels ancho _ alto _ en el pin _

source: NeoPanel draw text _ at x _ y _ color _
ca: escriu _ a x _ y _ color _ al NeoPanell
cs: NeoPanel zobraz text na x _ y _ barva _
de: NeoPanel schreibe Text _ auf x _ y _ Farbe _
es: escribe _ en x _ y _ color _ en el NeoPanel

source: number
ca: nombre
cs: číslo
de: Zahl
el: αριθμός
es: número
ja: 数字
pt_br: número
ru: число
tr: numara
uz: raqam

source: loudness
ca: volum
cs: hlasitost
de: Lautstärke
es: volumen
ru: громкость

source: clockwise
ar: بإتجاه عقارب الساعة
ca: sentit horari
cs: po směru hodinových ručiček
de: im Uhrzeigersinn
el: δεξιόστροφα
es: sentido horario
gl: sentido horario
ja: 時計回り
pt_br: sentido horário
ru: по часовой стрелке
tr: saat yönünde
uz: soat yo'nalishi bo'yicha

source: Finch Beak Red _ Green _ Blue _
ca: encén el bec de color R _ % G _ % B _ %
de: Finch Schnabel Rot _ Grün _ Blau _
es: enciende el pico de color R _ % V _ % A _ %
ja: Finch くちばし 赤 _ 緑 _ 青 _
pt_br: cor do bico do Finch R _ % G _ % B _ %
ru: Остановить Finch Красный _ Зеленый _ Синий _
tr: Finch Gaga Kırmızı _ Yeşil _ Mavi _

source: move motor _ angle _ °
ca: mou motor _ angle _ °
cs: otoč motor _ o úhel _ °
de: bewege Motor _ Winkel _ °
el: μοτέρ _ στρίψε γωνία _ °
es: mueve motor _ ángulo _ °
ja: モーターを動かす _ 角度 _ °
pt_br: mova motor _ ângulo _ °
ru: Сдвинуть двигатель _ угол _ °
tr: _ motorunu _ ° döndür
uz: dvigatelni _ gradusga _ ° harakatga keltirish

source: move motor _ _ complete turns
ca: mou motor _ _ voltes completes
cs: otoč motor _ o _ celých otáček
de: bewege Motor _ _ komplette Runden
el: μοτέρ στρίψε _ _ στροφές
es: mueve motor _ _ vueltas completas
ja: モーターを動かす _ _ 回転
pt_br: mova motor _ _ voltas completas
ru: переместить двигатель _ _ полных оборотов
tr: _ motorunu _ kere tam döndür
uz: motorli mdvigatel _ to'liq buriladi

source: Finch Move _ _ cm at _ %
ca: mou-te cap _ _ cm a velocitat _ %
de: Finch Gehe _ _ cm mit _ %
el: Finch Προχώρα _ _ εκ με _ %
es: mueve hacia _ _ cm a velocidad _ %
ja: Finch 移動 _ _ cm 位置 _ %
pt_br: mover o Finch _ _ cm à velocidade de _ %
ru: Пердвинуть Finch _ _ cм на _ %
tr: Finch Hareket _ _ cm at _ %

source: Finch Stop
ca: atura el Finch
de: Finch Stoppen
el: Finch Σταμάτα
es: detén el Finch
ja: Finch 停止
pt_br: para o Finch
ru: Остановить Finch
tr: Finch Dur

source: Right
ca: Dreta
cs: Doleva
de: Rechts
el: Δεξιά
es: Derecha
ja: 右折
pt_br: Direita
ru: Враво
tr: Sağ

source: Tilt Left
ca: Inclinat a l'esquerra
de: Neigung Links
el: Κλίνε Αριστερά
es: Inclinado hacia la izquierda
ja: 左へ向く
pt_br: Inclinação à esquerda
ru: Наклон влево
tr: Sola Yat

source: Finch Reset Encoders
ca: reinicialitza els comptadors de voltes
de: Finch setze Kodierer zurück
el: Finch Μηδένισε Encoders
es: reinicializa los contadores de vueltas
ja: Finch エンコーダをリセット
pt_br: reinicia os contadores de voltas do Finch
ru: Сброс кодировки Finch
tr: Finch Enkoderları resetle

source: Finch Battery
ca: nivell de bateria
de: Finch Batterie
el: Finch Μπαταρία
es: nivel de batería
ja: Finch 電池容量
pt_br: nível de bateria do Finch
ru: Батарейка Finch
tr: Finch Pil

source: Forward
ca: Endavant
cs: Vpřed
de: Vorwärts
el: Μπροστά
es: Adelante
ja: 前進
pt_br: Frente
ru: Вперед
tr: İleri

source: Upside Down
ca: Cap per avall
de: Umgedreht
el: Ανάποδα
es: Cabeza abajo
ja: 逆さま
pt_br: Cabeça para baixo
ru: Вверх дном
tr: Ters

source: distance (cm) trigger _ echo _
ca: distància (cm) trigger _ echo _
cs: vzdálenost (cm) trigger _ echo _
de: Entfernung (cm) Auslöser _ Echo _
el: απόσταση (εκ) ενεργοποίηση _ ηχώ _
es: distancia (cm) trigger _ echo _
gl: distancia (cm) disparador _ eco _
ja: 距離 (cm) トリガー _ エコー _
pt_br: distância (cm) trigger _ echo _
ru: расстояние (см) триггера _ эхо _
tr: mesafe (cm) tetik _ eko _
uz: masofa (sm) trigger _ echo _

source: kbd;PgUp
ca: RePg
cs: PgUp
de: Bild auf
es: AvPg

source: kbd;PrintScreen
ca: ImprPant
cs: PrintScreen
de: Druck
es: ImprPant

source: release all keys
ca: deixa anar totes les tecles
cs: uvolni všechny klávesy
de: lasse alle Tasten los
es: suelta todas las teclas

source: kbd;delete
ar: حذف
ca: eliminar
cs: delete
de: löschen
el: διαγραφή
es: eliminar
gl: eliminar
ja: 削除
pt_br: apaga
ru: удалить
tr: sil
uz: o'chirish

source: scroll mouse by _
ca: desplaça el ratolí en _
de: scrolle Maus zu _
es: desplaza el ratón en _

source: circular item _ of _
ca: element circular _ de _
cs: cyklická položka _ z _
de: zyklisches Element _ von _
es: elemento circular _ de _

source: pick _ from _
ca: tria _ elements de _
cs: vyber _ ze _
es: escoge _ elementos de _

source: some
ca: uns quants
cs: nějaký
es: unos cuantos

source: uniqued _
ca: _ sense duplicats
cs: bez duplicit _
de: _ eindeutig
es: _ sin duplicados

source: Scrolling
ca: Text animat
cs: Scrollen
de: Scrollen
el: κύλιση
es: Texto animado
gl: Texto animado
ja: スクロール表示
pt_br: Texto animado
ru: Скроллинг
tr: Kaydırma
uz: Aylantirish

source: scroll text _
ca: anima el text _
cs: zobraz text _
de: scrolle Text _
el: κύλιση κειμένου _
es: anima el texto _
gl: animar o texto _
ja: スクロール文字 _
pt_br: anime o texto _
ru: прокрутка текста _
tr: _ metnini kaydır
uz: matnni aylantirish _

source: set servo _ to speed _ (-100 to 100)
ca: fes girar el servo _ a velocitat _ (-100 a 100)
cs: nastav Servo _ na rychlost _ (-100 až 100)
de: setze Servo _ auf Geschwindigkeit _ (-100 bis 100)
el: ορίσε servo _ στην ταχύτητα _ (-100 έως 100)
es: haz girar el servo _ a velocidad _ (-100 a 100)
ja: サーボ設定 _ の速度 _ (-100 - 100)
pt_br: gire o servo _ à velocidade de _ (-100 a 100)
ru: установить серво _ на скорость _ (от -100 до 100)
tr: _ servosunun hızını _ yap (-100 to 100)
uz: servo _ tezligini _ ga sozlang (-100 dan 100 gacha)

source: LED Display
ca: Pantalla LED
cs: LED Displej
de: LED-Anzeige
el: Οθόνη LED
es: Pantalla LED
gl: Pantalla LED
ja: LED表示
pt_br: Display LED
ru: Светодиодный дисплей
tr: LED Ekran
uz: LED displey

source: display image _
ca: mostra imatge _
cs: zobraz ikonu _
de: zeige Bild _
es: muestra imagen _

source: clear display
ar: مسح الشاشة
ca: neteja pantalla
cs: smaž displej
de: lösche Anzeige
el: καθάρισμα Οθόνης
es: limpia pantalla
gl: limpar pantalla
ja: 表示クリア
pt_br: apague display
ru: очистить экран
tr: ekranı sil
uz: displeyni olib tashlash

source: plot x _ y _
ar: رسم س _ ص _
ca: encén x _ y _
cs: rozsviť x _ y _
de: plotte x _ y _
el: σχεδιάσε x _ y _
es: enciende x _ y _
gl: acender x _ y _
ja: プロットする x _ y _
pt_br: acenda x _ y _
ru: вычертить x _ y _
tr: yak x _ y _
uz: qurish x _ y _

source: silly
ca: esbojarrat
cs: hloupý
de: albern
es: alocado
