Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: Cutebot _ line sensor
ca: Valor del sensor de línia _
es: valor del sensor de línea _

source: Cutebot distance (cm)
ca: Distància frontal (cm)
es: distancia frontal (cm)

source: cutebotlight;right
ca: dret
es: derecho

source: Wukong set servo _ to _ degrees (-90 to 90)
ca: posa el servo _ a _ graus (-90 a 90)
es: pon el servo _ a _ grados (-90 a 90)

source: drive with speed _ and heading _
ca: avança a velocitat _ i direcció _
es: avanza a velocidad _ y dirección _

source: set raw motors with left mode _ left speed _ right mode _ right speed _
ca: mou el motor esquerre _ a velocitat _ i el dret _ a velocitat _
es: mueve el motor izquierdo _ a velocidad _ y el derecho _ a velocidad _

source: set all LEDs to red _ green _ blue _
ca: posa tots els LEDs RGB _ a vermell _ verd _ blau _
es: pon todos los LEDs RGB a rojo _ verde _ azul _

source: motor vibrate for _ ms
ca: fes vibrar el motor durant _ ms
es: haz vibrar el motor durante _ ms

source: NeZha set continuous rotation servo _ speed to _ %
ca: posa el servo de rotació contínua _ a velocitat _ %
es: pon el servo de rotación contínua _ a velocidad _ %

source: Octopus 180° servo pin _ angle to _ ° (0~180)
ca: Octopus servo de 180° al pin _ angle a _ ° (0~180)
es: fija servo de 180º en pin _ a ángulo _ ° (0~180)

source: Octopus value of DHT11 temperature (°C) at pin _
ca: Octopus temperatura (°C) del DHT11 al pin _
es: temperatura (°C) del DHT11 en el pin _

source: Octopus value of DHT11 humidity (0~100) at pin _
ca: Octopus humitat (0~100) del DHT11 al pin _
es: humedad (0~100) del DHT11 en el pin _

source: Octopus value of noise (dB) at pin _
ca: Octopus nivell de so (dB) al pin _
es: nivel de sonido (dB) en el pin _

source: Octopus OLED draw rectangle x _ y _ w _ h _ rounding _ (3~15)
ca: Octopus OLED dibuixa un rectangle x _ y _ amplada _ alçada _ arrodonit _ (3~15)
es: dibuja rectángulo a x _ y _ ancho _ alto _ redondeado _ (3~15) en el OLED

source: Octopus OLED fill rectangle x _ y _ w _ h _
ca: Octopus OLED dibuixa un rectangle sòlid x _ y _ amplada _ alçada _
es: pinta un rectángulo en x _ y _ ancho _ alto _ en el OLED

source: Octopus OLED fill circle x _ y _ radius _
ca: Octopus OLED dibbuixa un cercle sòlid x _ y _ radi _
es: pinta un círculo en x _ y _ con radio _ en el OLED

source: Octo beam to phones _
ca: envia _ a telèfons via Octo
es: envía _ a teléfonos vía Octo

source: Open from board
ca: Recupera projecte de la placa
cs: Otevřít z mikropočítače
de: vom Board öffnen
el: Άνοιξε από την κάρτα
es: Recupera proyecto de la placa
pt_br: Abrir da placa
ru: Открыть из платы
tr: Karttan aç

source: Information
ca: Informació
cs: Informace
el: Πληροφορία
es: Información
pt_br: Informação
ru: Информация
tr: İnformasyon

source: Connect board and try again
ca: Connecta la placa i prova de nou
cs: Připoj desku z zkus znovu
de: Board anschließen und nochmals versuchen
es: Conectar la placa e intetar de nuevo

source: Found a newer version of %1.
ca: S'ha trobat una nova versió de %1.
cs: Byla nalezena nová verze %1.
de: gefunden wurde eine neuere Version von %1.
el: Βρέθηκε πιο νέα έκδοση από %1.
es: Se ha encontrado una nueva versión de %1.
pt_br: Encontrada uma versão mais nova de %1.
tr: Yeni versiyonu bulundu %1.

source: Select board:
ar: اختر الوحة:
ca: Selecciona la placa:
cs: Vybrat desku mikropočítače:
de: Board auswählen:
el: Επιλογή κάρτας:
es: Selecciona la placa:
gl: Seleccionar a placa:
ja: ボード選択:
pt_br: Seleciona a placa:
ru: Выберите плату:
tr: Kart seç:
uz: Kengashni tanlang:

source: Could not read %1.
ca: No s'ha pogut llegir %1.
cs: Nelze přečíst %1.
de: Lesen nicht möglich %1.
el: Δεν μπορεί να διαβάσει %1.
es: No se ha podido leer %1.
gl: Non foi posíbel ler %1.
ja: 読めなかった %1.
pt_br: Não é possível ler %1.
ru: Не удаётся прочитать %1.
tr: Okuyamadık %1.
uz: O‘qib bo‘lmadi %1.

source: about;by %1, %2 & %3.
ar: من قبل %3 & %2, %1.
ca: per %1, %2 i %3.
cs: od %1, %2 & 3.
de: von %1, %2 und %3.
el: από %1, %2 & %3.
es: por %1, %2 y %3.
gl: por %1, %2 e %3.
ja: まで %1, %2 & %3.
pt_br: por %1, %2 e %3.
ru: по %1, %2 & %3.
tr: tarafından %1, %2 & %3.
uz: tomonidan %1, %2 & %3.

source: For AdaFruit boards, double-click reset button and try again.
ca: En plaques AdaFruit, prem el botó de reinici dues vegades ràpidament i torna-ho a provar.
cs: Pro mikropočítače AdaFruit stiskněte dvakrát tlačítko reset a zkuste znovu.
de: Für AdaFruit Boards den Reset Knopf drücken und erneut versuchen
el: Για τις κάρτες Adafruit, διπλό κλίκ στο κουμπί επαναφοράς (reset)και δοκίμασε ξανά.
es: En placas AdaFruit, pulsa el botón de reseteo dos veces rápidamente y vuelve a probar.
ja: AdaFruitボードの場合，resetボタンをダブルクリックして再度実施してください.
pt_br: Nas placas AdaFruit, aperta o botão de reset duas vezes rapidamente e tente de novo.
ru: Для плат AdaFruit, попробуйте дважды нажать кнопку сброса и попробовать снова.
tr: AdaFruit kartları için sıfırlama düğmesini çift tıklayın ve tekrar deneyin.
uz: AdaFruit platalari uchun tiklash tugmachasini ikki marta bosing va qaytadan urinib ko'ring.

source: Only recent Chrome and Edge browsers support WebSerial.
ca: WebSerial només està suportat per les últimes versions de Chrome i Edge.
cs: Pouze nejnovější prohlížeče Chrome a Edge podporují WebSerial.
de: Nur neuste Chrome- and Edge-Browser unterstützen WebSerial.
es: WebSerial solo está suportado por las últimas versiones de Chrome y Edge.

source: Try to Install MicroBlocks on the board?
ar: محاولة تثبيت MicroBlocks على اللوحة؟
ca: Vols provar d'instal·lar-hi MicroBlocks?
cs: Instalovat MicroBlocks do mikropočítače?
de: MicroBlocks auf dem Board installieren?
el: Δοκίμασες να εγκαταστήσεις το Microblocks στην κάρτα;
es: ¿Quieres intentar instalar MicroBlocks en la placa?
gl: Tentar instalar MicroBlocks na placa?
ja: ボードへMicroBlocksのインストールを試してくれますか?
pt_br: Tentar instalar o MicroBlocks na placa?
ru: Попробуйте установить MicroBlocks на плату.
tr: Karta Microblocks kurulsun mu?
uz: Plataga MicroBlockni o'rnatishga harakat qilib ko'ring.

source: Try to update MicroBlocks on the board?
ca: Vols provar d'actualitzar-lo?
cs: Aktualizovat MicroBlocks v mikropočítači?
de: MicroBlocks auf dem Board aktualisieren?
el: Προσπάθησες να εγκαταστήσεις το Microblocks στην κάρτα;
es: ¿Quieres intentar actualizarlo?
ja: ボードのMicroBlocksの更新を試してくれますか?
pt_br: Tentar atualizar o MicroBlocks na placa?
ru: Попробуйте обновить MicroBlocks на плате?
tr: Karttaki MicroBlocks güncellensin mi?
uz: MicroBlocksni yangilab ko'rdingizmi?

source: undrop (ctrl-Z)
ca: desfes l'últim moviment (ctrl-Z)
cs: vrátit zpět (Strg-Z)
de: zurücknehmen (Strg-Z)
es: deshaz el último movimiento (ctrl-Z)
ja: 前に戻す (ctrl-Z)
pt_br: desfaz o último movimento (ctrl-Z)
ru: отменить (Ctrl-Z)
tr: geri al
uz: o'chirish (ctrl-Z)

source: paste script from clipboard
ca: enganxa el programa del porta-retalls
cs: načíst skript ze schránky
de: füge Skript aus Zwischenablage ein
es: pega el programa del portapapeles

source: save a picture of all visible scripts
ca: desa una imatge de tots els programes visibles
cs: uložit obrázky všech viditelných skriptů
de: speichere ein Bild aller sichtbaren Skripts
es: guarda una imagen de todos los programas visibles

source: set exported script scale
ca: fixa l'escala de la imatge a exportar
cs: nastavit měřítko exportovaných skriptů
de: setze Größenmaßstab für Export auf ...
es: fija la escala de la imagen a exportar

source: printable (200%)
ca: per a impressió (200%)
cs: pro tisk (200%)
de: druckbar (200%)
es: para impresión (200%)

source: drag selection
ca: arrossega selecció
cs: přetáhnout vybrané
de: verschiebe Auswahl
es: arrastra selección

source: About MicroBlocks
ca: Sobre MicroBlocks
cs: O MicroBlocks
de: Über MicroBlocks
es: Acerca de MicroBlocks

source: set serial delay
ca: ajusta la latència del port sèrie
cs: nastav prodlevu sériové linky
de: setze serielle Verzögerung
el: όρισε την σειριακή καθυστέρηση
es: ajusta la latencia del puerto serie
gl: axustar a latencia do porto serie
ja: シリアル速度を設定
pt_br: ajusta a latência da porta serial
ru: установить серийную задержку
tr: seri gecikmeyi ayarla
uz: ketma-ket kechikishni o'rnating

source: MicroBlocks HTTP Server listening on port 6473
ca: El servidor HTTP de MicroBlocks està actiu al port 6473
cs: MicroBlocks HTTP Server poslouchá na portu 6473
de: MicroBlocks HTTP-Server überwacht Port 6473
el: MicroBlocks HTTP εξυπηρετητής ακούει στην θύρα 6473
es: El servidor HTTP de MicroBlocks está activo en el puerto 6473
gl: o servidor HTTP de MicroBlocks esta activo no porto 6473
ja: MicroBlocks HTTPサーバーのポート番号 6473
pt_br: O servidor HTTP do MicroBlocks está ativo na porta 6473
ru: HTTP-сервер MicroBlocks прослушивает порт 6473
tr: MicroBlocks HTTP Sunucusu 6473 numaralı bağlantı noktasında dinliyor
uz: 6473 portida MicroBlocks HTTP Serverni tinglayapti

source: Allow the attached board to be connected via BLE?
ca: Vols que la placa connectada es pugui programar via BLE?
cs: Povolit připojení mikropočítače pomocí BLE?
de: Verbindung des angeschlossenen Boards via BLE erlauben?
es: ¿Permitir que la placa conectada se pueda programar por BLE?

source: compact code store
ca: compacta el codi emmagatzemat
cs: minimalizovat uložený kód
es: compacta el código almacenado

source: install ESP firmware from URL
ca: instal·la firmware ESP des de l'URL
cs: instalovat ESP firmware z URL
de: installiere ESP-Firmware von URL
es: instalar firmware ESP desde una URL
tr: URL'den ESP firmware kur

source: Drag the firmware file you just saved to the %1 drive.
ca: Arrossega l'arxiu de firmware que acabes de desar a la unitat %1.
cs: Přenes právě uložený firmware na %1 disk.
de: Die gerade gespeicherte Firmware Datei auf das %1 Laufwerk ziehen.
es: Arrastra el archivo de firmware qua acabas de guardar hacia la unidad %1.
tr: Az önce kaydettiğiniz firmware dosyasunı %1 sürücüsüne sürükleyin.

source: Board not connected
ca: Placa no connectada
cs: Mikropočítač není připojen
de: Board nicht verbunden
es: Placa no conectada
tr: Board bağlanmadı

source: Wiping board...
ca: Esborrant placa...
cs: Mazání mikropočítače...
de: Board löschen...
el: Διαγράφει την κάρτα…
es: Borrando placa...
ja: ボードを消去中...
pt_br: Apagando a placa...
ru: Старание платы...
tr: kart siliniyor...
uz: Platani tozalash...

source: hide advanced blocks
ar: إخفاء الكتل المتقدمة
ca: amaga els blocs avançats
cs: skrýt pokročilé bloky
de: verstecke fortgeschrittene Blöcke
el: κρύψε προχωρημένα blocks
es: oculta los bloques avanzados
gl: agochar os bloques avanzados
ja: 高度なブロックを隠す
pt_br: oculta os blocos avançados
ru: скрыть расширенные блоки
tr: gelişmiş blokları gizle
uz: rivojlangan bloklarni yashirish

source: export data to CSV file
ca: exporta dades a arxiu CSV
cs: export dat do CSV souboru
de: exportiere Daten in CSV-Datei
es: exportar datos a archivo CSV
tr: veriyi bir CSV dosyasına kaydet

source: copy graph data to clipboard
ca: copia dades de la gràfica al porta-retalls
cs: kopírovat graf do schránky
de: kopiere Graph in Zwischenablage
es: copiar datos del gráfico al portapapeles
tr: grafik verisini panoya kopyala

source: expand
ar: وسع
ca: expandeix
cs: rozbalit
de: ausklappen
el: επέκτεινε
es: expande
gl: expandir
ja: 展開
pt_br: expandir
ru: раскрыть
tr: açındır
uz: kengaytirish

source: find variable accessors
ca: cerca accessos a la variable
cs: najít použití proměnné
de: suche Variablenzugriff
es: busca accesos a la variable
tr: değişkenin okuyucularını(erişimciler) bulun

source: find uses of this block
ca: cerca usos d'aquest bloc
cs: najít použití aktuálního bloku
de: suche Blockverwendung
es: busca usos de este bloque
tr: bu bloğu kullananları bulun

source: find scripts or block definitions using this block
ca: cerca programes o definicions de blocs on s'estigui utilitzant aquest bloc
cs: najít skripty nebo definice bloků které používají aktuální blok
de: sucht Skript- oder Blockdefinitionen, in denen dieser Block verwendet wird
es: busca programas o definiciones de bloque en qué se esté usando este bloque
tr: bu bloğu kullanan scriptleri veya blok tanımlarını bul

source: help
ca: ajuda
cs: nápověda
de: zeige Hilfe
es: ayuda
tr: yardım

source: delete block
ca: elimina bloc
cs: smazat blok
de: Block löschen
el: διάγραψε το μπλοκ
es: elimina bloque
gl: eliminar bloque
ja: ブロックを削除
pt_br: elimina o bloco
ru: удалить блок
tr: bloğu sil
uz: blokni o'chirish

source: copy to clipboard
ca: copia al porta-retalls
cs: kopírovat do schránky
de: kopiere in Zwischenablage
el: αντίγραψε στο πρόχειρο
es: copia al portapapeles
gl: copiar no portapapeis
ja: クリップボードにコピー
pt_br: copia para a área de transferência
ru: скопировать в буфер обмена
tr: panoya kopyala
uz: clipboardga nusxalash

source: copy to clipboard as URL
ca: copia al porta-retalls com a URL
cs: kopírovat do schránky jako URL
de: kopiere als URL in Zwischenablage
es: copia al portapapeles como URL
tr: panoya URL olarak kopyala

source: show help for this block in a browser
ca: mostra ajuda per a aquest bloc al teu navegador
cs: zobrazit nápovědu k bloku v prohlížeči
de: zeige Hilfe für diesen Block im Browser
es: muestra ayuda para este bloque en tu navegador
tr: tarayıcıda yardım bağıntısını göster

source: save picture of script
ar: حفظ صورة للبرنامج النصي
ca: desa la imatge del programa
cs: uložit obrázek skriptu
de: speichere Bild des Skripts
el: αποθήκευσε φωτογραφία του κειμένου
es: guarda la imagen del programa
gl: gardar a imaxe do programa
ja: スクリプトの画面を保存
pt_br: guarda uma imagem do programa
ru: сохранить изображение скрипта
tr: betiğin resmini kaydet
uz: skript rasmini saqlash

source: save picture of script with result
ca: desa la imatge del programa amb el resultat
cs: uložit obrázek skriptu s výsledkem
de: speichere Bild des Skripts mit Ergebnis
es: guarda la imagen del programa con su resultado
tr: Script'in sonucuyla beraber fotoğrafını kaydet

source: save a picture of these blocks as a PNG file
ca: desa una imatge d'aquests blocs en format PNG
cs: uložit obrázek vybraných bloků jako PNG
de: speichere Bild dieser Blöcke als PNG-Datei
el: αποθήκευσε φωτογραφία αυτών των μπλοκ σαν PNG αρχείο
es: guarda una imagen de estos bloques en formato PNG
gl: garda unha imaxe destes bloques como un ficheiro PNG
ja: これらのブロックの画面をPNGファイルで保存
pt_br: guarda uma imagem destes blocos em formato PNG
ru: сохранить изображение этих блоков в виде файла PNG
tr: bu blokların resimlerini PNG dosyası olarak kaydet
uz: ushbu bloklarning rasmini PNG fayli sifatida saqlang

source: save a picture of these blocks and their result as a PNG file
ca: desa una imatge d'aquests blocs i el seu resultat en format PNG
cs: uložit obrázek vybraných bloků a jejich výsledku jako PNG
de: speichere Bild dieser Blöcke und deren Ergebnis als PNG-Datei
es: guarda una imagen de estos bloques y su resultado en formato PNG
tr: Bu blokların ve sonucunun fotoğrafını PNG dosyası olarak kaydet

source: Input type:
ca: Tipus de casella:
cs: Vstupní typ:
de: Eingabetyp:
el: Τύπος Εισόδου:
es: Tipo de casilla:
gl: Tipo de entrada:
ja: 入力タイプ:
pt_br: Tipo de entrada:
ru: Тип ввода:
tr: Girdi tipi:
uz: Kiritish turi:

source: string only
ca: només text
cs: pouze řetězec
de: nur Zeichenfolgen
el: μόνο συμβολοσειρά
es: solo texto
gl: só texto
ja: 文字列のみ
pt_br: somente texto
ru: только строка
tr: yalnız dizgi
uz: faqat satr

source: number only
ca: només nombre
cs: pouze číslo
de: nur Zahlen
el: αριθμός μόνο
es: solo número
gl: só número
ja: 数字のみ
pt_br: somente número
ru: только числа
tr: yalnız sayı
uz: faqat raqam

source: stop editing
ca: deixa d'editar
cs: ukončit úpravy
de: stoppe Bearbeitung
es: detén la edición
tr: düzenlemeyi durdur

source: accept
ca: accepta
cs: přijmout
de: akzeptiere
es: acepta
tr: kabul et

source: hide block definition
ca: amaga la definició d'aquest bloc
cs: skrýt definici bloku
de: verstecke Blockdefinition
el: κρύψε τον ορισμό μπλοκ
es: oculta la definición de este bloque
gl: agochar a definición do bloque
ja: ブロック定義を隠す
pt_br: oculta a definição deste bloco
ru: скрыть значение блока
tr: blok tanımını gizle
uz: blok ta'rifini yashirish

source: LIBRARIES
ca: LLIBRERIES
cs: KNIHOVNY
de: MODULE
es: LIBRERÍAS
tr: KÜTÜPHANELER

source: export this library
ca: exporta aquesta llibreria
cs: exportuj tuto knihovnu
de: exportiere diese Bibliothek
es: exporta esta librería
tr: bu kütüphaneyi dışarı aktar

source: folder;Libraries
ca: Llibreries
cs: Knihovny
es: Librerías
ru: Библиотеки

source: folder;Network
ca: Xarxa
cs: Sítě
es: Red

source: File Open
ar: فتح الملف
ca: Obre arxiu
cs: Otevřít soubor
de: Datei öffnen
el: Αρχείο Ανοιγμα
es: Abre fichero
gl: Abrir ficheiro
ja: ファイルを開く
pt_br: Abrir arquivo
ru: Открыть файл
tr: Dosya Aç
uz: Faylni ochish

source: File Save
ar: حفظ الملف
ca: Desa arxiu
cs: Uložit soubor
de: Datei speichern
el: Αρχείο Αποθήκευση
es: Guarda fichero
gl: Gardar ficheiro
ja: ファイル保存
pt_br: Salvar arquivo
ru: Сохранить файл
tr: Dosya Kaydet
uz: Faylni saqlash

source: File name:
ar: اسم الملف:
ca: Nom d'arxiu:
cs: Soubor:
de: Dateiname:
el: Αρχείο όνομα:
es: Nombre del fichero:
gl: Nome de ficheiro:
ja: ファイル名:
pt_br: Nome do arquivo:
ru: Имя файла:
tr: Dosya adı:
uz: Fayl nomi:

source: New Folder
ca: Nou directori
cs: Nová složka
de: Neuer Ordner
el: Νέος Φάκελος
es: Nueva carpeta
ja: 新しいフォルダ
pt_br: Nova Pasta
ru: Новая Папка
tr: Yeni Klasör
uz: Yangi papka

source: File not found in server.
ca: No s'ha trobat l'arxiu al servidor.
cs: Soubor na serveru nenalezen.
de: Datei konnte auf dem Server nicht gefunden werden.
el: Το αρχείο δεν βρέθηκε στον εξυπηρετητή.
es: No se ha encontrado el archivo en el servidor.
ja: サーバにファイルが見つからない.
pt_br: Não foi encontrado o arquivo no servidor.
ru: Файл не найден на сервере.
tr: Dosya sunucuda bulunamadı.
uz: Fayl serverda topilmadi.

source: Server expects HTTPS, and MicroBlocks doesn't currently support it.
ca: El servidor requereix HTTPS, però MicroBlocks no en suporta.
cs: Server očekává HTTPS, momentálně MicroBlocks nepodporuje.
de: Server erwartet HTTPS, was von MicroBlocks momentan nicht unterstützt wird.
el: Εξυπηρετητής αναμένει HTTPS, αλλά δεν υποστηρίζεται από το MicroBlocks
es: El servidor requiere HTTPS, y MicroBlocks no lo soporta.
ja: サーバーはHTTPSを期待しているが，MicroBlocksは現在サポートされていない.
pt_br: O servidor requer HTTPS, que não é suportado atualmente pelo MicroBlocks.
ru: Сервер ожидает HTTPS запрос, а MicroBlocks в настоящее время не поддерживает его.
tr: Sunucu HTTPS bekliyor ve MicroBlocks şu anda desteklemiyor.
uz: Server HTTPS talab qiladi va MicroBlocks hozirda uni qo'llab-quvvatlamaydi.

source: built-in library
ca: llibreria integrada
cs: vestavěná knihovna
de: Integriertes Modul
el: ενσωματωμένη βιβλιοθήκη
es: librería integrada
ja: 組み込みライブラリ
pt_br: biblioteca integrada
ru: встроенная библиотека
tr: yerleşik kütüphane
uz: o'rnatilgan kutubxona

source: Dependency path, name or URL?
ca: Camí, nom o URL de la dependència?
cs: Závislost - cesta, jméno nebo URL?
de: Abhängigkeit Pfad, Name oder URL?
el: Εξαρτωμένη διαδρομή, όνομα ή URL;
es: ¿Ruta, nombre o URL de la dependencia?
ja: 依存する場所,名前またはURLは?
pt_br: Caminho, nome ou URL da dependência?
ru: Путь зависимости, имя или URL?
tr: Bağımlılık yol, ad veya URL'si ?
uz: Bog‘lanish yo‘li, nomi yoki URL manzili?

source: If your library is in the Libraries folder in your local MicroBlocks project folder, you need to prefix it with a slash (/).
ca: Si la teva llibreria està al directori "Libraries" del teu directori local de projectes de MicroBlocks, l'has de prefixar amb una barra (/).
cs: Pokud je vaše knihovna ve složce "Libraries" ve vaší lokální složce projektu MicroBlocks, musíte název doplnit prefixem "/".
de: Wenn sich deine Bibliothek im Ordner "Bibliotheken" im lokalen MicroBlocks-Projektordner befindet, dann muss du ihr einen Schrägstrich (/) vorangestellen.
es: Si tu librería está en la carpeta "Libraries" de tu carpeta local de MicroBlocks, deberás prefijarla con una barra (/).
tr: Kütüphaneniz sizin yerel MicroBlocks projenizin klasöründeyse, önüne bir slash (/) ekleyin.

source: user library
ca: llibreria d'usuari
cs: uživatelská knihovna
de: Benutzerbibliothek
es: librería de usuario
tr: kullanıcı kütüphanesi

source: Add Library
ca: Afegir llibreria
cs: Přidat Knihovnu
de: Bibliothek hinzufügen
es: Añadir librería
tr: Kütüphane Ekle

source: Decrease block size
ca: Redueix mida dels blocs
cs: Zmenšit velikost bloku
de: verkleinere Blockgröße
es: Reduce el tamaño de los bloques
tr: Blokları küçült

source: Button
ca: Botó
cs: Tlačítko
de: Knopf
es: Botón

source: Color Input
ca: Casella de color
cs: Zadání barvy
de: Eingabe Farbe
es: Casilla de color
tr: Renk Girdisi

source: [l] edit its value, or drop a reporter into it.
ca: [l] edita'n el valor, o deixa-hi caure un reportador.
cs: [l] úprava hodnoty nebo přetažení hodnoty na pozici.
de: [l] zum Ändern des Wertes, oder zum Hineinziehen eines Rückgabeblocks.
es: [l] edita su valor, o arrastra un reportador encima.
tr: [l] değerini düzenleyin veya içine bir raportör bırakın.

source: Block Extension
ca: Fletxa d'ampliació
cs: Rozšířené bloky
de: Blockerweiterung
es: Flecha de expansión
tr: Blok Uzantısı

source: Command Block
ca: Bloc comanda
cs: Příkazový blok
de: Befehlsblock
es: Bloque de comando
tr: Komut bloğu

source: Hat Block
ca: Bloc de barret
cs: Zahajovací blok
de: Kopfblock
es: Bloque de sombrero
tr: Şapka Bloğu

source: Reporter Block
ca: Bloc reportador
cs: Blok zprávy
de: Rückgabeblock
es: Bloque reportador
tr: Raportör Bloğu

source: Script
ca: Programa
cs: Skript
de: Skipt
es: Programa
tr: Betik

source: [l] to run. [r] menu.
ca: [l] per executar-lo. [r] menú.
cs: [l] spustit. [r] menu.
de: [l] zum Starten. [r] Menü.
es: [l] para ejecutarlo. [r] menú.
tr: [l] çalıştır. [r] menü.

source: Drag to change pane width.
ca: Arrossega'l per canviar l'amplada de l'àrea.
cs: Táhnout pro změnu šířky panelu.
de: Verschiebe um die Größe des Bereichs zu ändern.
es: Arrástralo para modificar la anchura del área.
tr: Bölme genişliğini değiştirmek için sürükleyin.

source: [l] to show the blocks in this library. [r] menu.
ca: [l] per mostrar els blocs d'aquesta llibreria. [r] menú.
cs: [l] zobrazení bloků v této knihovně. [r] menu.
de: [l] zum Zeigen der Blöcke in dieser Bibliothek. [r] Menü.
es: [l] para mostrar los bloques de esta librería. [r] menú.
tr: [l] bu kütüphanedeki blokları göster. [r] menü.

source: [l] to show the blocks in this category.
ca: [l] per mostrar els blocs d'aquesta categoria.
cs: [l] zobrazení bloků této kategorie.
de: [l] zum Zeigen der Blöcke in dieser Kategorie.
es: [l] para mostrar los bloques de esta categoría.
tr: [l] bu kategorideki blokları göster.

source: Graph the value.
ca: Afegeix el valor a la gràfica.
cs: Zápis hodnotu do grafu.
de: Zeigt den Wert grafisch an.
es: Añade el valor al gráfico.
tr: Değerin grafiğini çizin.

source: Report the state of button B ( (-o) or (o-) ).
ca: Reporta l'estat del botó B ( (-o) o (o-) ).
cs: Vrátí stav tlačítka B ( (-o) or (o-) ).
de: Gibt den Zustand von Taste B zurück ( (-o) oder (o-) ).
es: Reporta el estado del botón B ( (-o) o (o-) ).
tr: B düğmesinin ( (-o) veya (o-) ) durumunu bildirin.

source: Report the milliseconds since the timer was last reset.
ca: Reporta els mil·lisegons des de l'última inicialització del temporitzador.
cs: Vrátí počet milisekund od posledního nulování časovače.
de: Gibt die Zeit in ms seit dem Zurücksetzen des Zeitgebers zurück.
es: Reporta los milisegundos des de la última inicialización del temporizador.
tr: Zamanlayıcının en son sıfırlanmasından bu yana geçen milisaniyeleri bildirin.

source: Report the microseconds since power up.
ca: Reporta els microsegons des que la placa s'ha engegat.
cs: Vrátí počet mikrosekund od zapnutí mikropočítače.
de: Gibt die Zeit in µs seit dem Einschalten zurück.
es: Reporta los microsegundos des de que se encendió la placa.
tr: Güç açıldıktan sonraki mikrosaniyeleri bildirin.
