Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: Plug in the board and click the USB icon to connect.
ca: Connecta la placa i clica la icona USB per connectar-te.
cs: Připoj mikropočítač a klikni na ikonu USB pro pčipjení.
de: Schließe das Board an und klicke zum Verbinden auf das USB-Icon.
es: Conecta la placa y haz clic en el icono USB para conectar.

source: folder;Kits and Boards
ca: Kits i plaques
cs: Stavebnice a desky
es: Kits y placas

source: stop with heading _
ca: atura't amb direcció _
es: detente con dirección _

source: delete block definition...
ca: elimina la definició del bloc...
cs: smaž definici bloku...
de: Blockdefinition löschen...
el: διαγραφή ορισμού μπλοκ
es: elimina la definición del bloque...
gl: eliminar a definición do bloque...
ja: ブロック定義を削除...
pt_br: apaga a definição do bloco...
ru: удалить определение блока
tr: blok tanımını sil...
uz: blok ta'rifini o'chirish ...

source: Octopus value of light intensity (Lux) at pin _
ca: Octopus valor de la intensitat lluminosa (Lux) al pin _
es: valor de la intensidad luminosa (Lux) en el pin _

source: find scripts or block definitions where this variable is being read
ca: cerca programes o definicions de blocs on s'estigui llegint aquesta variable
cs: najít skripty nebo bloky kde je proměnná čtena
de: sucht Skript- oder Blockdefinitionen, in denen diese Variable lesen wird
es: busca programas o definiciones de bloque en qué se esté leyendo esta variable
tr: değişkenin okunduğu scriptleri veya blok tanımlarını bulun

source: label
ca: etiqueta
cs: štítek
de: Beschriftung
el: ετικέτα
es: etiqueta
gl: etiqueta
ja: ラベル
pt_br: etiqueta
ru: метка
tr: etiket
uz: belgi

source: cutebotwheel;left
ca: esquerra
es: izquierda

source: Created with GP
ca: Creat amb GP
cs: Vytvořeno s použitím GP
de: Mit GP erstellt
el: Δημιουργήθηκε με GP
es: Creado con GP
gl: Creado con GP.
ja: GPによって作成
pt_br: Criado com GP
ru: Создано с помощью GP
tr: GP ile yaratıldı
uz: GP bilan yaratilgan

source: Copy project URL to clipboard
ca: Copia URL del projecte al porta-retalls
cs: Zkopírovat projekt z URL do schránky
de: kopiere Projekt-URL in Zwischenablage
es: Copia URL del proyecto al portapapeles

source: import data from CSV file
ca: importa dades d'arxiu CSV
cs: import dat z CSV souboru
de: importiere Daten aus CSV-Datei
es: importar datos de archivo CSV
tr: CSV dosyasından içeri veri aktar

source: cut
ca: retalla
cs: vyjmout
de: schneide aus
es: corta
tr: kes

source: Octopus sonar trig _ echo _ distance (cm)
ca: Octopus sensor de distància (cm) trigger _ echo _
es: sensor de distancia (cm) trigger _ echo _

source: sleep
ca: dorm
es: duérmete

source: get file from board
ca: descarrega arxiu de la placa
cs: načti soubor z mikropočítače
de: lade Datei vom Board
es: bajar archivo de la placa
tr: dosyayı board'dan al

source: Port name?
ar: إسم المنفذ؟
ca: Nom del port?
cs: Název portu?
de: Anschluss-Name?
el: Όνομα θύρας;
es: ¿Nombre del puerto?
gl: Nome do porto?
ja: ポート名?
pt_br: Nome da porta?
ru: Название порта?
tr: Port adı?
uz: Port nomi?

source: major
es: mayor

source: set user LED _
ar: ضبط الصمام الثنائي للمستخدم _
ca: encén LED integrat _
cs: nastav uživatelskou LED _
de: setze Nutzer-LED _
el: όρισε το LED χρήστη _
es: enciende LED integrado _
gl: acender LED integrado _
ja: LED設定 _
pt_br: coloque o LED integrado em _
ru: задать пользовательский светодиод _
tr: kullanıcı LED i _ yap
uz: foydalanuvchi LED o'rnatish _

source: say _
ar: قل _
ca: digues _
cs: ukaž _
de: sage _
el: πες _
es: di _
gl: dicir _
ja: 話す _
pt_br: mostre _
ru: сказать _
tr: söyle _
uz: aytmoq _

source: graph _
ca: afegeix a la gràfica _
cs: Graf _
de: Diagramm _
el: σχεδίασε _
es: añade al gráfico _
gl: engadir á gráfica _
ja: グラフ _
pt_br: mostre no gráfico _
ru: график
tr: grafiğini çiz _
uz: grafik _

source: cat;Input
ar: المدخلات
ca: Entrada
cs: Vstup
de: Eingabe
el: Εισόδοι
es: Entrada
gl: Entrada
ja: 入力
pt_br: Entrada
ru: Ввод
tr: Girdi
uz: Kiritish

source: button B
ar: زر ب
ca: botó B
cs: tlačítko B
de: Knopf B
el: κουμπί Β
es: botón B
gl: botón B
ja: ボタン B
pt_br: botão B
ru: кнопка B
tr: buton B
uz: B tugmasi

source: cat;Pins
ar: المنافذ
ca: Pins
cs: Piny
de: Pins
el: Ακροδέκτες
es: Pines
gl: Pins
ja: ピン
pt_br: Pinos
ru: Контакты
tr: Pinler
uz: Pins

source: pullup _
ca: amb resistència interna _
es: con resistencia interna _
ru: подтянуть _
tr: çekme direnç _

source: if _ _
ar: إذا _ _
ca: si _ _
cs: když _ _
de: falls _ _
el: Αν _ _
es: si _ _
gl: se _ _
ja: もし _ _
pt_br: se _ _
ru: если _ _
tr: eğer _ yap _
uz: agar _ _

source: range _ to _
ca: nombres de _ a _
cs: rozsah od _ do _
de: Bereich von _ bis _
es: números de _ a _
tr: aralık _ den _ kadar

source: by _
ca: en increments de _
cs: přírustek _
de: Schrittweite _
es: en incrementos de _
tr: her _

source: repeat until _ _
ar: كرر حتى _ _
ca: repeteix fins que _ _
cs: opakuj dokud _ _
de: wiederhole bis _ _
el: επανάλαβε μέχρι _ _
es: repite hasta que _ _
gl: repetir ata que _ _
ja: まで 繰り返す _ _
pt_br: repita até que _ _
ru: повторять до _ _
tr: _ _ olana kadar tekrarla
uz: _ _ gacha takrorlash

source: arg _ default _
ca: argument _ amb valor per defecte _
cs: parametr _ default _
de: Argument _ Standard _
es: parámetro _ con valor por defecto _
tr: argüman _ var sayılan _

source: call _
ca: crida _
cs: zavolej _
de: rufe _
es: llama _
ru: вызвать _
tr: _ çağır

source: function name
ca: nom de la funció
cs: jméno funkce
de: Funktionsname
es: nombre de la función
ru: название функции
tr: işlev adı

source: with _
ca: amb paràmetre(s) _
cs: s _
de: mit _
es: con parámetro(s) _
ru: с _
tr: parametreler _

source: temperature (°C)
ar: درجة الحرارة (درجة مئوية)
ca: temperatura (°C)
cs: teplota (°C)
de: Temperatur (°C)
el: Θερμοκρασία (°C)
es: temperatura (°C)
gl: temperatura (°C)
ja: 温度 (°C)
pt_br: temperatura (°C)
ru: температура (°C)
tr: ısı (°C)
uz: harorat (°C)

source: magnetic field
ca: camp magnètic
cs: magnetické pole
de: Magnetfeldstärke
es: campo magnético
ru: магнитное поле
tr: manyetik alan

source: lydian
ca: lídia
es: lidia

source: phrygian
ca: frígia
es: frigia

source: Strings
ca: Text
cs: Řetězce
de: Zeichenfolgen
es: Texto
ru: Строки

source: set DotStar brightness _
ca: fixa la brillantor dels DotStar a _
cs: setze DotStar Helligkeit _
de: setze DotStar Helligkeit _
es: fija el brillo de DotStar a _
ja: 設定 DotStar 輝度 _
pt_br: fixe o brilho do DotStar a _
ru: установить яркость DotStar _
tr: DotStar parlaklığını _ yap
uz: DotStar yorqinligini o'rnatish _

source: ms;start
ca: encén
es: arranca

source: ms sound
es: ms sonido

source: TdR set red LED _
ca: TdR posa el led vermell a _
es: TdR pon el LED rojo a _

source: TdR set RGB LED _
ca: TdR posa el led RGB a _
es: TdR pon el LED RGB a _

source: TdR set blue LED _
ca: TdR posa el led blau a _
es: TdR pon el LED azul a _

source: Imagina stop servo _
ca: Imagina atura el servo _
es: Imagina detén el servo _

source: at _ % speed
ca: al _ % de la velocitat
es: al _ % de la velocidad

source: 3dBot set speed at _ %
ca: 3dBot fixa la velocitat a _ %
es: 3dBot pon la velocidad al _ %

source: 3dBot line on _ ?
ca: 3dBot _ en la línia?
es: 3dBot _ en la línea?

source: current (mA)
ca: corrent (mA)
es: corriente (mA)

source: MQTT pub topic _ payload _
ca: publica al tema d'MQTT _ el contingut _
cs: MQTT publikuj topic _ payload _
es: publica al tema de MQTT _ el contenido _

source: MQTT sub _
ca: subscriu-te al tema d'MQTT _
cs: MQTT přihlas _
es: suscríbete al tema de MQTT _

source: MQTT unsub _
ca: abandona el tema d'MQTT _
cs: MQTT odhlas _
es: abandona el tema de MQTT _

source: payload for MQTT event _
ca: contingut de l'esdeveniment MQTT _
cs: payload pro MQTT událost _
es: contenido del evento MQTT _

source: The MicroBlocks in your board is not current
ca: El MicroBlocks instal·lat a la teva placa no està actualitzat
cs: Verze MicroBlocks v mikropočítači není aktuální
de: Die MicroBlocks-Version auf deinem Board ist nicht aktuell
el: Το Microblocks στην κάρτα σου δεν είναι το τελευταίο
es: El MicroBlocks instalado en tu placa no está actualizado
ja: ボードのMicroBlocksが最新ではありません
pt_br: O MicroBlocks instalado na placa não está atualizado
ru: MicroBlocks на вашей плате устаревшая
tr: Karttaki MicroBlocks güncel değil
uz: Platangizdagi MickroBlocks versiyasi oxirgisi emas

source: show blocks and variables that are internal to libraries (i.e. those whose name begins with underscore)
ca: mostra els blocs i variables que siguin interns a les llibreries (aquells que el nom comença amb guió baix)
cs: zobrazovat interní bloky a proměnné knihoven (t.j. začínající znakem _ )
de: zeige Blöcke und Variablen aus internen Bibliotheken an (d. h. solche, deren Name mit einem Unterstrich beginnt)
es: mostrar los bloques y variables internos de las librerias (aquellos cuyo nombre comienza con guión bajo)

source: when plugging a board, automatically read its contents into the IDE if the current project is empty
ca: en connectar una placa, llegeix-ne els continguts automàticament si el projecte actual és buit
cs: načíst automaticky bloky z mikropočítače i když je aktuální projekt prázdný
de: Wenn das aktuelle Projekt leer ist den Inhalt des Boards nach Anschließen automatisch in die IDE einlesen.
es: al conectar una placa, lee automáticamente sus contenidos si el proyecto actual está en blanco

source: show advanced blocks
ar: إظهار الكتل المتقدمة
ca: mostra els blocs avançats
cs: zobrazit pokročilé bloky
de: zeige fortgeschrittene Blöcke
el: δείξε προχωρημένα blocks
es: muestra los bloques avanzados
gl: amosar os bloques avanzados
ja: 高度なブロックを表示
pt_br: mostra os blocos avançados
ru: показать расширенные блоки
tr: gelişmiş blokları göster
uz: yetakchi bloklarni ko'rsatish

source: clear graph
ca: neteja gràfica
cs: smazat graf
de: lösche Graphen
es: limpiar gráfico
tr: grafiği temizle

source: zero at bottom
ca: zero a baix
cs: 0 dole
de: setze Nulllinie nach unten
es: cero abajo

source: zero in middle
ca: zero al mig
cs: 0 uprostřed
de: setze Nulllinie mittig
es: cero en el medio

source: put file on board
ca: carrega arxiu a la placa
cs: ulož soubor do mikropočítačw
de: sende Datei ans Board
es: subir archivo a la placa
tr: dosyayı board'a koy

source: downloaded
ca: descarregat
cs: staženo
de: heruntergeladen
es: bajado
tr: indirilmiş

source: script;delete
ar: حذف
ca: elimina
cs: vymazat
de: löschen
el: διαγραφή
es: elimina
gl: eliminar
ja: 削除
pt_br: apaga
ru: удалить
tr: sil
uz: o'chirish

source: folder;Graphics and Displays
ca: Gràfics i pantalles
cs: Grafika a displeje
es: Gráficos y pantallas

source: folder;Robots
ca: Robots
cs: Roboti
es: Robots

source: If you are adding a library that's built into MicroBlocks, you can just enter its name.
ca: Si vols afegir una llibreria interna de MicroBlocks, només cal que n'escriguis el nom.
cs: Při přidání knihovny která je vestavěna v MicroBlocks lze zadat pouze její jméno.
de: Wenn du eine Bibliothek hinzufügst, die in MicroBlocks integriert ist, kannst Du ihren Namen eingeben.
es: Si quieres añadir una librería interna de MicroBlocks, simplemente introduce su nombre.
tr: MicroBlocks'da zaten bulununan bir kütüphaneyse, sadece ismini girmeniz yeterli.

source: If the library is hosted online, please input its full URL.
ca: Si la llibreria està hostatjada a Internet, introdueix la seva URL completa.
cs: Pokud je knihovna hostována online, je třeba zadat celou URL adresu.
de: Wenn die Bibliothek online gehostet wird, ist die vollständige URL einzugeben.
es: Si la librería está hospedada en Internet, introduce su URL completa.
tr: Eğer online bir kütüphaneyse, lütfen URL'nin tamamını girin.

source: Pulse width modulate (PWM) a pin with the given duty cycle (0 - 1023).
ca: Modula per amplada de polsos (PWM) un pin amb un cicle de treball determinat (0 - 1023).
cs: Nastavení šířky PWM pulzu na výstupním pinu (0-1023).
de: Erzeugt ein pulsweitenmoduliertes Signal (PWM) an einem Pin mit dem angegebenen Zyklus (0 - 1023).
es: Modula por amplitud de pulsos (PWM) un pin con un ciclo de trabajo determinado (0 - 1023).
tr: Verilen görev döngüsü (0 - 1023) ile bir pin darbe genişliği modülasyonu (PWM).

source: Report number of analog pins on this device.
ca: Reporta el número de pins analògics en aquest dispositiu.
cs: Vrátí počet analogových pinů mikropočítače/desky.
de: Gibt die Anzahl analoger Pins auf dem Gerät zurück.
es: Reporta el número de pines analógicos en este dispositivo.
tr: Bu cihazdaki analog pin sayısını bildir.

source: Report the given number shifted right by the given number of bits (arithmetic shift; sign is maintained).
ca: Reporta el nombre especificat desplaçat aritmèticament cap a la dreta el nombre de bits especificat.
cs: Vrátí hodnotu čísla posunutou doprava o zadaný počet bitů (aritmetický posun, znaménko zůstává zachováno).
de: Gibt die Zahl zurück, die aus der bitweisen Verschiebung der Eingabe um die angegebene Anzahl von Bits nach rechts entsteht (arithmetische Verschiebung; Vorzeichen bleibt erhalten).
es: Reporta el número especificado desplazado aritméticamente hacia la derecha el número de bits especificado.
tr: Verilen sayıyı verilen bit sayısı kadar sağa kaydırın (arıtmetik kaydırma, işaret korunur).

source: Set a variable to the given value.
ca: Posa el valor especificat a una variable.
cs: Nastaví proměnnou na danou hodnotu.
de: Weist der Variable den angegebenen Wert zu.
es: Fija una variable al valor especificado.
tr: Bir değişkeni verilen değere ayarlayın.

source: Change a variable by the given amount.
ca: Canvia el valor d'una variable en la quantitat especificada.
cs: Změní proměnnou o danou hodnotu.
de: Ändert den Wert der Variable um den angegebenen Wert.
es: Cambia el valor de una variable en la cantidad especificada.
tr: Bir değişkeni verilen değerde değiştirin.

source: go!
ca: endavant!
cs: jdi!
de: los!
es: adelante!
tr: başla!

source: How this works...
ca: Així funciona...
cs: Jak toto funguje...
de: Es funktioniert so ...
es: Así funciona...
ru: Как это работает...
tr: Bu nasıl çalışır...

source: Hello!
ca: Hola!
cs: AHOJ!
es: ¡Hola!
tr: Merhaba!

source: radio receive packet _
ca: rep paquet per ràdio _
cs: přijmi packet _ rádia
de: Radio empfange Paket _
el: ράδιο λήψη πακέτου _
es: recibe paquete por radio _
gl: recepción de paquetes por radio _
pt_br: receba pacote por rádio _
ru: получение радио пакета _
tr: radyo paket al _
uz: radio qabul qilish paketi _

source: PIR
ca: Sensor de presència
es: Sensor de movimiento
ja: 人感赤外線センサー
pt_br: Sensor de movimento

source: PIR at pin _ detected movement
ca: Moviment detectat pel PIR al pin _
cs: PIR na pinu _ zjištěn pohyb
de: PIR an PIN _ Bewegung erkennt
el: PIR στον ακροδέκτη _ ανίχνευσε κίνηση
es: Movimiento detectado por PIR en pin _
ja: 人感赤外線センサー ピン _ 動きを検知
pt_br: Movimento detectado por PIR no pino _
ru: PIR
tr: _ pinine bağlı PIR hareket algıladı
uz: PIR da aniqlangan harakat

source: humm;Light
ca: Llum
cs: Světlo
de: Licht
el: Φως
es: Luz
gl: Luz
ja: 光量
pt_br: Luz
ru: Свет
tr: Işık
uz: Yorug'lik

source: Finch _ Encoder
ca: recompte de voltes _
de: Finch _ Kodierer
es: recuento de vueltas _
ja: Finch _ エンコーダ
pt_br: contador de voltas _
ru: Кодировщик _ Finch
tr: Finch _ Enkoder

source: Finch Accelerometer _
ca: acceleròmetre _
de: Finch Beschleunigungssensor _
el: Finch Επιταχυνσιόμετρο _
es: acelerómetro
ja: Finch 加速度 _
pt_br: acelerômetro do Finch _
ru: Ускоритель Finch
tr: Finch ivmeölçer _

source: receive IR code
ca: rep codi IR
cs: přijmi IR kód
de: empfange IR-Code
el: λήψη κωδικού IR
es: recibe código IR
gl: recibir código IR dende
ja: IR コード受信
pt_br: receba código IR
ru: получение ИК-кода
tr: IR kod oku
uz: qurilmadan IR kodni qabul qilish

source: target
ca: diana
cs: cíl
de: Ziel
es: diana

source: left triangle
ca: triangle rectangle
cs: levý trojúhelník
de: rechtwinkliges Dreieck
es: triángulo rectángulo

source: chess board
ca: escacs
cs: šachovnice
de: Schachbrett
es: ajedrez

source: initialize spi _ d/c pin# _ reset pin# _ flip _
ca: inicialitzar spi _ d/c pin# _ reset pin# _ girar _
cs: aktivuj OLED SPI _ adresa (hex) _ reset pin# _ otoč _
es: inicializar spi _ d/c pin# _ reset pin# _ girar _
ru: инициализировать spi _ контакт данных# _ контакт сброса# _ перевернуть _

source: write _ at x _ y _ inverse _
ca: mostrar _ a x _ y _ invertir _
cs: OLED napiš _ na x _ y _ inverze
es: mostrar _ en x _ y _ invertir _
ru: писать текст _ в x _ y _ инвертировать _

source: set contrast (1-4) _
ca: configurar el contrast (1-4) _
cs: nastav kontrast OLED (1-4) _
es: establecer contraste (1-4) _
ru: установить контраст (1-4) _

source: draw circle at x _ y _ radius _ erase _
ca: dibuixar cercle en x _ i _ radi _ esborrar _
cs: OLED nakresli kružnici střed x _ y _ poloměr _ výmaz
es: dibujar círculo en x _ y _ radio _ borrar _
ru: рисовать круг в x _ y _ радиус _ стереть _

source: TFT height
ca: alçada de la pantalla TFT
cs: TFT výška
de: TFT-Höhe
el: TFT ύψος
es: alto de la pantalla TFT
ja: TFT 高さ
pt_br: altura do TFT
ru: Высота TFT
tr: TFT yüksekliği
uz: TFT balandligi

source: set TFT pixel x _ y _ to _
ca: pinta el píxel x _ y _ de color _
cs: nastav TFT-Pixel x _ y _ na _
de: setze TFT-Pixel x _ y _ auf _
el: Όρισε TFT εικονοκύταρο x _ y _ σε _
es: pinta el píxel x _ y _ de color _
gl: poñer o píxel x _ y _ da cor _
ja: TFT 画素設定 x _ y _ に _ を
pt_br: pinte o píxel x _ y _ com a cor _
ru: задать пиксели TFT x _ y _ на _
tr: TFT x _ y _ pikselini _ yap
uz: x _ y _ ga _ TFT piksel o'rnatish

source: draw rectangle on TFT at x _ y _ width _ height _ color _
ca: dibuixa rectangle a x _ y _ amplada _ alçada _ color _
cs: nakresli na TFT obdélník na x _ y _ šířka _ výška _ barva _
de: zeichne Rechteck auf TFT bei x _ y _ Breite _ Höhe _ Farbe _
el: σχεδίασε τετράγωνο στο TFT στο x _ y _ πλάτος _ ύψος _ χρώμα _
es: dibuja rectángulo en x _ y _ ancho _ alto _ color _
ja: TFT上に四角形を描く 位置 x _ y _ 幅 _ 高さ _ 色 _
pt_br: desenhe retângulo em x _ y _ largura _ altura _ com cor _
ru: нарисовать прямоугольник на TFT при x _ y _ ширина _ высота _ цвет _
tr: TFT dikdörtgen başla x _ y _ genişlik _ yükseklik _ renk _
uz: To’rtburchakni TFT ga x _ y _ kenglik _ balandlik _ rangda chizing

source: draw circle on TFT at x _ y _ radius _ color _
ca: dibuixa cercle a x _ y _ radi _ color _
cs: nakresli na TFT kružnicí se středem x _ y _ poloměr _ barva _
de: zeichne Kreis auf TFT bei x _ y _ Radius _ Farbe _
el: σχεδιάσε κύκλο στο TFT στο x _ y _ ακτίνα _ χρώμα _
es: dibuja círculo en x _ y _ radio _ color _
ja: TFT上に円を描く, 位置 x _ y _ 半径 _ 色 _
pt_br: desenhe círculo em x _ y _ raio _ com cor _
ru: нарисовать круг на TFT в x _ y _ радиус _ цвет _
tr: TFT daire merkez x _ y _ çap _ renk _
uz: doirani TFT ga _ radiusda _ rangda chizish

source: filled _
ca: ple _
cs: vyplněno _
de: ausgefüllt _
el: Γέμιση _
es: lleno _
ja: 埋める _
pt_br: preenchido _
ru: заполнено _
tr: dolu _
uz: to'ldirilgan _

source: scale _ wrap _
ca: escala _ amb salts de línia _
cs: měřítko _ zalomení _
de: Größe _ Zeilenumbruch _
el: κλίμακα _ αναδίπλωση _
es: escala _ con saltos de línea _
ja: 拡大 _ ラップ _
pt_br: escale _ com saltos de linha _
ru: масштаб _ перенести _
tr: ölçek _ başa sar _
uz: o'lchov _

source: random color
ca: color a l'atzar
cs: náhodná barva
de: zufällige Farbe
el: τυχαίο χρώμα
es: color al azar
ja: ランダムの色
pt_br: cor aleatória
ru: случайный цвет
tr: rastgele renk
uz: tasodifiy rang

source: color r _ g _ b _ (0-255)
ar: اللون أحمر _ أخضر _ أزرق _
ca: color vermell _ verd _ blau _ (0-255)
cs: barva R _ G _ B _ (0-255)
de: Farbe R _ G _ B _ (0-255)
el: χρώμα κ _ π _ μ _ (0-255)
es: color r _ v _ a _ (0-255)
ja: 色 R _ G _ B _ (0-255)
pt_br: cor r _ g _ b _ (0-255)
ru: цвета r _ g _ b _ (0-255)
tr: renk r _ g _ b _ (0-255)
uz: rang r _ g _ b _ (0-255)

source: Fractions
ca: Fraccions
cs: Zlomky
de: Brüche
es: Fracciones
ru: Дроби

source: play ringtone _
ca: toca el politò _
cs: přehraj vyzvánění _
de: spiele Klingelton _
es: toca el politono _
ru: воспроизвести рингтон _

source: current song name
ca: títol de la cançó actual
cs: název aktuální písně
de: aktueller Klingelton
es: título de la canción actual
ru: текущее название композиции

source: play WAV file _
ca: reprodueix arxiu WAV _
cs: přehrej WAV soubor _
de: spiele WAV-Datei _
es: reproduce el archivo WAV _

source: filename
ca: nom d'arxiu
cs: soubor
de: Dateiname
es: nombre de archivo

source: wait until next _ duration
ca: espera fins la propera durada _
es: espera hasta la próxima duración _

source: wait until bar _
ca: espera fins al compàs _
de: warte bis Takt _
es: espera hasta el compás _

source: Splash Cymbal
ca: Plat splash
es: Plato splash

source: Hi Bongo
ca: Bongo agut
es: Bongo agudo

source: Mute Hi Conga
ca: Conga aguda sorda
es: Conga aguda sorda

source: Open Hi Conga
ca: Conga aguda oberta
es: Conga aguda abierta

source: Hi Wood Block
ca: Caixa xinesa aguda
es: Caja china aguda

source: Claves
ca: Bastons
es: Clave

source: Open Triangle
ca: Triangle obert
es: Triángulo abierto

source: chromatic percussion
ca: percussió cromàtica
es: percusión cromática

source: reed
ca: vent de canya
es: viento caña

source: synth pad
ca: sintetitzador ambient
es: sintetizador ambiente

source: standard
ca: estàndard
es: estándar

source: room
ca: estudi
es: estudio

source: pipe
ca: vent fusta
es: viento fusta

source: power
ca: potent
es: potente

source: bank select 1
ca: selecció de banc 1
es: selección de banco 1

source: modulation
ca: modulació
es: modulación

source: portamento time
ca: temps de portamento
es: tiempo de portamento

source: resonance
ca: ressonància
es: resonancia

source: release time
ca: temps d'extinció
es: tiempo de extinción

source: vibrato depth
ca: intensitat del vibrato
es: intensidad del vibrato

source: play MIDI note _ for _ ms on channel _ volume _
ca: toca nota MIDI _ durant _ ms al canal _ volum _
de: spiele MIDI-Note _ für _ ms auf Kanal _ Lautstärke _
es: toca nota MIDI _ durante _ ms en el canal _ #BR# volumen _

source: note _ octave _ to MIDI key
ca: nota _ octava _ a tecla MIDI
es: nota _ octava _ a tecla MIDI

source: select MIDI instrument _ number _ for channel _
ca: selecciona instrument MIDI _ número _ pel canal _
es: selecciona instrumento MIDI _ número _ para el canal _

source: select MIDI drum kit _
ca: selecciona bateria MIDI _
es: selecciona batería MIDI _

source: play MIDI drum _ for _ ms volume _
ca: toca percussió MIDI _ durant _ ms volum _
es: toca percusión MIDI _ durante _ ms volumen _

source: drum _
ca: percussió _
es: percusión _

source: change MIDI control _ on channel _ to _
ca: posa control MIDI _ del canal _ a _
es: pon control MIDI _ del canal _ a _

source: send MIDI reset
ca: reinicialitza MIDI
es: reinicializa MIDI

source: Scales & Chords
ca: Escales i acords
es: Escalas y acordes

source: minor
ca: menor
es: menor

source: _ chord root _
ca: acord _ amb arrel _
es: acorde _ con raíz _

source: _ chord for root _
ca: acord _ per a arrel _
es: acorde _ para raíz _

source: improvised arpeggio over _ for _ bars with durations _
ca: arpegi improvisat sobre _ durant _ compassos amb durades _
es: arpegio improvisado sobre _ durante _ compases con duraciones _

source: rotation _ of circle of 5ths _ M _ m _ º
ca: rotació _ del cercle de quintes _ M _ m _ º
es: rotación _ del círculo de quintas _ M _ m _ º

source: Square Wave Chords
ca: Acords d'onda quadrada
es: Acordes de onda cuadrada

source: play chord _ for _ ms
ca: reproduir acord _ durant _ ms
es: reproducir acorde _ durante _ ms

source: set digital chord pins _ _ _
ca: establir pins digitals _ _ _ per a acord
es: establecer pines digitales _ _ _ para acorde

source: Turtle
ca: Tortuga
cs: Želva
el: Χελώνα
es: Tortuga
ja: ウミガメ
pt_br: Tartaruga
ru: Черепаха
tr: Kaplumbağa
uz: Toshbaqa
