Repository: KittenBot/smallvm
Catalog: translations/*.po
Languages: ar, ca, cs, de, el, es, gl, ja, pt_br, ru, tr, uz

source: stick figure
ca: persona
de: Strichmännchen
es: persona

source: umbrella
ca: paraigua
cs: deštník
de: Regenschirm
es: paraguas

source: cow
ca: vaca
cs: kráva
de: Kuh
es: vaca

source: pitchfork
ca: forca
cs: vidle
de: Heugabel
es: horca

source: draw line from x _ y _ to x _ y _ erase _
ca: dibuixar una línia de x _ y _ a x _ y _ esborrar _
cs: OLED nakresli přímku z bodu x _ y _ do x _ y _ výmaz _
es: dibujar una línea desde x _ y _ hasta x _ y _ borrar _
ru: рисовать линию от x _ y _ к x _ y _ стереть _

source: draw rectangle x _ y _ w _ h _ erase _ rounding(3-15) _
ca: dibuixar un rectangle x _ y _ amplada _ alçada _ esborrar _ arrodoniment (3-15) _
cs: OLED nakresli obdélník x _ y _ š _ d _ výmaz _ zaoblení (3-15) _
es: dibujar un rectángulo x _ y _ ancho _ alto _ borrar _ redondeado (3-15) _
ru: рисовать прямоугольник x _ y _ шир _ выс _ стереть _ скругление(3-15) _

source: fill rectangle x _ y _ w _ h _ erase _
ca: dibuixar un rectangle sòlid x _ y _ amplada _ alçada _ esborrar _
cs: OLED vyplň obdélník x _ y _ š _ d _ výmaz _
es: dibujar un rectángulo sólido x _ y _ ancho _ alto _ borrar _
ru: заполнить прямоугольник x _ y _ шир _ выс _ стереть _

source: TFT width
ca: amplada de la pantalla TFT
cs: TFT šířka
de: TFT-Breite
el: TFT πλάτος
es: ancho de la pantalla TFT
ja: TFT 幅
pt_br: largura do TFT
ru: Ширина TFT
tr: TFT genişliği
uz: TFT kengligi

source: fract _ < _
ca: frac _ < _
cs: zlomek _ < _
de: Bruch _ < _
es: frac _ < _
ru: дробь _ < _

source: play midi key _ for _ ms
ca: toca la tecla MIDI _ durant _ ms
cs: hraj MIDI notu _ po _ ms
de: spiele MIDI-Note _ für _ ms
el: παίξε πλήκτρο midi _ για _ ms
es: toca la tecla MIDI _ durante _ ms
gl: tocar a tecla MIDI _ durante _ ms
ja: midiキーを再生 _ 長さ _ ミリ秒
pt_br: toque a tecla MIDI _ por _ ms
ru: воспроизвести клавишу midi _ в течение _ мс
tr: mıdı çal nota _ süre _ milisaniye
uz: midi tugmachasini _ ms ijro etish

source: nt;c
ca: do
cs: c
es: do

source: nt;c#
ca: do#
cs: c#
es: do#

source: nt;d
ca: re
cs: d
es: re

source: nt;e
ca: mi
cs: e
es: mi

source: nt;f
ca: fa
cs: f
es: fa

source: nt;f#
ca: fa#
cs: f#
es: fa#

source: nt;a
ca: la
cs: a
es: la

source: nt;a#
ca: la#
cs: a#
es: la#

source: nt;b
ca: si
cs: b
es: si

source: Rhythm
ca: Ritme
cs: Rytmus
de: Rythmus
es: Ritmo

source: nt;g
ca: sol
cs: g
es: sol

source: nt;g#
ca: sol#
cs: g#
es: sol#

source: Hand Clap
ca: Aplaudiment
es: Palmada

source: Electric Snare
ca: Caixa elèctrica
es: Caja eléctrica

source: High Floor Tom
ca: Goliat agut
es: Goliat agudo

source: High Timbale
ca: Timbala aguda
es: Timbal agudo

source: Short Whistle
ca: Xiulet curt
es: Silbato corto

source: Long Whistle
ca: Xiulet llarg
es: Silbato largo

source: expression
ca: expressió
es: expresión

source: hold
ca: temps de sosteniment
es: tiempo de sostenido

source: vibrato delay
ca: retard del vibrato
es: retraso del vibrato

source: effect 2
ca: efecte 2
es: efecto 2

source: send MIDI continue playing
ca: reprèn seqüenciador MIDI
es: reanuda secuenciador MIDI

source: minor 7th
ca: 7ª menor
es: 7ª menor

source: tone pin
ca: pin de brunzidor
es: pin de zumbador

source: _ scale root _
ca: escala _ amb arrel _
es: escala _ con raíz _

source: improvise over _ for _ bars with durations _ on _ _ volume _
ca: improvisa sobre _ durant _ compassos amb durades _ al _ _ volum _
es: improvisa sobre _ durante _ compases con duraciones _ en el _ _ volumen _

source: _ transposed _ semitones
ca: _ transposat _ semitons
es: _ transportado _ semitonos

source: move _
ca: mou-te _ passes
cs: jdi _
de: gehe _
el: προχώρα _
es: muévete _ pasos
ja: 移動 _
pt_br: mova _ passos
ru: двигать
tr: git _
uz: ko'chirish _

source: pen down
ca: abaixa el llapis
cs: pero dolů
de: Stift runter
el: πέννα κάτω
es: baja el lápiz
ja: ペンを下ろす
pt_br: baixe o lápis
ru: перо опустить
tr: kalemi bastır
uz: qalam pastga

source: pen up
ca: apuja el llapis
cs: zvedni pero
de: Stift hoch
el: πέννα πάνω
es: sube el lápiz
ja: ペンを上げる
pt_br: suba o lápis
ru: поднять перо
tr: kalemi kaldır
uz: qalam yuqoriga

source: set pen color to _
ca: fixa el color del llapis a _
cs: nastav barvu pera na _
de: setze Stiftfarbe auf _
el: όρισε την πέννα στο χρώμα _
es: fija el color del lápiz a _
ja: ペンの色を設定 _
pt_br: fixe a color do lápis em _
ru: установить цвет пера на _
tr: kalem rengini _ yap
uz: qalam rangini _ ga belgilash

source: set pen to random color
ca: tria un color a l'atzar per al llapis
cs: nastav náhodnou barvu pera
de: setze zufällige Stiftfarbe
el: όρισε την πέννα σε τυχαίο χρώμα
es: fija un color al azar para el lápiz
ja: ペンの色をランダムに設定
pt_br: fixe uma cor aleatória para o lápis
ru: установить цвет пера на случайный
tr: kalem rengini rastgele yap
uz: qalamni tasodifiy rangga qo'ying

source: fill display with _
ca: omple la pantalla de color _
cs: vyplň obrazovku _
de: fülle Display mit _
el: γέμισε την οθόνη με _
es: llena la pantalla de color _
ja: 表示を埋める _
pt_br: preencha a tela com a cor _
ru: заполнить дисплей с _
tr: ekranı _ ile doldur
uz: displeyni _ bilan to'ldiring

source: go to x _ y _
ca: ves a x _ y _
cs: jdi na x _ y _
de: gehe zu x _ y _
el: προχώρα στο x _ y _
es: ve a x _ y _
ja: 移動する x _ y _
pt_br: vá para x _ y _
ru: перейти к х _ у _
tr: x _ y _ konumuna git
uz: x _ y _ ga o'tish

source: point in direction _
ca: apunta en direcció _
cs: směr _
de: zeige Richtung _
el: σημείο στην κατεύθυνση _
es: apunta en dirección _
ja: 点の方向 _
pt_br: aponte na direção _
ru: указать в направлении _
tr: _ yönüne dön
uz: yo'nalish bo'yicha nuqta _

source: open file _
ca: obre l'arxiu _
cs: otevři soubor _
de: öffne Datei _
el: άνοιξε αρχείο _
es: abre archivo _
ja: ファイルを開く _
pt_br: abra arquivo _
ru: открыть файл _
tr: _ dosyasını aç
uz: faylni ochish

source: close file _
ca: tanca l'arxiu _
cs: zavři soubor _
de: schließe Datei _
el: κλείσε αρχείο _
es: cierra archivo _
ja: ファイルを閉じる _
pt_br: feche arquivo _
ru: закрыть файл _
tr: _ dosyasını kapat
uz: faylni yopish

source: append line _ to file _
ca: afegeix línia _ a l'arxiu _
cs: přidej řádek _ do souboru _
de: füge Zeile _ in Datei _ an
el: πρόσθεσε γραμμή _ στο αρχείο _
es: añade línea _ al archivo _
ja: 行を追加 _ ファイル _
pt_br: adicione linha _ no arquivo _
ru: добавить строку _ в файл _
tr: _ satırı _ dosyasına ekle
uz: _ fayliga _ qatorini qo'shish

source: file names
ca: noms d'arxius
cs: jménAa souborů
de: Dateiname
el: όνομα αρχείων
es: nombres de archivos
ja: ファイル名
pt_br: nomes de arquivos
ru: имена файлов
tr: dosya adları
uz: fayl nomlari

source: in directory _
ca: al directori _
cs: v adresáři _
de: im Ordner _
es: en el directorio _

source: size of file _
ca: mida de l'arxiu _
cs: velikost souboru _
de: Größe der Datei _
el: μέγεθος του αρχείου _
es: tamaño del archivo _
ja: ファイルサイズ _
pt_br: tamanho do arquivo _
ru: размер файла _
tr: _ dosyasının ebadı
uz: fayl hajmi _

source: file system info
ca: dades del sistema de fitxers
cs: informace os systému souborů
de: Dateisystem-Information
el: πληροφορίες για αρχεία συστήματος
es: detalles del sistema de archivos
ja: ファイルシステムの情報
pt_br: detalhes do sistema de arquivos
ru: информация о файловой системе
tr: dosya sistemi bilgisi
uz: fayl tizimi haqida ma'lumot

source: _ begins with _
ca: _ comença per _
cs: _ začíná textem _
de: _ begint mit _
es: _ empieza por _
ru: _ начинается со строки _

source: _ contains _
ca: _ conté _
cs: _ obsahuje text _
de: _ enthält _
es: _ contiene _
ru: _ содержит строку _

source: unicodes _
ca: unicodes de _
de: Unicode von _
es: unicodes de _

source: IP _ gateway _ subnet _
ca: IP _ passarel·la _ subxarxa _
cs: IP _ brána _ maska _
de: IP _ Gateway _ Netzmaske _
es: IP _ pasarela _ subred _

source: wifi create hotspot _ password _
ca: crea punt d'accés wifi _ amb contrasenya _
cs: WiFi vytvoř hotspot _ heslo _
de: WiFi öffne Hotspot _ Passwort _
el: wifi δημιούργησε hotspot _ κωδικός _
es: crea punto de acceso wifi _ con contraseña _
gl: crear punto de acceso WiFi _ co contrasinal _
ja: WiFiスポットを作成 _ パスワード _
pt_br: crie um ponto de acesso wifi _ com a senha _
ru: Wi-Fi создать точку доступа _ пароль _
tr: wifi erişim noktası oluştur SSID _ şifre _
uz: wifi hotspot yaratish _ parol _

source: Button Events
ca: Esdeveniments de botó
cs: Události tlačítek
de: Knopf Ereignisse
el: κουμπί Συμβάντα
es: Eventos de botón
ja: ボタンイベント
pt_br: Eventos de botão
ru: События кнопки
tr: Buton Olayları
uz: Tugma hodisalr

source: Circuit Playground set speaker _
ca: posa l'altaveu de la Circuit Playground a _
cs: Circuit Playground setze Lautsprecher _
de: Circuit Playground setze Lautsprecher _
el: Circuit Playground όρισε το μεγάφωνο _
es: pon el altavoz de la Circuit Playground a _
ja: Circuit Playground スピーカの設定 _
pt_br: fixe o alto-falante do Circuit Playground em _
ru: Схема игровой площадки комплект динамиков _
tr: Circuit Playground hoparlörü _ yap
uz: Circuit Playground dinamikni o'rnatish _

source: Circuit Playground slide switch
ca: interruptor de la Circuit Playground
cs: Circuit Playground Schiebeschalter
de: Circuit Playground Schiebeschalter
el: Circuit Playground κουμπί κύλισης
es: interruptor de la Circuit Playground
ja: Circuit Playground スライドスイッチ
pt_br: interruptor do Circuit Playground
ru: Слайд-переключатель Circuit Playground
tr: Circuit Playground sürgülü anahtar
uz: Circuit Playground slaydni almashtirish

source: set DotStar LED _ to r _ g _ b _
ca: posa el LEDs DotStar _ a vermell _ verd _ blau _
cs: setze DotStar LED _ auf r _ g _ b _
de: setze DotStar LED _ auf r _ g _ b _
es: pon el LED DotStar _ a rojo _ verde _ azul _
ja: 設定 DotStar LED _ を r _ g _ b _
pt_br: fixe o LED DotStar _ em vermelho _ verde _ azul _
ru: установите DotStar LED _ на r _ g _ b _
tr: DotStar LED _ yi k _ y _ m _ yap
uz: DotStar LED _ r _ g _ b _ ga belgilash

source: bme280 humidity
ca: humitat del bme280
cs: bme280 vlhkost
de: BME280 Luftfeuchtigkeit
el: bme280 υγρασία
es: humedad del bme280
ja: bme280 湿度
pt_br: umidade do bme280
ru: влажность bme280
tr: bme280 nemi
uz: bme280 namlik

source: TCS34725 rgb
ca: color RGB del TCS34725
el: TCS34725 κπμ
es: color RGB del TCS34725
pt_br: cor RGB do TCS34725
tr: TCS34725 kym

source: bmx280 temperature
ca: temperatura del bmx280
cs: bmx280 teplota
de: BMX280 Temperatur
el: bmx280 θερμοκρασία
es: temperatura del bmx280
ja: bmx280 温度
pt_br: temperatura do bmx280
ru: bmx280 температура
tr: bmx280 ısısı
uz: bmx280 harorati

source: temperature (Celsius) DHT11 pin _
ca: temperatura (°C) del DHT11 al pin _
cs: teplota (Celsius) DHT11 Pin _
de: Temperatur (Celsius) DHT11 Pin _
el: θερμοκρασία (Κελσίου) DHT11 ακροδέκτης _
es: temperatura (ºC) del DHT11 en pin _
ja: 温度 (Celsius) DHT11 ピン _
pt_br: temperatura (°C) do DHT11 no pino _
ru: температура (С) DHT11 pin _
tr: ısı(Celsius) DHT11 pin _
uz: harorat (C) DHT11 pin _

source: humidity DHT11 pin _
ca: humitat del DHT11 al pin _
cs: vlhkost DHT11 Pin _
de: Luftfeuchtigkeit DHT11 Pin _
el: υγρασία DHT11 ακροδέκτης _
es: humedad del DHT11 en pin _
ja: 湿度 DHT11 ピン _
pt_br: umidade do DHT11 no pino _
ru: влажность DHT11 pin _
tr: nem DHT11 pin _
uz: namlik DHT11 pin _

source: read PN532 RFID
ca: llegeix RFID PN532
cs: čti PN532 RFID
de: lies PN532 RFID
el: διάβασε PN532 RFID
es: lee RFID PN532
ja: 読み取り PN532 RFID
pt_br: leia RFID PN532
ru: читать PN532 RFID
tr: PN532 RFID oku
uz: PN532 RFID o'qish

source: Touch Screen
ca: Pantalla tàctil
cs: Dotyková obrazovka
es: Pantalla táctil

source: TFT touch X position
ca: posició X del toc a la TFT
cs: TFT dotek X souřadnice
de: TFT Berührungsstelle x-Position
es: posición X del toque a la TFT

source: _ data _ to http #SVG#colon-double-slash _
ca: petició _ amb dades _ a http #SVG#colon-double-slash _
cs: _ data _ URL http #SVG#colon-double-slash _
de: _ Daten _ URL http #SVG#colon-double-slash _
es: petición _ con contenido _ a http #SVG#colon-double-slash _
ja: _ データを _ へ http #SVG#colon-double-slash _
pt_br: pedido _ com o conteúdo _ a #SVG#colon-double-slash _
tr: _ veri _ http #SVG#colon-double-slash _

source: MicroBlocks is fun
ca: MicroBlocks és divertit
cs: Microblocks je fajn
de: MicroBlocks macht Spaß
es: MicroBlocks es divertido

source: respond _ to HTTP request
ca: respon _ a la sol·licitud HTTP
cs: odpověď _ na HTTP požadavek
de: antworte _ auf HTTP-Anfrage
el: απάντηση _ σε HTTP αίτηση
es: responde _ a la petición HTTP
ja: HTTPリクエストの応答 _
pt_br: responda _ ao pedido HTTP
ru: ответить _ на запрос HTTP
tr: HTTP isteğini _ yanıtla
uz: _ HTTP so'roviga javob berish

source: payload for WebSocket event _
ca: càrrega útil de l'esdeveniment de WebSocket _
cs: payload pro WebSocket událost _
es: carga del evento de WebSocket _

source: send _ to WebSocket client _
ca: envia _ al client de WebSocket _
cs: odešli _ WebSocket klientu _
de: sende _ zum WebSocket-Client _
es: envía _ al cliente WebSocket _

source: Hello, Client!
ca: Hola, client!
cs: Ahoj kliente!
de: Hallo, Client!
es: ¡Hola, cliente!

source: Welcome to the MicroBlocks HTTP server
ca: El servidor HTTP de MicroBlocks us dona la benvinguda
cs: Vítejte na HTTP serveru MicroBlocks
de: Willkommen auf dem MicroBlocks HTTP-Server
es: El servicor HTTP de MicroBlocks os da la bienvenida

source: body of request _
ca: cos de la sol·licitud _
cs: tělo požadavku _
de: Body der Anfrage _
el: σώμα της αίτησης
es: cuerpo de la petición _
ja: リクエストのボディ _
pt_br: corpo do pedido _
ru: тело запроса _
tr: istek gövdesi _
uz: talabnoma qismi _

source: headers of request _
ca: capçaleres de la sol·licitud _
cs: záhlaví požadavku
de: Kopf der Anfrage _
es: cabeceras de la petición _

source: set thing capability to _
ca: fixa la capacitat de la cosa a _
cs: nastav schopnost WebThing na _
de: setze Thing Fähigkeit auf _
el: όρισε την ικανότητα του αντικειμένου σε _
es: fija la capacidad de la cosa a _
ja: Thing のケーパビリティを設定 _
pt_br: fixe a aptidão da coisa em _
ru: установить возможность вещи на _
tr: nesne yeteneğini _ yap
uz: narsa imkoniyatini _ belgilash

source: WebSocket server
ca: Servidor de WebSocket
es: Servidor de WebSocket

source: set boolean property _ title _ @Type _
ca: posa a la propietat booleana _ el títol _ i @Type _
cs: nastav logickou hodnotu _ jméno _ @Typ _
de: setze Boole Eigenschaft _ Name _ @Typ _
el: όρισε δυαδική ιδιότητα _ τίτλος _ @Τύπος
es: pon a la propiedad booleana _ el título _ y @Type _
ja: ブール属性を設定 _ タイトル _ @タイプ _
pt_br: fixe a propriedade booleana _ com o título _ e @Type _
ru: установить логическое свойство _ title _ @Type _
tr: boole özellik _ ad _ @Tip _
uz: boolean xususiyatini o'rnatish _ sarlavha _ @Turi _

source: set number property _ title _ @Type _
ca: posa a la propietat numèrica _ el títol _ i @Type _
cs: nastav číselnou hodnotu _ jméno _ @Typ _
de: setze Zahl Eigenschaft _ Name _ @Typ _
el: όρισε αριθμητική ιδιότητα _ τίτλος _ @Τύπος _
es: pon a la propiedad numérica _ el título _ y @Type _
ja: 数値属性を設定 _ タイトル _ @タイプ _
pt_br: fixe a propriedade numérica _ com o título _ e @Type _
ru: установить номер свойства _ title _ @Type _
tr: numara özellik _ ad _ @Tip _
uz: raqam xususiyatini _ belgilash _ @Turi

source: set number property _ title _ min _ max _ @Type _
ca: posa a la propietat numèrica _ el títol _ màxim _ mínim _ i @Type _
cs: nastav číselnou hodnotu _ jméno _ min _ max _ @Typ _
de: setze Zahl Eigenschaft _ Name _ Min _ Max _ @Typ _
el: όρισε αριθμητική ιδιότητα _ τίτλος _ ελάχιστο _ μέγιστο _ @Τύπος _
es: pon a la propiedad numérica _ el título _ mínimo _ máximo _ y @Type _
ja: 数値属性を設定 _ タイトル _ 最小 _ 最大 _ @タイプ _
pt_br: fixe a propriedade numérica _ com o título _ mínimo _ máximo _ e @Type _
ru: установить номер свойства _ title _ min _ max _ @Type _
tr: numara özellik _ ad _ min _ max _ @Tip _
uz: raqam xususiyatini belgilash _ sarlavha _ min _ maksimal _ @Turi _

source: event definitions JSON
ca: JSON de la definició d'esdeveniments
cs: definice událostí JSON
de: Ereignis-Definitionen JSON
el: ορισμοί γεγονότων JSON
es: JSON de las definiciones de eventos
ja: イベント定義 JSON
pt_br: JSON das definições de eventos
ru: определения событий JSON
tr: olayların tanımı JSON
uz: voqea ta'riflari JSON

source: properties JSON
ca: JSON de les propietats
cs: vlastnosti JSON
de: Eigenschaften JSON
el: ιδιότητες JSON
es: JSON de las propiedades
ja: JSON 属性
pt_br: propriedades JSON
ru: свойства JSON
tr: özellikler JSON
uz: JSON xususiyatlari

source: MiKe front obstacle (cm)
ca: MiKe obstacle frontal (cm)
es: MiKe obstáculo frontal (cm)

source: MiKe black line on _ ?
ca: MiKe línia negra a la _ ?
es: MiKe línea negra a la _ ?

source: MiKe back light
ca: MiKe llum al darrera
es: MiKe luz trasera

source: MiKe stop motors
ca: Mike atura els motors
es: Mike para motores

source: MiKe Robot direction _
ca: MiKe Robot fixa la direcció a _
es: MiKe Robot dirección _

source: MiKe turn _ motor _
ca: MiKe mou el motor _ en _
es: MiKe mueve motor _ en _

source: MiKe speed _ motor at _ %
ca: MiKe fixa la velocitat del motor _ a _ %
es: MiKe velocidad de motor _ a _ %

source: MiKe front lights off
ca: MiKe apaga les llums del davant
es: MiKe apaga luces delanteras

source: MiKe circle ligths to _
ca: MiKe cercle de llums a _
es: MiKe círculo de luces a _

source: MiKe rotate lights by _
ca: MiKe gira les llums en _
es: MiKe gira luces en _

source: sb set LED _ (1-4) to _
es: sb pon el LED _ (1-4) a _

source: sb send audio to shield _
es: sb envia el audio por la shieldBit _

source: sb turn 180 servo S- _ (1-8) to angle _
es: sb gira el servo 180 S- _ (1-8) al ángulo _

source: sb turn 360 servo S- _ (1-8) _ at _ %
es: sb gira el servo 360 S- _ (1-8) _ a _ %

source: sb turn DC M- _ (1-4) motor _ at _ %
es: sb gira el motor CC M- _ (1-4) _ a _ %

source: sb turn Stepper- _ (1-2) motor _ for _ _
es: sb gira el motor PaP- _ (1-2) _ per _ _

source: sb;DC/Stepper_motors
ca: motors pas a pas/CC
es: motores paso a paso/CC

source: sb;all_motors
ca: tots els motors
es: todos los motores

source: ms clear display
ca: ms esborra la pantalla
es: ms limpia la pantalla

source: ms stop scrolling
ca: ms atura l'animació
es: ms detén la animación

source: start micro꞉STEAMakers audio
ca: inicia l'audio amb m꞉STEAMakers
es: inicia el audio de micro꞉STEAMakers

source: ms button _ ?
ca: ms botó _ ?
es: ms botón _ ?

source: ms inclination towards _ º
ca: ms inclinació cap a _ º
es: ms inclinación hacia _ º

source: plotter point in direction _
ca: fixa rumb del plotter a _ °
de: plotter Punkt in Richtung _
es: fija rumbo del plotter a _ °

source: ms energy _
ca: ms energia _
es: ms energía _

source: ms _ energy meter
ca: ms _ la mesura d'energia
es: ms _ la medida de energia

source: ms energy consumption (µWh)
ca: ms consum energètic (µWh)
es: ms consumo energético (µWh)

source: ms;down
ca: baix
es: abajo

source: plotter pen down
ca: abaixa el llapis del plotter
de: Plotter Stift runter
es: baja lápiz del plotter

source: plotter pen up
ca: apuja el llapis del plotter
de: Plotter Stift hoch
es: sube lápiz del plotter

source: red
ca: vermell
de: rot
es: rojo

source: green
ca: verd
de: grün
es: verde

source: forward
ca: endavant
de: vorwärts
es: adelante

source: backward
ca: enrera
de: rückwärts
es: atrás

source: turn right
ca: gira a la dreta
de: drehe nach rechts
es: gira a la derecha

source: stop
ca: atura
cs: zastav
es: detén

source: left sensor
ca: sensor esquerra
cs: levý senzor
de: linker Sensor
es: sensor izquierdo

source: TdR LM35 temperature ºC
ca: TdR LM35 temperatura en ºC
es: TdR LM35 temperatura en ºC

source: TdR DHT11 temperature ºC
ca: TdR DHT11 temperatura en ºC
es: TdR DHT11 temperatura en ºC

source: TdR DHT11 humidity
ca: TdR DHT11 humitat
es: TdR DHT11 humedad

source: Imagina set _ led to _
ca: Imagina posa el led _ a _
es: Imagina pon el led _ a _

source: Imagina light
ca: Imagina llum
es: Imagina luz

source: Imagina button (D2) pressed?
ca: Imagina botó (D2) premut?
es: Imagina botón (D2) pulsado?

source: Imagina digital reading _
ca: Imagina lectura digital _
es: Imagina lectura digital _

source: Imagina set _ speed to _ %
ca: Imagina posa la velocitat del _ al _ %
es: Imagina pon la velocidad del _ al _ %

source: voltage (V)
ca: voltatge (V)
es: voltaje (V)

source: Imagina set servo _ to _ degrees (-90 to 90)
ca: Imagina posa el servo _ a _ graus (-90 to 90)
es: Imagina posiciona el servo _ a _ grados (-90 to 90)

source: Imagina set servo _ to speed _ (-100 to 100)
ca: Imagina posa el servo _ a la velocitat _ (-100 to 100)
es: Imagina pon el servo _ a velocidad _ (-100 to 100)

source: open
ca: obre
es: abre

source: close
ca: tanca
es: cierra

source: start
ca: encén
es: arranca

source: Farm display _ in line _
ca: Farm envia a la pantalla el text _ a la línia _
es: Farm envia a la pantalla el texto _ a la línea _

source: Farm temperature ºC
ca: Farm temperatura ºC
es: Farm temperatura ºC

source: Farm humidity
ca: Farm humitat
es: Farm humedad

source: Home _ the window
ca: Home _ la finestra
es: Home _ la ventana

source: Farm button pressed?
ca: Farm botó premut?
es: Farm ¿botón presionado?

source: Home activate the door
ca: Home activa la porta giratòria
es: Home activa la puerta giratoria

source: Farm distance (cm)
ca: Farm distància (cm)
es: Farm distancia (cm)

source: Home fan _
ca: Home _ el ventilador
es: Home _ el ventilador

source: Home display _ in line _
ca: Home envia a la pantalla el text _ a la línia _
es: Home envia a la pantalla el texto _ a la línea _

source: Home temperature ºC
ca: Home temperatura ºC
es: Home temperatura ºC

source: Home steam level
ca: Home nivell de vapor
es: Home nivel de vapor

source: Home _ button pressed?
ca: Home botó _ premut?
es: Home botón _ presionado?

source: Home gas detected?
ca: Home es detecta gas?
es: Home ¿se detecta gas?

source: Home electric consumption _
ca: Home consum elèctric _
es: Home consumo eléctrico _

source: MQTT connect to broker _
ca: connecta al broker HTTP _
cs: MQTT připoj k brokeru _
es: conéctate al broker HTTP _

source: buffer sizes _ client id _
ca: mida del buffer _ id del client _
cs: MQTT velikosti bufferů _ klienta _
es: medida del buffer _ id del cliente _

source: username _ password _
ca: usuari _ contrasenya _
cs: jméno _ heslo _
es: usuario _ contraseña _

source: MQTT connected
ca: MQTT connectat
cs: MQTT připojeno
es: MQTT conectado

source: MQTT disconnect
ca: desconnecta MQTT
cs: MQTT odpojeno
es: desconecta MQTT

source: testTopic
ca: temaDeProva
es: temaDePrueba

source: topic for MQTT event _
ca: tema de l'esdeveniment MQTT _
cs: topic pro MQTT událost _
es: tema del evento MQTT _

source: UDP start port _
ca: inicia UDP al port _
cs: spusť UDP na portu _
de: UDP starte Port _
es: inicia UDP en el puerto _

source: UDP send packet _ to ip _ port _
ca: envia paquet UDP _ a la IP _ i port _
cs: odešli UDP packet _ to IP _ port
de: UDP sende Paket _ an IP _ Port _
es: envía paquete UDP _ a la IP _ y puerto _

source: UDP receive packet
ca: rep paquet UDP
cs: přijmi UDP packetu
de: UDP empfangenes Paket
es: recibe paquete UDP

source: wifi send number _
ca: wifi envia numero _
cs: WiFi odešli číslo _
de: wifi sende Zahl _
es: envía numero _ por wifi

source: wifi send string _
ca: wifi envia text _
cs: WiFi odešli řetězec _
de: wifi sende Zeichenfolge _
es: envía texto _ por wifi

source: wifi send pair _ = _
ca: wifi envia parell _ = _
cs: WiFi odešli pár _ = _
de: wifi sende Paar _ = _
es: envía par _ = _ por wifi

source: wifi set group _ (0-255)
ca: wifi establir el grup _ (0-255)
cs: nastav skupinu WiFi _ (0-255)
de: wifi setze Gruppe _ (0-255)
es: establece grupo wifi a _ (0-255)

source: Cutebot set wheel left _ right _ (-100 to 100)
ca: Posa la roda esquerra a _ i la dreta a _ (-100 a 100)
es: pon la rueda izquierda a _ y la derecha a _ (-100 a 100)

source: Cutebot stop wheels
ca: Atura les rodes
es: detén las ruedas

source: Cutebot set servo _ to _ degrees (-90 to 90)
ca: posa el servo _ a _ graus (-90 a 90)
es: pon servo _ a _ grados (-90 a 90)
